tyropyro/CC1312tester/cc1312/cpu-mmap.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>ADI3</name>
      <description>Analog Digital Interface
          his is a generic module for handling register information between digital and analog domain.
          o see the actual contents connected on the analog side, please see:
          DI2: ADI_2_REFSYS:ADI_2_REFSYS
          DI3: ADI_3_REFSYS:ADI_3_REFSYS
          DI4: ADI_4_AUX:ADI4_AUX</description>
      <baseAddress>0x40086200</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x0200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DIR03</name>
          <description>Direct Access for ADI Byte Offsets 0 to 3</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>B3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>B2</name>
              <description>B2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>B1</name>
              <description>B1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>B0</name>
              <description>B0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR47</name>
          <description>Direct Access for ADI Byte Offsets 4 to 7</description>
          <addressOffset>4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>B3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>B2</name>
              <description>B2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>B1</name>
              <description>B1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>B0</name>
              <description>B0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR811</name>
          <description>Direct Access for ADI Byte Offsets 8 to 11</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>B3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>B2</name>
              <description>B2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>B1</name>
              <description>B1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>B0</name>
              <description>B0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR1215</name>
          <description>Direct Access for ADI Byte Offsets 12 to 15</description>
          <addressOffset>12</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>B3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>B2</name>
              <description>B2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>B1</name>
              <description>B1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>B0</name>
              <description>B0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SET03</name>
          <description>Set for ADI Byte Offsets 0 to 3</description>
          <addressOffset>16</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SET47</name>
          <description>Set for ADI Byte Offsets 4 to 7</description>
          <addressOffset>20</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SET811</name>
          <description>Set for ADI Byte Offsets 8 to 11</description>
          <addressOffset>24</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SET1215</name>
          <description>Set for ADI Byte Offsets 12 to 15</description>
          <addressOffset>28</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR03</name>
          <description>Clear for ADI Byte Offsets 0 to 3</description>
          <addressOffset>32</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR47</name>
          <description>Clear for ADI Byte Offsets 4 to 7</description>
          <addressOffset>36</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR811</name>
          <description>Clear for ADI Byte Offsets 8 to 11</description>
          <addressOffset>40</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR1215</name>
          <description>Clear for ADI Byte Offsets 12 to 15</description>
          <addressOffset>44</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REQ</name>
              <description>REQ</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ACK</name>
              <description>ACK</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>56</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>LOCK</name>
              <description>LOCK</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CLK_DIV</name>
              <description>CLK_DIV</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B01</name>
          <description>Masked Access (4m/4d), Byte Offsets 0 and 1</description>
          <addressOffset>64</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B23</name>
          <description>Masked Access (4m/4d), Byte Offsets 2 and 3</description>
          <addressOffset>68</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B45</name>
          <description>Masked Access (4m/4d), Byte Offsets 4 and 5</description>
          <addressOffset>72</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B67</name>
          <description>Masked Access (4m/4d), Byte Offsets 6 and 7</description>
          <addressOffset>76</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B89</name>
          <description>Masked Access (4m/4d), Byte Offsets 8 and 9</description>
          <addressOffset>80</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B1011</name>
          <description>Masked Access (4m/4d), Byte Offsets 10 and 11</description>
          <addressOffset>84</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
