tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          ast Measured Temperature in Degrees Celsius

          his register may be read while TEMPUPD.STAT = 1.</description>
          <addressOffset>48</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INT</name>
              <description>INT</description>
              <bitRange>[16:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMPUPD</name>
          <description>Temperature Update

          ndicates TEMP Updates</description>
          <addressOffset>52</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTMASK</name>
          <description>Event Mask</description>
          <addressOffset>72</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEMP_UPDATE_MASK</name>
              <description>TEMP_UPDATE_MASK</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BATT_UPDATE_MASK</name>
              <description>BATT_UPDATE_MASK</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TEMP_BELOW_LL_MASK</name>
              <description>TEMP_BELOW_LL_MASK</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TEMP_OVER_UL_MASK</name>
              <description>TEMP_OVER_UL_MASK</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BATT_BELOW_LL_MASK</name>
              <description>BATT_BELOW_LL_MASK</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BATT_OVER_UL_MASK</name>
              <description>BATT_OVER_UL_MASK</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENT</name>
          <description>Event</description>
          <addressOffset>76</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TEMP_UPDATE</name>
              <description>TEMP_UPDATE</description>
              <bitRange>[5:5]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>BATT_UPDATE</name>
              <description>BATT_UPDATE</description>
              <bitRange>[4:4]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TEMP_BELOW_LL</name>
              <description>TEMP_BELOW_LL</description>
              <bitRange>[3:3]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TEMP_OVER_UL</name>
              <description>TEMP_OVER_UL</description>
              <bitRange>[2:2]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>BATT_BELOW_LL</name>
              <description>BATT_BELOW_LL</description>
              <bitRange>[1:1]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>BATT_OVER_UL</name>
              <description>BATT_OVER_UL</description>
              <bitRange>[0:0]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BATTUL</name>
          <description>Battery Upper Limit</description>
          <addressOffset>80</addressOffset>
          <access>read-write</access>
          <resetValue>0x000007ff</resetValue>
          <fields>
            <field>
              <name>INT</name>
              <description>INT</description>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>FRAC</name>
              <description>FRAC</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BATTLL</name>
          <description>Battery Lower Limit</description>
          <addressOffset>84</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INT</name>
              <description>INT</description>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>FRAC</name>
              <description>FRAC</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMPUL</name>
          <description>Temperature Upper Limit</description>
          <addressOffset>88</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000ffc0</resetValue>
          <fields>
            <field>
              <name>INT</name>
              <description>INT</description>
              <bitRange>[16:8]</bitRange>
            </field>
            <field>
              <name>FRAC</name>
              <description>FRAC</description>
              <bitRange>[7:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMPLL</name>
          <description>Temperature Lower Limit</description>
          <addressOffset>92</addressOffset>
          <access>read-write</access>
          <resetValue>0x00010000</resetValue>
          <fields>
            <field>
              <name>INT</name>
              <description>INT</description>
              <bitRange>[16:8]</bitRange>
            </field>
            <field>
              <name>FRAC</name>
              <description>FRAC</description>
              <bitRange>[7:6]</bitRange>
            </field>
          </fields>
        </register>
