tyropyro/CC1312tester/cc1312/cpu-mmap.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AON_EVENT</name>
      <description>This module configures the event fabric located in the AON domain.

          ote: This module is only supporting 32 bit ReadWrite access from MCU</description>
      <baseAddress>0x40093000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MCUWUSEL</name>
          <description>Wake-up Selector For MCU

          his register contains pointers to 4 of 8 events (events 0 to 3) which are routed to AON_PMCTRL as wakeup sources for MCU. AON_PMCTRL will start a wakeup sequence for the MCU domain when either of the 8 selected events are asserted. A wakeup sequence will guarantee that the MCU power switches are turned on, LDO resources are available and SCLK_HF is available and selected as clock source for MCU.

          ote: It is required to setup a wakeup event in AON_EVENT before MCU is requesting powerdown ( PRCM requests uLDO, see conditions in PRCM:VDCTL.ULDO ).</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x3f3f3f3f</resetValue>
          <fields>
            <field>
              <name>WU3_EV</name>
              <description>WU3_EV</description>
              <bitRange>[29:24]</bitRange>
            </field>
            <field>
              <name>WU2_EV</name>
              <description>WU2_EV</description>
              <bitRange>[21:16]</bitRange>
            </field>
            <field>
              <name>WU1_EV</name>
              <description>WU1_EV</description>
              <bitRange>[13:8]</bitRange>
            </field>
            <field>
              <name>WU0_EV</name>
              <description>WU0_EV</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUWUSEL1</name>
          <description>Wake-up Selector For MCU

          his register contains pointers to 4 of 8 events (events 4 to 7) which are routed to AON_PMCTRL as wakeup sources for MCU. AON_PMCTRL will start a wakeup sequence for the MCU domain when either of the 8 selected events are asserted. A wakeup sequence will guarantee that the MCU power switches are turned on, LDO resources are available and SCLK_HF is available and selected as clock source for MCU.

          ote: It is required to setup a wakeup event in AON_EVENT before MCU is requesting powerdown ( PRCM requests uLDO, see conditions in PRCM:VDCTL.ULDO ).</description>
          <addressOffset>4</addressOffset>
          <access>read-write</access>
          <resetValue>0x3f3f3f3f</resetValue>
          <fields>
            <field>
              <name>WU7_EV</name>
              <description>WU7_EV</description>
              <bitRange>[29:24]</bitRange>
            </field>
            <field>
              <name>WU6_EV</name>
              <description>WU6_EV</description>
              <bitRange>[21:16]</bitRange>
            </field>
            <field>
              <name>WU5_EV</name>
              <description>WU5_EV</description>
              <bitRange>[13:8]</bitRange>
            </field>
            <field>
              <name>WU4_EV</name>
              <description>WU4_EV</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVTOMCUSEL</name>
          <description>Event Selector For MCU Event Fabric 

          his register contains pointers for 3 AON events that are routed to the MCU Event Fabric EVENT</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x002b2b2b</resetValue>
          <fields>
            <field>
              <name>AON_PROG2_EV</name>
              <description>AON_PROG2_EV</description>
              <bitRange>[21:16]</bitRange>
            </field>
            <field>
              <name>AON_PROG1_EV</name>
              <description>AON_PROG1_EV</description>
              <bitRange>[13:8]</bitRange>
            </field>
            <field>
              <name>AON_PROG0_EV</name>
              <description>AON_PROG0_EV</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCSEL</name>
          <description>RTC Capture Event Selector For AON_RTC

          his register contains a pointer to select an AON event for RTC capture. Please refer to AON_RTC:CH1CAPT</description>
          <addressOffset>12</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000003f</resetValue>
          <fields>
            <field>
              <name>RTC_CH1_CAPT_EV</name>
              <description>RTC_CH1_CAPT_EV</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AON_IOC</name>
      <description>Always On (AON) IO Controller  - controls IO operation when the MCU IO Controller (IOC) is powered off and resides in the AON domain.  Note: This module only supports 32 bit Read/Write access from MCU.</description>
      <baseAddress>0x40094000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IOSTRMIN</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>GRAY_CODE</name>
              <description>GRAY_CODE</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOSTRMED</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>GRAY_CODE</name>
              <description>GRAY_CODE</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOSTRMAX</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>GRAY_CODE</name>
              <description>GRAY_CODE</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK32KCTL</name>
          <description>SCLK_LF External Output Control</description>
          <addressOffset>16</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>OE_N</name>
              <description>OE_N</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TCKCTL</name>
          <description>TCK IO Pin Control</description>
          <addressOffset>20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
