tyropyro/CC1312tester/cc1312/cpu-mmap.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AON_PMCTL</name>
      <description>This component control the Power Management controller residing in the AON domain.

          ote: This module is only supporting 32 bit Read Write access from MCU</description>
      <baseAddress>0x40090000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>AUXSCECLK</name>
          <description>AUX SCE Clock Management

          his register contains bitfields that are relevant for setting up the clock to the AUX domain.</description>
          <addressOffset>4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PD_SRC</name>
              <description>PD_SRC</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SRC</name>
              <description>SRC</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMCFG</name>
          <description>RAM Configuration

          his register contains power management related configuration for the SRAM  in the MCU and AUX  domain.</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x0001000f</resetValue>
          <fields>
            <field>
              <name>AUX_SRAM_PWR_OFF</name>
              <description>AUX_SRAM_PWR_OFF</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>AUX_SRAM_RET_EN</name>
              <description>AUX_SRAM_RET_EN</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>BUS_SRAM_RET_EN</name>
              <description>BUS_SRAM_RET_EN</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRCTL</name>
          <description>Power Management Control

          his register controls bitfields for setting low level power management features such as selection of  regulator for VDDR supply and control of IO ring where certain segments can be enabled / disabled.</description>
          <addressOffset>16</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DCDC_ACTIVE</name>
              <description>DCDC_ACTIVE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EXT_REG_MODE</name>
              <description>EXT_REG_MODE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DCDC_EN</name>
              <description>DCDC_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRSTAT</name>
          <description>AON Power and Reset Status

          his register is used to monitor various power management related signals in AON.  All other signals than JTAG_PD_ON, AUX_BUS_RESET_DONE, and AUX_RESET_DONE are for test, calibration and debug purpose only.</description>
          <addressOffset>20</addressOffset>
          <access>read-write</access>
          <resetValue>0x03c00003</resetValue>
          <fields>
            <field>
              <name>JTAG_PD_ON</name>
              <description>JTAG_PD_ON</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>AUX_BUS_RESET_DONE</name>
              <description>AUX_BUS_RESET_DONE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>AUX_RESET_DONE</name>
              <description>AUX_RESET_DONE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SHUTDOWN</name>
          <description>Shutdown Control

          his register contains bitfields required for entering shutdown mode</description>
          <addressOffset>24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RECHARGECFG</name>
          <description>Recharge Controller Configuration

          his register sets all relevant parameters for controlling the recharge algorithm.</description>
          <addressOffset>28</addressOffset>
          <access>read-write</access>
          <resetValue>0xc0000000</resetValue>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitRange>[31:30]</bitRange>
            </field>
            <field>
              <name>C2</name>
              <description>C2</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>C1</name>
              <description>C1</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>MAX_PER_M</name>
              <description>MAX_PER_M</description>
              <bitRange>[15:11]</bitRange>
            </field>
            <field>
              <name>MAX_PER_E</name>
              <description>MAX_PER_E</description>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>PER_M</name>
              <description>PER_M</description>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PER_E</name>
              <description>PER_E</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RECHARGESTAT</name>
          <description>Recharge Controller Status

          his register controls various status registers which are updated during recharge.  The register is mostly intended for test and debug.</description>
          <addressOffset>32</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VDDR_SMPLS</name>
              <description>VDDR_SMPLS</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>MAX_USED_PER</name>
              <description>MAX_USED_PER</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCCFG</name>
          <description>Oscillator Configuration

          his register sets the period for Amplitude compensation requests sent to the oscillator control system. The amplitude compensations is only applicable when XOSC_HF is running in low power mode.</description>
          <addressOffset>36</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PER_M</name>
              <description>PER_M</description>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>PER_E</name>
              <description>PER_E</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RESETCTL</name>
          <description>Reset Management

