tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          his register contains bitfields related to system reset such as reset source and reset request  and control of brown out resets.</description>
          <addressOffset>40</addressOffset>
          <access>read-write</access>
          <resetValue>0x000001c0</resetValue>
          <fields>
            <field>
              <name>SYSRESET</name>
              <description>SYSRESET</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>BOOT_DET_1_CLR</name>
              <description>BOOT_DET_1_CLR</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>BOOT_DET_0_CLR</name>
              <description>BOOT_DET_0_CLR</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>BOOT_DET_1_SET</name>
              <description>BOOT_DET_1_SET</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>BOOT_DET_0_SET</name>
              <description>BOOT_DET_0_SET</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>WU_FROM_SD</name>
              <description>WU_FROM_SD</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>GPIO_WU_FROM_SD</name>
              <description>GPIO_WU_FROM_SD</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>BOOT_DET_1</name>
              <description>BOOT_DET_1</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>BOOT_DET_0</name>
              <description>BOOT_DET_0</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>VDDS_LOSS_EN</name>
              <description>VDDS_LOSS_EN</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>VDDR_LOSS_EN</name>
              <description>VDDR_LOSS_EN</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>VDD_LOSS_EN</name>
              <description>VDD_LOSS_EN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CLK_LOSS_EN</name>
              <description>CLK_LOSS_EN</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>MCU_WARM_RESET</name>
              <description>MCU_WARM_RESET</description>
              <bitRange>[4:4]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RESET_SRC</name>
              <description>RESET_SRC</description>
              <bitRange>[3:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SLEEPCTL</name>
          <description>Sleep Control

          his register is used to unfreeze the IO pad ring after waking up from SHUTDOWN</description>
          <addressOffset>44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IO_PAD_SLEEP_DIS</name>
              <description>IO_PAD_SLEEP_DIS</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>JTAGCFG</name>
          <description>JTAG Configuration

          his register contains control for configuration of the JTAG domain. This includes permissions for each TAP.</description>
          <addressOffset>52</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000100</resetValue>
          <fields>
            <field>
              <name>JTAG_PD_FORCE_ON</name>
              <description>JTAG_PD_FORCE_ON</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>JTAGUSERCODE</name>
          <description>JTAG USERCODE

          oot code copies the JTAG USERCODE to this register from where it is forwarded to the debug subsystem.</description>
          <addressOffset>60</addressOffset>
          <access>read-write</access>
          <resetValue>0x0b99a02f</resetValue>
          <fields>
            <field>
              <name>USER_CODE</name>
              <description>USER_CODE</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AON_RTC</name>
      <description>This component control the Real Time Clock residing in AON

          ote: This module is only supporting 32 bit ReadWrite access.</description>
      <baseAddress>0x40092000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTL</name>
          <description>Control

          his register contains various  bitfields for configuration of RTC
          TL Name = CONFIG</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COMB_EV_MASK</name>
              <description>COMB_EV_MASK</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>EV_DELAY</name>
              <description>EV_DELAY</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>RESET</name>
              <description>RESET</description>
              <bitRange>[7:7]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RTC_4KHZ_EN</name>
              <description>RTC_4KHZ_EN</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RTC_UPD_EN</name>
              <description>RTC_UPD_EN</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVFLAGS</name>
          <description>Event Flags, RTC Status

          his register contains event flags from the 3 RTC channels. Each flag will be cleared when writing a '1' to the corresponding bitfield.</description>
          <addressOffset>4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH2</name>
              <description>CH2</description>
              <bitRange>[16:16]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CH1</name>
              <description>CH1</description>
              <bitRange>[8:8]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CH0</name>
              <description>CH0</description>
              <bitRange>[0:0]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC</name>
          <description>Second Counter Value, Integer Part</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSEC</name>
          <description>Second Counter Value, Fractional Part</description>
          <addressOffset>12</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSECINC</name>
          <description>Subseconds Increment
          alue added to SUBSEC.VALUE on every SCLK_LFclock cycle.</description>
          <addressOffset>16</addressOffset>
          <access>read-only</access>
          <resetValue>0x00800000</resetValue>
          <fields>
            <field>
              <name>VALUEINC</name>
              <description>VALUEINC</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CHCTL</name>
          <description>Channel Configuration</description>
          <addressOffset>20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH2_CONT_EN</name>
              <description>CH2_CONT_EN</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CH2_EN</name>
              <description>CH2_EN</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CH1_CAPT_EN</name>
              <description>CH1_CAPT_EN</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CH1_EN</name>
              <description>CH1_EN</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CH0_EN</name>
              <description>CH0_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0CMP</name>
          <description>Channel 0 Compare Value</description>
          <addressOffset>24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH1CMP</name>
          <description>Channel 1 Compare Value</description>
          <addressOffset>28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2CMP</name>
          <description>Channel 2 Compare Value</description>
          <addressOffset>32</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2CMPINC</name>
          <description>Channel 2 Compare Value Auto-increment

          his register is primarily used to generate periodical wake-up for the AUX_SCE module, through the [AUX_EVCTL.EVSTAT0.AON_RTC] event.</description>
          <addressOffset>36</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH1CAPT</name>
          <description>Channel 1 Capture Value

          f CHCTL.CH1_EN = 1and CHCTL.CH1_CAPT_EN = 1, capture occurs on each rising edge of the event selected in AON_EVENT:RTCSEL.</description>
          <addressOffset>40</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEC</name>
              <description>SEC</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>SUBSEC</name>
              <description>SUBSEC</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC</name>
          <description>AON Synchronization

          his register is used for synchronizing between MCU and entire AON domain.</description>
          <addressOffset>44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WBUSY</name>
              <description>WBUSY</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIME</name>
          <description>Current  Counter Value</description>
          <addressOffset>48</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEC_L</name>
              <description>SEC_L</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>SUBSEC_H</name>
              <description>SUBSEC_H</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCLF</name>
          <description>Synchronization to SCLK_LF
          his register is used for synchronizing MCU to positive or negative edge of SCLK_LF.</description>
          <addressOffset>52</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PHASE</name>
              <description>PHASE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
