tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>MASK4B1213</name>
          <description>Masked Access (4m/4d), Byte Offsets 12 and 13</description>
          <addressOffset>88</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B1415</name>
          <description>Masked Access (4m/4d), Byte Offsets 14 and 15</description>
          <addressOffset>92</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B01</name>
          <description>Masked Access (8m/8d), Byte Offsets 0 and 1</description>
          <addressOffset>96</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B23</name>
          <description>Masked Access (8m/8d), Byte Offsets 2 and 3</description>
          <addressOffset>100</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B45</name>
          <description>Masked Access (8m/8d), Byte Offsets 4 and 5</description>
          <addressOffset>104</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B67</name>
          <description>Masked Access (8m/8d), Byte Offsets 6 and 7</description>
          <addressOffset>108</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B89</name>
          <description>Masked Access (8m/8d), Byte Offsets 8 and 9</description>
          <addressOffset>112</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B1011</name>
          <description>Masked Access (8m/8d), Byte Offsets 10 and 11</description>
          <addressOffset>116</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B1213</name>
          <description>Masked Access (8m/8d), Byte Offsets 12 and 13</description>
          <addressOffset>120</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B1415</name>
          <description>Masked Access (8m/8d), Byte Offsets 14 and 15</description>
          <addressOffset>124</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B01</name>
          <description>Masked Access (16m/16d), Byte Offsets 0 and 1</description>
          <addressOffset>128</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B23</name>
          <description>Masked Access (16m/16d), Byte Offsets 2 and 3</description>
          <addressOffset>132</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B45</name>
          <description>Masked Access (16m/16d), Byte Offsets 4 and 5</description>
          <addressOffset>136</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B67</name>
          <description>Masked Access (16m/16d), Byte Offsets 6 and 7</description>
          <addressOffset>140</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B89</name>
          <description>Masked Access (16m/16d), Byte Offsets 8 and 9</description>
          <addressOffset>144</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B1011</name>
          <description>Masked Access (16m/16d), Byte Offsets 10 and 11</description>
          <addressOffset>148</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B1213</name>
          <description>Masked Access (16m/16d), Byte Offsets 12 and 13</description>
          <addressOffset>152</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B1415</name>
          <description>Masked Access (16m/16d), Byte Offsets 14 and 15</description>
          <addressOffset>156</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
