tyropyro/CC1312tester/cc1312/cpu-mmap.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_AIODIO0</name>
      <description>AUX Analog Digital Input Output Controller (AUX_AIODIO) controls the general purpose input output pins of the AUX domain. These pins are referenced as AUXIO and can:
           be connected to analog AUX modules, such as comparators and ADC.
           be used by AUX_SCE.
           connect to AUX_SPIM SCLK, MISO and MOSI signals.
           connect to the asynchronous AUX event bus.

          nabled digital inputs are synchronized at SCE clock rate.

          ote that the IO mapping in the AUX domain is different from the IO mapping in the MCU domain. This means that AUXIO[n] does not map to DIO[n]. AUXIO-DIO remapping is handled by Sensor Controller Studio.</description>
      <baseAddress>0x400cc000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IOMODE</name>
          <description>Input Output Mode

          his register controls pull-up, pull-down, and output mode for AUXIO that are controlled by instance i of AUX_AIODIO. Hence, in formulas below i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IO7</name>
              <description>IO7</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>IO6</name>
              <description>IO6</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>IO5</name>
              <description>IO5</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IO4</name>
              <description>IO4</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IO3</name>
              <description>IO3</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>IO2</name>
              <description>IO2</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>IO1</name>
              <description>IO1</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>IO0</name>
              <description>IO0</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIODIE</name>
          <description>General Purpose Input Output Digital Input Enable

          his register controls input buffers for AUXIO that are controlled by instance i of AUX_AIODIO.  Hence, in formulas below i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <addressOffset>4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IO7_0</name>
              <description>IO7_0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOPOE</name>
          <description>Input Output Peripheral Output Enable

          his register selects the output source for AUXIO that are controlled by instance i of AUX_AIODIO. Hence, in formulas below i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IO7_0</name>
              <description>IO7_0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIODOUT</name>
          <description>General Purpose Input Output Data Out

          he output data register is used to set data on AUXIO that are controlled by instance i of AUX_AIODIO.  Hence, in formulas below i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <addressOffset>12</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IO7_0</name>
              <description>IO7_0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIODIN</name>
          <description>General Purpose Input Output Data In

          his register provides synchronized input data for AUXIO  that are controlled by instance i of AUX_AIODIO. Hence, in formulas below i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth</description>
          <addressOffset>16</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IO7_0</name>
              <description>IO7_0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIODOUTSET</name>
          <description>General Purpose Input Output Data Out Set

          et bits in GPIODOUT in instance i of AUX_AIODIO. Hence, in formulas below i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <addressOffset>20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IO7_0</name>
              <description>IO7_0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIODOUTCLR</name>
          <description>General Purpose Input Output Data Out Clear

