tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          lear bits in GPIODOUT instance i of AUX_AIODIO. Hence, in formulas below i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <addressOffset>24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IO7_0</name>
              <description>IO7_0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIODOUTTGL</name>
          <description>General Purpose Input Output Data Out Toggle

          oggle bits in GPIODOUT in instance i of AUX_AIODIO. Hence, in formulas below i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <addressOffset>28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IO7_0</name>
              <description>IO7_0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IO0PSEL</name>
          <description>Input Output 0 Peripheral Select

          his register selects a peripheral signal that connects to AUXIO[8i+0] when IOPOE bit 0 is 1. 

          o avoid glitches on AUXIO[8i+0] you must configure this register while IOPOE bit 0 is 0.

          n the formulas i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <addressOffset>32</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SRC</name>
              <description>SRC</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IO1PSEL</name>
          <description>Input Output 1 Peripheral Select

          his register selects a peripheral signal that connects to AUXIO[8i+1] when IOPOE bit 1 is 1. 

          o avoid glitches on AUXIO[8i+1] you must configure this register while IOPOE bit 1 is 0.

          n the formulas i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <addressOffset>36</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SRC</name>
              <description>SRC</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IO2PSEL</name>
          <description>Input Output 2 Peripheral Select

          his register selects a peripheral signal that connects to AUXIO[8i+2] when IOPOE bit 2 is 1. 

          o avoid glitches on AUXIO[8i+2] you must configure this register while IOPOE bit 2 is 0.

          n the formulas i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <addressOffset>40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SRC</name>
              <description>SRC</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IO3PSEL</name>
          <description>Input Output 3 Peripheral Select

          his register selects a peripheral signal that connects to AUXIO[8i+3] when IOPOE bit 3 is 1. 

          o avoid glitches on AUXIO[8i+3] you must configure this register while IOPOE bit 3 is 0.

          n the formulas i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <addressOffset>44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SRC</name>
              <description>SRC</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IO4PSEL</name>
          <description>Input Output 4 Peripheral Select

          his register selects a peripheral signal that connects to AUXIO[8i+4] when IOPOE bit 4 is 1. 

          o avoid glitches on AUXIO[8i+4] you must configure this register while IOPOE bit 4 is 0.

          n the formulas i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <addressOffset>48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SRC</name>
              <description>SRC</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IO5PSEL</name>
          <description>Input Output 5 Peripheral Select

          his register selects a peripheral signal that connects to AUXIO[8i+5] when IOPOE bit 5 is 1. 

          o avoid glitches on AUXIO[8i+5] you must configure this register while IOPOE bit 5 is 0.

          n the formulas i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <addressOffset>52</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SRC</name>
              <description>SRC</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IO6PSEL</name>
          <description>Input Output 6 Peripheral Select

          his register selects a peripheral signal that connects to AUXIO[8i+6] when IOPOE bit 6 is 1. 

          o avoid glitches on AUXIO[8i+6] you must configure this register while IOPOE bit 6 is 0.

          n the formulas i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <addressOffset>56</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SRC</name>
              <description>SRC</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IO7PSEL</name>
          <description>Input Output 7 Peripheral Select

          his register selects a peripheral signal that connects to AUXIO[8i+7] when IOPOE bit 7 is 1. 

          o avoid glitches on AUXIO[8i+7] you must configure this register while IOPOE bit 7 is 0.

          n the formulas i = 0 for AUX_AIODIO0, i = 1 for AUX_AIODIO1, and so forth.</description>
          <addressOffset>60</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SRC</name>
              <description>SRC</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOMODEL</name>
          <description>Input Output Mode Low

