tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          his is an alias register for IOMODE.IO0 thru IOMODE.IO3.</description>
          <addressOffset>64</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IO3</name>
              <description>IO3</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>IO2</name>
              <description>IO2</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>IO1</name>
              <description>IO1</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>IO0</name>
              <description>IO0</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOMODEH</name>
          <description>Input Output Mode High

          his is an alias register for IOMODE.IO4 thru IOMODE.IO7.</description>
          <addressOffset>68</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IO7</name>
              <description>IO7</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>IO6</name>
              <description>IO6</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>IO5</name>
              <description>IO5</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>IO4</name>
              <description>IO4</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_ANAIF</name>
      <description>AUX Analog Interface (AUX_ANAIF) encapsulates direct data and control interfaces between AUX digital and AUX analog circuits. It lets AUX_SCE,  UDMA0, and system CPU:
          Trigger ADC sample and conversion process.
           Write ADC samples to FIFO.
           Charge analog nodes by the use of the analog ISRC module. See ADI_4_AUX:ISRC and ADI_4_AUX:COMP.COMPA_REF_CURR_EN  for further information.
           Use the DAC to generate a programmable voltage on COMPB_REF, COMPA_REF, or COMPA_IN analog nodes.  

          o use:
           ADC  : AUX_SCE must request active operational mode with AON_PMCTL:AUXSCECLK.SRC set to SCLK_HFDIV2. There are no requirements for system CPU.
           ISRC : AUX_SCE must request active operational mode. There are no requirements for system CPU.
           DAC  : AUX_SCE must set AUX_SYSIF:PEROPRATE.ANAIF_DAC_OP_RATE to SCE_RATE as long as DAC state machine generates the sample clock. System CPU must set AUX_SYSIF:PEROPRATE.ANAIF_DAC_OP_RATE to BUS_RATE as long as DAC state machine generates the sample clock. See DACSMPLCTL.EN for further information.</description>
      <baseAddress>0x400c9000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ADCCTL</name>
          <description>ADC Control

          onfiguration of ADI_4_AUX:ADC0.SMPL_MODE decides if the ADC trigger starts sampling or conversion.</description>
          <addressOffset>16</addressOffset>
          <access>read-write</access>
          <resetValue>0x00003f00</resetValue>
          <fields>
            <field>
              <name>START_POL</name>
              <description>START_POL</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>START_SRC</name>
              <description>START_SRC</description>
              <bitRange>[13:8]</bitRange>
            </field>
            <field>
              <name>CMD</name>
              <description>CMD</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCFIFOSTAT</name>
          <description>ADC FIFO Status

          IFO can hold up to four ADC samples.</description>
          <addressOffset>20</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>OVERFLOW</name>
              <description>OVERFLOW</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UNDERFLOW</name>
              <description>UNDERFLOW</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>FULL</name>
              <description>FULL</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ALMOST_FULL</name>
              <description>ALMOST_FULL</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EMPTY</name>
              <description>EMPTY</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCFIFO</name>
          <description>ADC FIFO</description>
          <addressOffset>24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>DATA</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCTRIG</name>
          <description>ADC Trigger</description>
          <addressOffset>28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>START</name>
              <description>START</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ISRCCTL</name>
          <description>Current Source Control</description>
          <addressOffset>32</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>RESET_N</name>
              <description>RESET_N</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DACCTL</name>
          <description>DAC Control

