tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          his register controls the analog part of the DAC.</description>
          <addressOffset>48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DAC_EN</name>
              <description>DAC_EN</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DAC_BUFFER_EN</name>
              <description>DAC_BUFFER_EN</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DAC_PRECHARGE_EN</name>
              <description>DAC_PRECHARGE_EN</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DAC_VOUT_SEL</name>
              <description>DAC_VOUT_SEL</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LPMBIASCTL</name>
          <description>Low Power Mode Bias Control

          he low power mode bias module provides bias current to DAC and Comparator A when AUX_SYSIF:OPMODEREQ.REQ differers from A.</description>
          <addressOffset>52</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DACSMPLCTL</name>
          <description>DAC Sample Control

          he DAC sample clock maintains the DAC voltage stored in the sample-and-hold capacitor. The DAC sample clock waveform consists of a setup phase followed by a hold phase. In the setup phase the sample-and-hold capacitor charges to the programmed voltage. The hold phase  maintains the voltage with minimal power. 

          ACSMPLCFG0 and DACSMPLCFG1 configure the DAC sample clock waveform.</description>
          <addressOffset>56</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DACSMPLCFG0</name>
          <description>DAC Sample Configuration 0</description>
          <addressOffset>60</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLKDIV</name>
              <description>CLKDIV</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DACSMPLCFG1</name>
          <description>DAC Sample Configuration 1

          he sample clock period equals (high time + low time) * base period. DACSMPLCFG0.CLKDIV determines the base period.

          iming  requirements (DAC Buffer On / DAC Buffer Off):
           (high time + low time) * base period &gt; (4 us / 1 us)
           (high time * base period) &gt; (2 us / 0.5 us)
           (low time * base period)  &gt; (2 us / 0.5 us)
           (low time * base period + HOLD_INTERVAL * sample clock period) &lt; 32 us 

          f AUX_SYSIF:OPMODEREQ.REQ equals PDLP, you must set:
           H_PER = L_PER = HOLD_INTERVAL = 0.</description>
          <addressOffset>64</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>H_PER</name>
              <description>H_PER</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>L_PER</name>
              <description>L_PER</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>SETUP_CNT</name>
              <description>SETUP_CNT</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>HOLD_INTERVAL</name>
              <description>HOLD_INTERVAL</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DACVALUE</name>
          <description>DAC Value</description>
          <addressOffset>68</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DACSTAT</name>
          <description>DAC Status</description>
          <addressOffset>72</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SETUP_ACTIVE</name>
              <description>SETUP_ACTIVE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HOLD_ACTIVE</name>
              <description>HOLD_ACTIVE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_DDI0_OSC</name>
      <description>Digital to Digital Interface
          his is a generic module for handling register information between digital core and and digital subchips within the analog domain.
          o see the actual contents connected on the analog side, please see:
          DI0: DDI_0_OSC:DDI_0_OSC</description>
      <baseAddress>0x400ca000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DIR03</name>
          <description>Direct Access for  DDI Byte Offsets 0 to 3</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>B3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>B2</name>
              <description>B2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>B1</name>
              <description>B1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>B0</name>
              <description>B0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR47</name>
          <description>Direct Access for  DDI Byte Offsets 4 to 7</description>
          <addressOffset>4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>B3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>B2</name>
              <description>B2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>B1</name>
              <description>B1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>B0</name>
              <description>B0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR811</name>
          <description>Direct Access for  DDI Byte Offsets 8 to 11</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>B3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>B2</name>
              <description>B2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>B1</name>
              <description>B1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>B0</name>
              <description>B0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR1215</name>
          <description>Direct Access for  DDI Byte Offsets 12 to 15</description>
          <addressOffset>12</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>B3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>B2</name>
              <description>B2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>B1</name>
              <description>B1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>B0</name>
              <description>B0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR1619</name>
          <description>Direct Access for  DDI Byte Offsets 16 to 19</description>
          <addressOffset>16</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>B3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>B2</name>
              <description>B2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>B1</name>
              <description>B1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>B0</name>
              <description>B0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR2023</name>
          <description>Direct Access for  DDI Byte Offsets 20 to 23</description>
          <addressOffset>20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>B3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>B2</name>
              <description>B2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>B1</name>
              <description>B1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>B0</name>
              <description>B0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR2427</name>
          <description>Direct Access for  DDI Byte Offsets 24 to 27</description>
          <addressOffset>24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>B3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>B2</name>
              <description>B2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>B1</name>
              <description>B1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>B0</name>
              <description>B0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR2831</name>
          <description>Direct Access for  DDI Byte Offsets 28 to 31</description>
          <addressOffset>28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>B3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>B2</name>
              <description>B2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>B1</name>
              <description>B1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>B0</name>
              <description>B0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR3235</name>
          <description>Direct Access for  DDI Byte Offsets 32 to 35</description>
          <addressOffset>32</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>B3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>B2</name>
              <description>B2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>B1</name>
              <description>B1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>B0</name>
              <description>B0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR3639</name>
          <description>Direct Access for  DDI Byte Offsets 36 to 39</description>
          <addressOffset>36</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>B3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>B2</name>
              <description>B2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>B1</name>
              <description>B1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>B0</name>
              <description>B0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR4043</name>
          <description>Direct Access for  DDI Byte Offsets 40 to 43</description>
          <addressOffset>40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>B3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>B2</name>
              <description>B2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>B1</name>
              <description>B1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>B0</name>
              <description>B0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR4447</name>
          <description>Direct Access for  DDI Byte Offsets 44 to 47</description>
          <addressOffset>44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>B3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>B2</name>
              <description>B2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>B1</name>
              <description>B1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>B0</name>
              <description>B0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR4851</name>
          <description>Direct Access for  DDI Byte Offsets 48 to 51</description>
          <addressOffset>48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>B3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>B2</name>
              <description>B2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>B1</name>
              <description>B1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>B0</name>
              <description>B0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR5255</name>
          <description>Direct Access for  DDI Byte Offsets 52 to 55</description>
          <addressOffset>52</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>B3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>B2</name>
              <description>B2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>B1</name>
              <description>B1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>B0</name>
              <description>B0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR5659</name>
          <description>Direct Access for  DDI Byte Offsets 56 to 59</description>
          <addressOffset>56</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>B3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>B2</name>
              <description>B2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>B1</name>
              <description>B1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>B0</name>
              <description>B0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR6063</name>
          <description>Direct Access for  DDI Byte Offsets 60 to 63</description>
          <addressOffset>60</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>B3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>B2</name>
              <description>B2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>B1</name>
              <description>B1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>B0</name>
              <description>B0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR6467</name>
          <description>Direct Access for  DDI Byte Offsets 64 to 67</description>
          <addressOffset>64</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>B3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>B2</name>
              <description>B2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>B1</name>
              <description>B1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>B0</name>
              <description>B0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR6871</name>
          <description>Direct Access for  DDI Byte Offsets 68 to 71</description>
          <addressOffset>68</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B3</name>
              <description>B3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>B2</name>
              <description>B2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>B1</name>
              <description>B1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>B0</name>
              <description>B0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
