tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>SET03</name>
          <description>Set for DDI Byte Offsets 0 to 3</description>
          <addressOffset>128</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SET47</name>
          <description>Set for DDI Byte Offsets 4 to 7</description>
          <addressOffset>132</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SET811</name>
          <description>Set for DDI Byte Offsets 8 to 11</description>
          <addressOffset>136</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SET1215</name>
          <description>Set for DDI Byte Offsets 12 to 15</description>
          <addressOffset>140</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SET1619</name>
          <description>Set for DDI Byte Offsets 16 to 19</description>
          <addressOffset>144</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SET2023</name>
          <description>Set for DDI Byte Offsets 20 to 23</description>
          <addressOffset>148</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SET2427</name>
          <description>Set for DDI Byte Offsets 24 to 27</description>
          <addressOffset>152</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SET2831</name>
          <description>Set for DDI Byte Offsets 28 to 31</description>
          <addressOffset>156</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SET3235</name>
          <description>Set for DDI Byte Offsets 32 to 35</description>
          <addressOffset>160</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SET3639</name>
          <description>Set for DDI Byte Offsets 36 to 39</description>
          <addressOffset>164</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SET4043</name>
          <description>Set for DDI Byte Offsets 40 to 43</description>
          <addressOffset>168</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SET4447</name>
          <description>Set for DDI Byte Offsets 44 to 47</description>
          <addressOffset>172</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SET4851</name>
          <description>Set for DDI Byte Offsets 48 to 51</description>
          <addressOffset>176</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SET5255</name>
          <description>Set for DDI Byte Offsets 52 to 55</description>
          <addressOffset>180</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SET5659</name>
          <description>Set for DDI Byte Offsets 56 to 59</description>
          <addressOffset>184</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SET6063</name>
          <description>Set for DDI Byte Offsets 60 to 63</description>
          <addressOffset>188</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SET6467</name>
          <description>Set for DDI Byte Offsets 64 to 67</description>
          <addressOffset>192</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SET6871</name>
          <description>Set for DDI Byte Offsets 68 to 71</description>
          <addressOffset>196</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR03</name>
          <description>Clear for DDI Byte Offsets 0 to 3</description>
          <addressOffset>256</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR47</name>
          <description>Clear for DDI Byte Offsets 4 to 7</description>
          <addressOffset>260</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR811</name>
          <description>Clear for DDI Byte Offsets 8 to 11</description>
          <addressOffset>264</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR1215</name>
          <description>Clear for DDI Byte Offsets 12 to 15</description>
          <addressOffset>268</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR1619</name>
          <description>Clear for DDI Byte Offsets 16 to 19</description>
          <addressOffset>272</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR2023</name>
          <description>Clear for DDI Byte Offsets 20 to 23</description>
          <addressOffset>276</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR2427</name>
          <description>Clear for DDI Byte Offsets 24 to 27</description>
          <addressOffset>280</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
