tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>CLR2831</name>
          <description>Clear for DDI Byte Offsets 28 to 31</description>
          <addressOffset>284</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR3235</name>
          <description>Clear for DDI Byte Offsets 32 to 35</description>
          <addressOffset>288</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR3639</name>
          <description>Clear for DDI Byte Offsets 36 to 39</description>
          <addressOffset>292</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR4043</name>
          <description>Clear for DDI Byte Offsets 40 to 43</description>
          <addressOffset>296</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR4447</name>
          <description>Clear for DDI Byte Offsets 44 to 47</description>
          <addressOffset>300</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR4851</name>
          <description>Clear for DDI Byte Offsets 48 to 51</description>
          <addressOffset>304</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR5255</name>
          <description>Clear for DDI Byte Offsets 52 to 55</description>
          <addressOffset>308</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR5659</name>
          <description>Clear for DDI Byte Offsets 56 to 59</description>
          <addressOffset>312</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR6063</name>
          <description>Clear for DDI Byte Offsets 60 to 63</description>
          <addressOffset>316</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR6467</name>
          <description>Clear for DDI Byte Offsets 64 to 67</description>
          <addressOffset>320</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR6871</name>
          <description>Clear for DDI Byte Offsets 68 to 71</description>
          <addressOffset>324</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S3</name>
              <description>S3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>S2</name>
              <description>S2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>S1</name>
              <description>S1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>S0</name>
              <description>S0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>384</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REQ</name>
              <description>REQ</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ACK</name>
              <description>ACK</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>392</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>LOCK</name>
              <description>LOCK</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CLK_DIV</name>
              <description>CLK_DIV</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B01</name>
          <description>Masked Access (4m/4d), Byte Offsets 0 and 1</description>
          <addressOffset>512</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B23</name>
          <description>Masked Access (4m/4d), Byte Offsets 2 and 3</description>
          <addressOffset>516</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B45</name>
          <description>Masked Access (4m/4d), Byte Offsets 4 and 5</description>
          <addressOffset>520</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B67</name>
          <description>Masked Access (4m/4d), Byte Offsets 6 and 7</description>
          <addressOffset>524</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B89</name>
          <description>Masked Access (4m/4d), Byte Offsets 8 and 9</description>
          <addressOffset>528</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B1011</name>
          <description>Masked Access (4m/4d), Byte Offsets 10 and 11</description>
          <addressOffset>532</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B1213</name>
          <description>Masked Access (4m/4d), Byte Offsets 12 and 13</description>
          <addressOffset>536</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
