tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>MASK4B1415</name>
          <description>Masked Access (4m/4d), Byte Offsets 14 and 15</description>
          <addressOffset>540</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B1617</name>
          <description>Masked Access (4m/4d), Byte Offsets 16 and 17</description>
          <addressOffset>544</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B1819</name>
          <description>Masked Access (4m/4d), Byte Offsets 18 and 19</description>
          <addressOffset>548</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B2021</name>
          <description>Masked Access (4m/4d), Byte Offsets 20 and 21</description>
          <addressOffset>552</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B2223</name>
          <description>Masked Access (4m/4d), Byte Offsets 22 and 23</description>
          <addressOffset>556</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B2425</name>
          <description>Masked Access (4m/4d), Byte Offsets 24 and 25</description>
          <addressOffset>560</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B2627</name>
          <description>Masked Access (4m/4d), Byte Offsets 26 and 27</description>
          <addressOffset>564</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B2829</name>
          <description>Masked Access (4m/4d), Byte Offsets 28 and 29</description>
          <addressOffset>568</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B3031</name>
          <description>Masked Access (4m/4d), Byte Offsets 30 and 31</description>
          <addressOffset>572</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B3233</name>
          <description>Masked Access (4m/4d), Byte Offsets 32 and 33</description>
          <addressOffset>576</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B3435</name>
          <description>Masked Access (4m/4d), Byte Offsets 34 and 35</description>
          <addressOffset>580</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B3637</name>
          <description>Masked Access (4m/4d), Byte Offsets 36 and 37</description>
          <addressOffset>584</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B3839</name>
          <description>Masked Access (4m/4d), Byte Offsets 38 and 39</description>
          <addressOffset>588</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B4041</name>
          <description>Masked Access (4m/4d), Byte Offsets 40 and 41</description>
          <addressOffset>592</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B4243</name>
          <description>Masked Access (4m/4d), Byte Offsets 42 and 43</description>
          <addressOffset>596</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
