tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>MASK4B4445</name>
          <description>Masked Access (4m/4d), Byte Offsets 44 and 45</description>
          <addressOffset>600</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B4647</name>
          <description>Masked Access (4m/4d), Byte Offsets 46 and 47</description>
          <addressOffset>604</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B4849</name>
          <description>Masked Access (4m/4d), Byte Offsets 48 and 49</description>
          <addressOffset>608</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B5051</name>
          <description>Masked Access (4m/4d), Byte Offsets 50 and 51</description>
          <addressOffset>612</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B5253</name>
          <description>Masked Access (4m/4d), Byte Offsets 52 and 53</description>
          <addressOffset>616</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B5455</name>
          <description>Masked Access (4m/4d), Byte Offsets 54 and 55</description>
          <addressOffset>620</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B5657</name>
          <description>Masked Access (4m/4d), Byte Offsets 56 and 57</description>
          <addressOffset>624</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B5859</name>
          <description>Masked Access (4m/4d), Byte Offsets 58 and 59</description>
          <addressOffset>628</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B6061</name>
          <description>Masked Access (4m/4d), Byte Offsets 60 and 61</description>
          <addressOffset>632</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B6263</name>
          <description>Masked Access (4m/4d), Byte Offsets 62 and 63</description>
          <addressOffset>636</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B6465</name>
          <description>Masked Access (4m/4d), Byte Offsets 64 and 65</description>
          <addressOffset>640</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B6667</name>
          <description>Masked Access (4m/4d), Byte Offsets 66 and 67</description>
          <addressOffset>644</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B6869</name>
          <description>Masked Access (4m/4d), Byte Offsets 68 and 69</description>
          <addressOffset>648</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK4B7071</name>
          <description>Masked Access (4m/4d), Byte Offsets 70 and 71</description>
          <addressOffset>652</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1H</name>
              <description>M1H</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>D1H</name>
              <description>D1H</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>M1L</name>
              <description>M1L</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>D1L</name>
              <description>D1L</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>M0H</name>
              <description>M0H</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>D0H</name>
              <description>D0H</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>M0L</name>
              <description>M0L</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>D0L</name>
              <description>D0L</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B01</name>
          <description>Masked Access (8m/8d), Byte Offsets 0 and 1</description>
          <addressOffset>768</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
