tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>MASK8B23</name>
          <description>Masked Access (8m/8d), Byte Offsets 2 and 3</description>
          <addressOffset>772</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B45</name>
          <description>Masked Access (8m/8d), Byte Offsets 4 and 5</description>
          <addressOffset>776</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B67</name>
          <description>Masked Access (8m/8d), Byte Offsets 6 and 7</description>
          <addressOffset>780</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B89</name>
          <description>Masked Access (8m/8d), Byte Offsets 8 and 9</description>
          <addressOffset>784</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B1011</name>
          <description>Masked Access (8m/8d), Byte Offsets 10 and 11</description>
          <addressOffset>788</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B1213</name>
          <description>Masked Access (8m/8d), Byte Offsets 12 and 13</description>
          <addressOffset>792</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B1415</name>
          <description>Masked Access (8m/8d), Byte Offsets 14 and 15</description>
          <addressOffset>796</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B1617</name>
          <description>Masked Access (8m/8d), Byte Offsets 16 and 17</description>
          <addressOffset>800</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B1819</name>
          <description>Masked Access (8m/8d), Byte Offsets 18 and 19</description>
          <addressOffset>804</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B2021</name>
          <description>Masked Access (8m/8d), Byte Offsets 20 and 21</description>
          <addressOffset>808</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B2223</name>
          <description>Masked Access (8m/8d), Byte Offsets 22 and 23</description>
          <addressOffset>812</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B2425</name>
          <description>Masked Access (8m/8d), Byte Offsets 24 and 25</description>
          <addressOffset>816</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B2627</name>
          <description>Masked Access (8m/8d), Byte Offsets 26 and 27</description>
          <addressOffset>820</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B2829</name>
          <description>Masked Access (8m/8d), Byte Offsets 28 and 29</description>
          <addressOffset>824</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B3031</name>
          <description>Masked Access (8m/8d), Byte Offsets 30 and 31</description>
          <addressOffset>828</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B3233</name>
          <description>Masked Access (8m/8d), Byte Offsets 32 and 33</description>
          <addressOffset>832</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B3435</name>
          <description>Masked Access (8m/8d), Byte Offsets 34 and 35</description>
          <addressOffset>836</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B3637</name>
          <description>Masked Access (8m/8d), Byte Offsets 36 and 37</description>
          <addressOffset>840</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B3839</name>
          <description>Masked Access (8m/8d), Byte Offsets 38 and 39</description>
          <addressOffset>844</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B4041</name>
          <description>Masked Access (8m/8d), Byte Offsets 40 and 41</description>
          <addressOffset>848</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B4243</name>
          <description>Masked Access (8m/8d), Byte Offsets 42 and 43</description>
          <addressOffset>852</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B4445</name>
          <description>Masked Access (8m/8d), Byte Offsets 44 and 45</description>
          <addressOffset>856</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B4647</name>
          <description>Masked Access (8m/8d), Byte Offsets 46 and 47</description>
          <addressOffset>860</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B4849</name>
          <description>Masked Access (8m/8d), Byte Offsets 48 and 49</description>
          <addressOffset>864</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B5051</name>
          <description>Masked Access (8m/8d), Byte Offsets 50 and 51</description>
          <addressOffset>868</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
