tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>MASK8B5253</name>
          <description>Masked Access (8m/8d), Byte Offsets 52 and 53</description>
          <addressOffset>872</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B5455</name>
          <description>Masked Access (8m/8d), Byte Offsets 54 and 55</description>
          <addressOffset>876</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B5657</name>
          <description>Masked Access (8m/8d), Byte Offsets 56 and 57</description>
          <addressOffset>880</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B5859</name>
          <description>Masked Access (8m/8d), Byte Offsets 58 and 59</description>
          <addressOffset>884</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B6061</name>
          <description>Masked Access (8m/8d), Byte Offsets 60 and 61</description>
          <addressOffset>888</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B6263</name>
          <description>Masked Access (8m/8d), Byte Offsets 62 and 63</description>
          <addressOffset>892</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B6465</name>
          <description>Masked Access (8m/8d), Byte Offsets 64 and 65</description>
          <addressOffset>896</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B6667</name>
          <description>Masked Access (8m/8d), Byte Offsets 66 and 67</description>
          <addressOffset>900</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B6869</name>
          <description>Masked Access (8m/8d), Byte Offsets 68 and 69</description>
          <addressOffset>904</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK8B7071</name>
          <description>Masked Access (8m/8d), Byte Offsets 70 and 71</description>
          <addressOffset>908</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M1</name>
              <description>M1</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>D1</name>
              <description>D1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <description>M0</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>D0</name>
              <description>D0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B01</name>
          <description>Masked Access (16m/16d), Byte Offsets 0 and 1</description>
          <addressOffset>1024</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B23</name>
          <description>Masked Access (16m/16d), Byte Offsets 2 and 3</description>
          <addressOffset>1028</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B45</name>
          <description>Masked Access (16m/16d), Byte Offsets 4 and 5</description>
          <addressOffset>1032</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B67</name>
          <description>Masked Access (16m/16d), Byte Offsets 6 and 7</description>
          <addressOffset>1036</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B89</name>
          <description>Masked Access (16m/16d), Byte Offsets 8 and 9</description>
          <addressOffset>1040</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B1011</name>
          <description>Masked Access (16m/16d), Byte Offsets 10 and 11</description>
          <addressOffset>1044</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B1213</name>
          <description>Masked Access (16m/16d), Byte Offsets 12 and 13</description>
          <addressOffset>1048</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B1415</name>
          <description>Masked Access (16m/16d), Byte Offsets 14 and 15</description>
          <addressOffset>1052</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B1617</name>
          <description>Masked Access (16m/16d), Byte Offsets 16 and 17</description>
          <addressOffset>1056</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B1819</name>
          <description>Masked Access (16m/16d), Byte Offsets 18 and 19</description>
          <addressOffset>1060</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B2021</name>
          <description>Masked Access (16m/16d), Byte Offsets 20 and 21</description>
          <addressOffset>1064</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B2223</name>
          <description>Masked Access (16m/16d), Byte Offsets 22 and 23</description>
          <addressOffset>1068</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B2425</name>
          <description>Masked Access (16m/16d), Byte Offsets 24 and 25</description>
          <addressOffset>1072</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B2627</name>
          <description>Masked Access (16m/16d), Byte Offsets 26 and 27</description>
          <addressOffset>1076</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B2829</name>
          <description>Masked Access (16m/16d), Byte Offsets 28 and 29</description>
          <addressOffset>1080</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B3031</name>
          <description>Masked Access (16m/16d), Byte Offsets 30 and 31</description>
          <addressOffset>1084</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B3233</name>
          <description>Masked Access (16m/16d), Byte Offsets 32 and 33</description>
          <addressOffset>1088</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B3435</name>
          <description>Masked Access (16m/16d), Byte Offsets 34 and 35</description>
          <addressOffset>1092</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B3637</name>
          <description>Masked Access (16m/16d), Byte Offsets 36 and 37</description>
          <addressOffset>1096</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B3839</name>
          <description>Masked Access (16m/16d), Byte Offsets 38 and 39</description>
          <addressOffset>1100</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B4041</name>
          <description>Masked Access (16m/16d), Byte Offsets 40 and 41</description>
          <addressOffset>1104</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B4243</name>
          <description>Masked Access (16m/16d), Byte Offsets 42 and 43</description>
          <addressOffset>1108</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
