tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>MASK16B4445</name>
          <description>Masked Access (16m/16d), Byte Offsets 44 and 45</description>
          <addressOffset>1112</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B4647</name>
          <description>Masked Access (16m/16d), Byte Offsets 46 and 47</description>
          <addressOffset>1116</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B4849</name>
          <description>Masked Access (16m/16d), Byte Offsets 48 and 49</description>
          <addressOffset>1120</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B5051</name>
          <description>Masked Access (16m/16d), Byte Offsets 50 and 51</description>
          <addressOffset>1124</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B5253</name>
          <description>Masked Access (16m/16d), Byte Offsets 52 and 53</description>
          <addressOffset>1128</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B5455</name>
          <description>Masked Access (16m/16d), Byte Offsets 54 and 55</description>
          <addressOffset>1132</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B5657</name>
          <description>Masked Access (16m/16d), Byte Offsets 56 and 57</description>
          <addressOffset>1136</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B5859</name>
          <description>Masked Access (16m/16d), Byte Offsets 58 and 59</description>
          <addressOffset>1140</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B6061</name>
          <description>Masked Access (16m/16d), Byte Offsets 60 and 61</description>
          <addressOffset>1144</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B6263</name>
          <description>Masked Access (16m/16d), Byte Offsets 62 and 63</description>
          <addressOffset>1148</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B6465</name>
          <description>Masked Access (16m/16d), Byte Offsets 64 and 65</description>
          <addressOffset>1152</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B6667</name>
          <description>Masked Access (16m/16d), Byte Offsets 66 and 67</description>
          <addressOffset>1156</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B6869</name>
          <description>Masked Access (16m/16d), Byte Offsets 68 and 69</description>
          <addressOffset>1160</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK16B7071</name>
          <description>Masked Access (16m/16d), Byte Offsets 70 and 71</description>
          <addressOffset>1164</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>M</name>
              <description>M</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>D</name>
              <description>D</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
