tyropyro/CC1312tester/cc1312/cpu-mmap.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_EVCTL</name>
      <description>AUX Event Controller (AUX_EVCTL) assembles events originating from:
           AUX submodules, including ADC and comparators.
           AUXIO.
           EVENT.
           AON_PMCTL.
           AON_RTC.
           AON_BATMON.

          nto two 64-bit event buses. One is synchronized to the AUX clock and one is left unsynchronized. 

          he subscribers to the synchronous event bus are AUX_TIMER01, AUX_SCE and AUX_EVCTL.
          he subscribers to the asynchronous event bus are AUX_TIMER2, AUX_ANAIF, AUX_TDC and AUX_SYSIF.

          UX_EVCTL uses the synchronous event bus to generate events to AON_EVENT and EVENT, as well as to AUX_SCE. AUX_SCE can poll event status registers and combine certain instructions like WEV0, WEV1 with one or two configurable events. The latter saves power when execution must stall until a condition is met.</description>
      <baseAddress>0x400c5000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EVSTAT0</name>
          <description>Event Status 0

          egister holds events 0 thru 15 of the 64-bit event bus that is synchronous to AUX clock. All events read through this register are synchronized at SCE clock rate, unless otherwise noted. The following subscribers use the asynchronous version of events in this register.
           AUX_TIMER2.
           AUX_ANAIF.
           AUX_TDC.
           AUX_SYSIF.
           AUX_AIODIOn.
           EVOBSCFG.</description>
          <addressOffset>0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AUXIO15</name>
              <description>AUXIO15</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>AUXIO14</name>
              <description>AUXIO14</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>AUXIO13</name>
              <description>AUXIO13</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>AUXIO12</name>
              <description>AUXIO12</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>AUXIO11</name>
              <description>AUXIO11</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>AUXIO10</name>
              <description>AUXIO10</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>AUXIO9</name>
              <description>AUXIO9</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AUXIO8</name>
              <description>AUXIO8</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>AUXIO7</name>
              <description>AUXIO7</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>AUXIO6</name>
              <description>AUXIO6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AUXIO5</name>
              <description>AUXIO5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AUXIO4</name>
              <description>AUXIO4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AUXIO3</name>
              <description>AUXIO3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AUXIO2</name>
              <description>AUXIO2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>AUXIO1</name>
              <description>AUXIO1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>AUXIO0</name>
              <description>AUXIO0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVSTAT1</name>
          <description>Event Status 1

          egister holds events 16 thru 31 of the 64-bit event bus that is synchronous to AUX clock. All events read through this register are synchronized at SCE clock rate, unless otherwise noted. The following subscribers use the asynchronous version of events in this register.
           AUX_TIMER2.
           AUX_ANAIF.
           AUX_TDC.
           AUX_SYSIF.
           AUX_AIODIOn.
           EVOBSCFG.</description>
          <addressOffset>4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AUXIO31</name>
              <description>AUXIO31</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>AUXIO30</name>
              <description>AUXIO30</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>AUXIO29</name>
              <description>AUXIO29</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>AUXIO28</name>
              <description>AUXIO28</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>AUXIO27</name>
              <description>AUXIO27</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>AUXIO26</name>
              <description>AUXIO26</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>AUXIO25</name>
              <description>AUXIO25</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AUXIO24</name>
              <description>AUXIO24</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>AUXIO23</name>
              <description>AUXIO23</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>AUXIO22</name>
              <description>AUXIO22</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AUXIO21</name>
              <description>AUXIO21</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AUXIO20</name>
              <description>AUXIO20</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AUXIO19</name>
              <description>AUXIO19</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AUXIO18</name>
              <description>AUXIO18</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>AUXIO17</name>
              <description>AUXIO17</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>AUXIO16</name>
              <description>AUXIO16</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVSTAT2</name>
          <description>Event Status 2

          egister holds events 32 thru 47 of the 64-bit event bus that is synchronous to AUX clock. All events read through this register are synchronized at SCE clock rate, unless otherwise noted. The following subscribers use the asynchronous version of events in this register.
           AUX_TIMER2.
           AUX_ANAIF.
           AUX_TDC.
           AUX_SYSIF.
           AUX_AIODIOn.
           EVOBSCFG.</description>
          <addressOffset>8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AUX_COMPB</name>
              <description>AUX_COMPB</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>AUX_COMPA</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>MCU_OBSMUX1</name>
              <description>MCU_OBSMUX1</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>MCU_OBSMUX0</name>
              <description>MCU_OBSMUX0</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>MCU_EV</name>
              <description>MCU_EV</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ACLK_REF</name>
              <description>ACLK_REF</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>VDDR_RECHARGE</name>
              <description>VDDR_RECHARGE</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>MCU_ACTIVE</name>
              <description>MCU_ACTIVE</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PWR_DWN</name>
              <description>PWR_DWN</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SCLK_LF</name>
              <description>SCLK_LF</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AON_BATMON_TEMP_UPD</name>
              <description>AON_BATMON_TEMP_UPD</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AON_BATMON_BAT_UPD</name>
              <description>AON_BATMON_BAT_UPD</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AON_RTC_4KHZ</name>
              <description>AON_RTC_4KHZ</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AON_RTC_CH2_DLY</name>
              <description>AON_RTC_CH2_DLY</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>AON_RTC_CH2</name>
              <description>AON_RTC_CH2</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MANUAL_EV</name>
              <description>MANUAL_EV</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVSTAT3</name>
          <description>Event Status 3

          egister holds events 48 thru 63 of the 64-bit event bus that is synchronous to AUX clock. All events read through this register are synchronized at SCE clock rate, unless otherwise noted. The following subscribers use the asynchronous version of events in this register.
           AUX_TIMER2.
           AUX_ANAIF.
           AUX_TDC .
           AUX_SYSIF.
           AUX_AIODIOn.
           EVOBSCFG.</description>
          <addressOffset>12</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AUX_TIMER2_CLKSWITCH_RDY</name>
              <description>AUX_TIMER2_CLKSWITCH_RDY</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>AUX_DAC_HOLD_ACTIVE</name>
              <description>AUX_DAC_HOLD_ACTIVE</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>AUX_SMPH_AUTOTAKE_DONE</name>
              <description>AUX_SMPH_AUTOTAKE_DONE</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>AUX_ADC_FIFO_NOT_EMPTY</name>
              <description>AUX_ADC_FIFO_NOT_EMPTY</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>AUX_ADC_FIFO_ALMOST_FULL</name>
              <description>AUX_ADC_FIFO_ALMOST_FULL</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>AUX_ADC_IRQ</name>
              <description>AUX_ADC_IRQ</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>AUX_ADC_DONE</name>
              <description>AUX_ADC_DONE</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AUX_ISRC_RESET_N</name>
              <description>AUX_ISRC_RESET_N</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>AUX_TDC_DONE</name>
              <description>AUX_TDC_DONE</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER0_EV</name>
              <description>AUX_TIMER0_EV</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER1_EV</name>
              <description>AUX_TIMER1_EV</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER2_PULSE</name>
              <description>AUX_TIMER2_PULSE</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER2_EV3</name>
              <description>AUX_TIMER2_EV3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER2_EV2</name>
              <description>AUX_TIMER2_EV2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER2_EV1</name>
              <description>AUX_TIMER2_EV1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER2_EV0</name>
              <description>AUX_TIMER2_EV0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCEWEVCFG0</name>
          <description>Sensor Controller Engine Wait Event Configuration 0

          onfiguration of this register and SCEWEVCFG1 controls bit index 7 in AUX_SCE:WUSTAT.EV_SIGNALS. This bit can be used by AUX_SCE WEV0, WEV1, BEV0 and BEV1 instructions. 

          hen COMB_EV_EN = 0:
          UX_SCE:WUSTAT.EV_SIGNALS (7) =  EV0_SEL event

          hen  COMB_EV_EN = 1:
          UX_SCE:WUSTAT.EV_SIGNALS (7) =  ( EV0_SEL event )  OR  ( SCEWEVCFG1.EV1_SEL event )

          it fields SCEWEVCFG1.EV0_POL and SCEWEVCFG1.EV1_POL control the polarity of selected events.

