tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          vent combination is useful when there is a need to wait for a certain condition with timeout.</description>
          <addressOffset>16</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COMB_EV_EN</name>
              <description>COMB_EV_EN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EV0_SEL</name>
              <description>EV0_SEL</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCEWEVCFG1</name>
          <description>Sensor Controller Engine Wait Event Configuration 1

          ee SCEWEVCFG0 for description.</description>
          <addressOffset>20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EV0_POL</name>
              <description>EV0_POL</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EV1_POL</name>
              <description>EV1_POL</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EV1_SEL</name>
              <description>EV1_SEL</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL</name>
          <description>Direct Memory Access Control</description>
          <addressOffset>24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REQ_MODE</name>
              <description>REQ_MODE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SEL</name>
              <description>SEL</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SWEVSET</name>
          <description>Software Event Set

          et software event flags from AUX domain to AON and MCU domains. CPUs in MCU domain can read the event flags from EVTOAONFLAGS and clear them in EVTOAONFLAGSCLR. 

          se of these event flags is software-defined.</description>
          <addressOffset>32</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SWEV2</name>
              <description>SWEV2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SWEV1</name>
              <description>SWEV1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SWEV0</name>
              <description>SWEV0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVTOAONFLAGS</name>
          <description>Events To AON Flags

          his register contains a collection of event flags routed to AON_EVENT. 

          o clear an event flag, write to EVTOAONFLAGSCLR or write 0 to event flag in this register.</description>
          <addressOffset>36</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AUX_TIMER1_EV</name>
              <description>AUX_TIMER1_EV</description>
              <bitRange>[8:8]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AUX_TIMER0_EV</name>
              <description>AUX_TIMER0_EV</description>
              <bitRange>[7:7]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AUX_TDC_DONE</name>
              <description>AUX_TDC_DONE</description>
              <bitRange>[6:6]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AUX_ADC_DONE</name>
              <description>AUX_ADC_DONE</description>
              <bitRange>[5:5]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AUX_COMPB</name>
              <description>AUX_COMPB</description>
              <bitRange>[4:4]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>AUX_COMPA</description>
              <bitRange>[3:3]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>SWEV2</name>
              <description>SWEV2</description>
              <bitRange>[2:2]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>SWEV1</name>
              <description>SWEV1</description>
              <bitRange>[1:1]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>SWEV0</name>
              <description>SWEV0</description>
              <bitRange>[0:0]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVTOAONPOL</name>
          <description>Events To AON Polarity

