tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          vent source polarity configuration for EVTOAONFLAGS.</description>
          <addressOffset>40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AUX_TIMER1_EV</name>
              <description>AUX_TIMER1_EV</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER0_EV</name>
              <description>AUX_TIMER0_EV</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>AUX_TDC_DONE</name>
              <description>AUX_TDC_DONE</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AUX_ADC_DONE</name>
              <description>AUX_ADC_DONE</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AUX_COMPB</name>
              <description>AUX_COMPB</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>AUX_COMPA</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVTOAONFLAGSCLR</name>
          <description>Events To AON Clear

          lear event flags in EVTOAONFLAGS. 

          n order to clear a level sensitive event flag, the event must be deasserted.</description>
          <addressOffset>44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AUX_TIMER1_EV</name>
              <description>AUX_TIMER1_EV</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER0_EV</name>
              <description>AUX_TIMER0_EV</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>AUX_TDC_DONE</name>
              <description>AUX_TDC_DONE</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AUX_ADC_DONE</name>
              <description>AUX_ADC_DONE</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AUX_COMPB</name>
              <description>AUX_COMPB</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>AUX_COMPA</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SWEV2</name>
              <description>SWEV2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SWEV1</name>
              <description>SWEV1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SWEV0</name>
              <description>SWEV0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVTOMCUFLAGS</name>
          <description>Events to MCU Flags

          his register contains a collection of event flags routed to MCU domain. 

          o clear an event flag, write to EVTOMCUFLAGSCLR or write 0 to event flag in this register. Follow procedure described in AUX_SYSIF:WUCLR to clear AUX_WU_EV event flag.</description>
          <addressOffset>48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AUX_TIMER2_PULSE</name>
              <description>AUX_TIMER2_PULSE</description>
              <bitRange>[15:15]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AUX_TIMER2_EV3</name>
              <description>AUX_TIMER2_EV3</description>
              <bitRange>[14:14]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AUX_TIMER2_EV2</name>
              <description>AUX_TIMER2_EV2</description>
              <bitRange>[13:13]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AUX_TIMER2_EV1</name>
              <description>AUX_TIMER2_EV1</description>
              <bitRange>[12:12]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AUX_TIMER2_EV0</name>
              <description>AUX_TIMER2_EV0</description>
              <bitRange>[11:11]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AUX_ADC_IRQ</name>
              <description>AUX_ADC_IRQ</description>
              <bitRange>[10:10]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>MCU_OBSMUX0</name>
              <description>MCU_OBSMUX0</description>
              <bitRange>[9:9]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AUX_ADC_FIFO_ALMOST_FULL</name>
              <description>AUX_ADC_FIFO_ALMOST_FULL</description>
              <bitRange>[8:8]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AUX_ADC_DONE</name>
              <description>AUX_ADC_DONE</description>
              <bitRange>[7:7]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AUX_SMPH_AUTOTAKE_DONE</name>
              <description>AUX_SMPH_AUTOTAKE_DONE</description>
              <bitRange>[6:6]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AUX_TIMER1_EV</name>
              <description>AUX_TIMER1_EV</description>
              <bitRange>[5:5]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AUX_TIMER0_EV</name>
              <description>AUX_TIMER0_EV</description>
              <bitRange>[4:4]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AUX_TDC_DONE</name>
              <description>AUX_TDC_DONE</description>
              <bitRange>[3:3]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AUX_COMPB</name>
              <description>AUX_COMPB</description>
              <bitRange>[2:2]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>AUX_COMPA</description>
              <bitRange>[1:1]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
            <field>
              <name>AUX_WU_EV</name>
              <description>AUX_WU_EV</description>
              <bitRange>[0:0]</bitRange>
              <modifiedWriteValues>zeroToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVTOMCUPOL</name>
          <description>Event To MCU Polarity

