tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          vent source polarity configuration for EVTOMCUFLAGS.</description>
          <addressOffset>52</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AUX_TIMER2_PULSE</name>
              <description>AUX_TIMER2_PULSE</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER2_EV3</name>
              <description>AUX_TIMER2_EV3</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER2_EV2</name>
              <description>AUX_TIMER2_EV2</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER2_EV1</name>
              <description>AUX_TIMER2_EV1</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER2_EV0</name>
              <description>AUX_TIMER2_EV0</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>AUX_ADC_IRQ</name>
              <description>AUX_ADC_IRQ</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>MCU_OBSMUX0</name>
              <description>MCU_OBSMUX0</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AUX_ADC_FIFO_ALMOST_FULL</name>
              <description>AUX_ADC_FIFO_ALMOST_FULL</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>AUX_ADC_DONE</name>
              <description>AUX_ADC_DONE</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>AUX_SMPH_AUTOTAKE_DONE</name>
              <description>AUX_SMPH_AUTOTAKE_DONE</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER1_EV</name>
              <description>AUX_TIMER1_EV</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER0_EV</name>
              <description>AUX_TIMER0_EV</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AUX_TDC_DONE</name>
              <description>AUX_TDC_DONE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AUX_COMPB</name>
              <description>AUX_COMPB</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>AUX_COMPA</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>AUX_WU_EV</name>
              <description>AUX_WU_EV</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVTOMCUFLAGSCLR</name>
          <description>Events To MCU Flags Clear

          lear event flags in EVTOMCUFLAGS. 

          n order to clear a level sensitive event flag, the event must be deasserted.</description>
          <addressOffset>56</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AUX_TIMER2_PULSE</name>
              <description>AUX_TIMER2_PULSE</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER2_EV3</name>
              <description>AUX_TIMER2_EV3</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER2_EV2</name>
              <description>AUX_TIMER2_EV2</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER2_EV1</name>
              <description>AUX_TIMER2_EV1</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER2_EV0</name>
              <description>AUX_TIMER2_EV0</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>AUX_ADC_IRQ</name>
              <description>AUX_ADC_IRQ</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>MCU_OBSMUX0</name>
              <description>MCU_OBSMUX0</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AUX_ADC_FIFO_ALMOST_FULL</name>
              <description>AUX_ADC_FIFO_ALMOST_FULL</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>AUX_ADC_DONE</name>
              <description>AUX_ADC_DONE</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>AUX_SMPH_AUTOTAKE_DONE</name>
              <description>AUX_SMPH_AUTOTAKE_DONE</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER1_EV</name>
              <description>AUX_TIMER1_EV</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER0_EV</name>
              <description>AUX_TIMER0_EV</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AUX_TDC_DONE</name>
              <description>AUX_TDC_DONE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AUX_COMPB</name>
              <description>AUX_COMPB</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>AUX_COMPA</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>AUX_WU_EV</name>
              <description>AUX_WU_EV</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>COMBEVTOMCUMASK</name>
          <description>Combined Event To MCU Mask

          elect event flags in EVTOMCUFLAGS that contribute to the AUX_COMB event to EVENT and system CPU.

          he AUX_COMB event is high as long as one or more of the included event flags are set.</description>
          <addressOffset>60</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AUX_TIMER2_PULSE</name>
              <description>AUX_TIMER2_PULSE</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER2_EV3</name>
              <description>AUX_TIMER2_EV3</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER2_EV2</name>
              <description>AUX_TIMER2_EV2</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER2_EV1</name>
              <description>AUX_TIMER2_EV1</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER2_EV0</name>
              <description>AUX_TIMER2_EV0</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>AUX_ADC_IRQ</name>
              <description>AUX_ADC_IRQ</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>MCU_OBSMUX0</name>
              <description>MCU_OBSMUX0</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AUX_ADC_FIFO_ALMOST_FULL</name>
              <description>AUX_ADC_FIFO_ALMOST_FULL</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>AUX_ADC_DONE</name>
              <description>AUX_ADC_DONE</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>AUX_SMPH_AUTOTAKE_DONE</name>
              <description>AUX_SMPH_AUTOTAKE_DONE</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER1_EV</name>
              <description>AUX_TIMER1_EV</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER0_EV</name>
              <description>AUX_TIMER0_EV</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>AUX_TDC_DONE</name>
              <description>AUX_TDC_DONE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AUX_COMPB</name>
              <description>AUX_COMPB</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>AUX_COMPA</name>
              <description>AUX_COMPA</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>AUX_WU_EV</name>
              <description>AUX_WU_EV</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVOBSCFG</name>
          <description>Event Observation Configuration</description>
          <addressOffset>64</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EVOBS_SEL</name>
              <description>EVOBS_SEL</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PROGDLY</name>
          <description>Programmable Delay</description>
          <addressOffset>68</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MANUAL</name>
          <description>Manual

          rogrammable event.</description>
          <addressOffset>72</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVSTAT0L</name>
          <description>Event Status 0 Low</description>
          <addressOffset>76</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALIAS_EV</name>
              <description>ALIAS_EV</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVSTAT0H</name>
          <description>Event Status 0 High</description>
          <addressOffset>80</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALIAS_EV</name>
              <description>ALIAS_EV</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVSTAT1L</name>
          <description>Event Status 1 Low</description>
          <addressOffset>84</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALIAS_EV</name>
              <description>ALIAS_EV</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVSTAT1H</name>
          <description>Event Status 1 High</description>
          <addressOffset>88</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALIAS_EV</name>
              <description>ALIAS_EV</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVSTAT2L</name>
          <description>Event Status 2 Low</description>
          <addressOffset>92</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALIAS_EV</name>
              <description>ALIAS_EV</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVSTAT2H</name>
          <description>Event Status 2 High</description>
          <addressOffset>96</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALIAS_EV</name>
              <description>ALIAS_EV</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVSTAT3L</name>
          <description>Event Status 3 Low</description>
          <addressOffset>100</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALIAS_EV</name>
              <description>ALIAS_EV</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVSTAT3H</name>
          <description>Event Status 3 High</description>
          <addressOffset>104</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALIAS_EV</name>
              <description>ALIAS_EV</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
