tyropyro/CC1312tester/cc1312/cpu-mmap.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_MAC</name>
      <description>The AUX Multiply-Accumulate (AUX_MAC) peripheral enables AUX_SCE with power-efficient and flexible mathematical operations:
           2's complement signed and unsigned sequential multiplication (MUL) with optional accumulation of the result (MAC).
           16 or 32-bit 2's complement signed and unsigned addition of configurable term and accumulator (ADD).
           Results of ADD, MUL and MAC operations are always stored in the accumulator (ACC).

          oftware can easily:
           Access arbitrary 16-bit slice of the 40-bit accumulator.
           Find the number of leading zero or sign bits. 
           Perform shift operations on the accumulator.

          UX_SCE must set AUX_SYSIF:PEROPRATE.MAC_OP_RATE to SCE_RATE to access and use AUX_MAC. System CPU must set AUX_SYSIF:PEROPRATE.MAC_OP_RATE to BUS_RATE to access and use AUX_MAC. This guarantees constant execution times for ADD, MUL, and MAC operations.

          he ADD operation requires a single peripheral clock cycle to finish. MUL and MAC operations require four peripheral clock periods to finish. An unfinished ADD, MUL, or MAC operation stalls register access to this peripheral. AUX_SCE becomes clock gated if it encounters a bus stall. Software can use this to reduce power consumption during back to back accesses.

          nly full word access is supported by the peripheral. An attempt to write a single byte will have no effect.</description>
      <baseAddress>0x400c2000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OP0S</name>
          <description>Signed Operand 0</description>
          <addressOffset>0</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OP0_VALUE</name>
              <description>OP0_VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OP0U</name>
          <description>Unsigned Operand 0</description>
          <addressOffset>4</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OP0_VALUE</name>
              <description>OP0_VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OP1SMUL</name>
          <description>Signed Operand 1 and Multiply</description>
          <addressOffset>8</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OP1_VALUE</name>
              <description>OP1_VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OP1UMUL</name>
          <description>Unsigned Operand 1 and Multiply</description>
          <addressOffset>12</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OP1_VALUE</name>
              <description>OP1_VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OP1SMAC</name>
          <description>Signed Operand 1 and Multiply-Accumulate</description>
          <addressOffset>16</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OP1_VALUE</name>
              <description>OP1_VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OP1UMAC</name>
          <description>Unsigned Operand 1 and Multiply-Accumulate</description>
          <addressOffset>20</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OP1_VALUE</name>
              <description>OP1_VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OP1SADD16</name>
          <description>Signed Operand 1 and 16-bit Addition</description>
          <addressOffset>24</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OP1_VALUE</name>
              <description>OP1_VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OP1UADD16</name>
          <description>Unsigned Operand 1 and 16-bit Addition</description>
          <addressOffset>28</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OP1_VALUE</name>
              <description>OP1_VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OP1SADD32</name>
          <description>Signed Operand 1 and 32-bit Addition</description>
          <addressOffset>32</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OP1_VALUE</name>
              <description>OP1_VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OP1UADD32</name>
          <description>Unsigned Operand 1 and 32-bit Addition</description>
          <addressOffset>36</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OP1_VALUE</name>
              <description>OP1_VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLZ</name>
          <description>Count Leading Zero</description>
          <addressOffset>40</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000028</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLS</name>
          <description>Count Leading Sign</description>
          <addressOffset>44</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000028</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCSHIFT</name>
          <description>Accumulator Shift 

          nly one shift operation can be triggered per register write.</description>
          <addressOffset>48</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LSL1</name>
              <description>LSL1</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LSR1</name>
              <description>LSR1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ASR1</name>
              <description>ASR1</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCRESET</name>
          <description>Accumulator Reset</description>
          <addressOffset>52</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRG</name>
              <description>TRG</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC15_0</name>
          <description>Accumulator Bits 15:0</description>
          <addressOffset>56</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC16_1</name>
          <description>Accumulator Bits 16:1</description>
          <addressOffset>60</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC17_2</name>
          <description>Accumulator Bits 17:2</description>
          <addressOffset>64</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC18_3</name>
          <description>Accumulator Bits 18:3</description>
          <addressOffset>68</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC19_4</name>
          <description>Accumulator Bits 19:4</description>
          <addressOffset>72</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC20_5</name>
          <description>Accumulator Bits 20:5</description>
          <addressOffset>76</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC21_6</name>
          <description>Accumulator Bits 21:6</description>
          <addressOffset>80</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC22_7</name>
          <description>Accumulator Bits 22:7</description>
          <addressOffset>84</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC23_8</name>
          <description>Accumulator Bits 23:8</description>
          <addressOffset>88</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC24_9</name>
          <description>Accumulator Bits 24:9</description>
          <addressOffset>92</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC25_10</name>
          <description>Accumulator Bits 25:10</description>
          <addressOffset>96</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC26_11</name>
          <description>Accumulator Bits 26:11</description>
          <addressOffset>100</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC27_12</name>
          <description>Accumulator Bits 27:12</description>
          <addressOffset>104</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC28_13</name>
          <description>Accumulator Bits 28:13</description>
          <addressOffset>108</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC29_14</name>
          <description>Accumulator Bits 29:14</description>
          <addressOffset>112</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC30_15</name>
          <description>Accumulator Bits 30:15</description>
          <addressOffset>116</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC31_16</name>
          <description>Accumulator Bits 31:16</description>
          <addressOffset>120</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC32_17</name>
          <description>Accumulator Bits 32:17</description>
          <addressOffset>124</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC33_18</name>
          <description>Accumulator Bits 33:18</description>
          <addressOffset>128</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC34_19</name>
          <description>Accumulator Bits 34:19</description>
          <addressOffset>132</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC35_20</name>
          <description>Accumulator Bits 35:20</description>
          <addressOffset>136</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC36_21</name>
          <description>Accumulator Bits 36:21</description>
          <addressOffset>140</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC37_22</name>
          <description>Accumulator Bits 37:22</description>
          <addressOffset>144</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC38_23</name>
          <description>Accumulator Bits 38:23</description>
          <addressOffset>148</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC39_24</name>
          <description>Accumulator Bits 39:24</description>
          <addressOffset>152</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC39_32</name>
          <description>Accumulator Bits 39:32</description>
          <addressOffset>156</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
