tyropyro/CC1312tester/cc1312/cpu-mmap.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_SCE</name>
      <description>AUX Sensor Control Engine (AUX_SCE) is a RISC-style microprocessor with separate fetch and execution cycles. It is optimized for low power and simple operations.  AUX_SCE code and data segments are stored in AUX_RAM. AON_PMCTL:AUXSCECLK sets the operational frequency.</description>
      <baseAddress>0x400e1000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTL</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FORCE_EV_LOW</name>
              <description>FORCE_EV_LOW</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>FORCE_EV_HIGH</name>
              <description>FORCE_EV_HIGH</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>RESET_VECTOR</name>
              <description>RESET_VECTOR</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>DBG_FREEZE_EN</name>
              <description>DBG_FREEZE_EN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>FORCE_WU_LOW</name>
              <description>FORCE_WU_LOW</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>FORCE_WU_HIGH</name>
              <description>FORCE_WU_HIGH</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RESTART</name>
              <description>RESTART</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SINGLE_STEP</name>
              <description>SINGLE_STEP</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SUSPEND</name>
              <description>SUSPEND</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>CLK_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FETCHSTAT</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OPCODE</name>
              <description>OPCODE</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>PC</name>
              <description>PC</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUSTAT</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BUS_ERROR</name>
              <description>BUS_ERROR</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SLEEP</name>
              <description>SLEEP</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>WEV</name>
              <description>WEV</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>HALTED</name>
              <description>HALTED</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>V_FLAG</name>
              <description>V_FLAG</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>C_FLAG</name>
              <description>C_FLAG</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>N_FLAG</name>
              <description>N_FLAG</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>Z_FLAG</name>
              <description>Z_FLAG</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WUSTAT</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>12</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXC_VECTOR</name>
              <description>EXC_VECTOR</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>WU_SIGNAL</name>
              <description>WU_SIGNAL</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EV_SIGNALS</name>
              <description>EV_SIGNALS</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REG1_0</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>16</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REG1</name>
              <description>REG1</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>REG0</name>
              <description>REG0</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REG3_2</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>20</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REG3</name>
              <description>REG3</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>REG2</name>
              <description>REG2</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REG5_4</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>24</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REG5</name>
              <description>REG5</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>REG4</name>
              <description>REG4</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REG7_6</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>28</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REG7</name>
              <description>REG7</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>REG6</name>
              <description>REG6</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LOOPADDR</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>32</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STOP</name>
              <description>STOP</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>START</name>
              <description>START</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LOOPCNT</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>36</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ITER_LEFT</name>
              <description>ITER_LEFT</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
