tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          rite operation stalls until current transfer completes.</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIV</name>
              <description>DIV</description>
              <bitRange>[7:2]</bitRange>
            </field>
            <field>
              <name>PHA</name>
              <description>PHA</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>POL</name>
              <description>POL</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MISOCFG</name>
          <description>MISO Configuration

          rite operation stalls until current transfer completes.</description>
          <addressOffset>4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AUXIO</name>
              <description>AUXIO</description>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MOSICTL</name>
          <description>MOSI Control

          rite operation stalls until current transfer completes.</description>
          <addressOffset>8</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TX8</name>
          <description>Transmit 8 Bit

          rite operation stalls until current transfer completes.</description>
          <addressOffset>12</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>DATA</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TX16</name>
          <description>Transmit 16 Bit

          rite operation stalls until current transfer completes.</description>
          <addressOffset>16</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>DATA</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RX8</name>
          <description>Receive 8 Bit

          ead operation stalls until current transfer completes.</description>
          <addressOffset>20</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>DATA</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RX16</name>
          <description>Receive 16 Bit

          ead operation stalls until current transfer completes.</description>
          <addressOffset>24</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>DATA</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCLKIDLE</name>
          <description>SCLK Idle

          ead operation stalls until SCLK is idle with no remaining clock edges.</description>
          <addressOffset>28</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAIDLE</name>
          <description>Data Idle

          ead operation stalls until current transfer completes.</description>
          <addressOffset>32</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_SYSIF</name>
      <description>AUX System Interface (AUX_SYSIF) is responsible for:
           system resource requests, such as power supply, clock and, wakeup requests.
           configuration of AUX peripheral operational rates for AUX_SPIM, AUX_MAC, AUX_ANAIF DAC state machine and AUX_TIMER01. 
           configuration of event synchronization rate for AUX_EVCTL:EVSTAT2 and AUX_EVCTL:EVSTAT3.
           configuration of AUX_SCE wakeup vectors that trigger AUX_SCE execution from sleep.

          eripheral operational rate for AUX modules mentioned above can either be:
           SCE rate, which is configured in AON_PMCTL:AUXSCECLK.
           AUX bus rate, which equals SCE rate or SCLK_HF divided by two when MCU domain is active or AUX operational mode is active.

          UX_SYSIF also interfaces AON_RTC and AON_BATMON to enable read access to data and sub-second increment control of AON_RTC.</description>
      <baseAddress>0x400c6000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OPMODEREQ</name>
          <description>Operational Mode Request

          UX can operate in three operational modes. Each mode is associated with:
           a SCE clock source or rate, given by AON_PMCTL:AUXSCECLK. This rate is termed SCE_RATE. 
           a system power supply state request. AUX can request powerdown (uLDO) or active (GLDO or DCDC) system power supply state.
           a specific system response to an active AUX wakeup flag. The response is dependent on what operational mode is requested. 

          LDO power supply state offers limited current supply. AUX_SCE cannot use certain peripherals and functions such as AUX_DDI0_OSC, AUX_TDC and AUX_ANAIF ADC interface in this power supply state. 

