tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          ollow these rules:
           It is not allowed to change a request until it has been acknowledged through OPMODEACK.
           A change in mode request must happen stepwise along this sequence, the direction is irrelevant:
   PDA - A - LP - PDLP.

          ailure to follow these rules might result in unexpected behavior and must be avoided.</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REQ</name>
              <description>REQ</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OPMODEACK</name>
          <description>Operational Mode Acknowledgement

          UX_SCE program must assume that the current operational mode is the one acknowledged.</description>
          <addressOffset>4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACK</name>
              <description>ACK</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PROGWU0CFG</name>
          <description>Programmable Wakeup 0 Configuration

          onfigure this register to enable a customized AUX wakeup flag. The wakeup flag will be captured by AON_PMCTL which responds according to the current operational mode. You can select WUFLAGS.PROG_WU0 to trigger execution of a programmable AUX_SCE vector by configuration of VECCFGn. You need to follow  the procedure described in WUFLAGSCLR to clear this flag. You need to follow the procedure described in WUGATE to configure it.</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>POL</name>
              <description>POL</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>WU_SRC</name>
              <description>WU_SRC</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PROGWU1CFG</name>
          <description>Programmable Wakeup 1 Configuration

          onfigure this register to enable a customized AUX wakeup flag. The wakeup flag will be captured by AON_PMCTL which responds according to the current operational mode. You can select WUFLAGS.PROG_WU1 to trigger execution of a programmable AUX_SCE vector by configuration of VECCFGn. You need to follow  the procedure described in WUFLAGSCLR to clear this flag. You need to follow the procedure described in WUGATE to configure it.</description>
          <addressOffset>12</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>POL</name>
              <description>POL</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>WU_SRC</name>
              <description>WU_SRC</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PROGWU2CFG</name>
          <description>Programmable Wakeup 2 Configuration

          onfigure this register to enable a customized AUX wakeup flag. The wakeup flag will be captured by AON_PMCTL which responds according to the current operational mode. You can select WUFLAGS.PROG_WU2 to trigger execution of a programmable AUX_SCE vector by configuration of VECCFGn. You need to follow  the procedure described in WUFLAGSCLR to clear this flag. You need to follow the procedure described in WUGATE to configure it.</description>
          <addressOffset>16</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>POL</name>
              <description>POL</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>WU_SRC</name>
              <description>WU_SRC</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PROGWU3CFG</name>
          <description>Programmable Wakeup 3 Configuration

          onfigure this register to enable a customized AUX wakeup flag. The wakeup flag will be captured by AON_PMCTL which responds according to the current operational mode. You can select WUFLAGS.PROG_WU3 to trigger execution of a programmable AUX_SCE vector by configuration of VECCFGn. You need to follow  the procedure described in WUFLAGSCLR to clear this flag. You need to follow the procedure described in WUGATE to configure it.</description>
          <addressOffset>20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>POL</name>
              <description>POL</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>WU_SRC</name>
              <description>WU_SRC</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SWWUTRIG</name>
          <description>Software Wakeup Triggers 

          ystem CPU uses these wakeup flags to perform handshaking with AUX_SCE. The wakeup flags can change the operational mode of AUX and guarantees a non-zero SCE clock rate. AUX_SCE wakeup vectors are configured in VECCFGn.</description>
          <addressOffset>24</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SW_WU3</name>
              <description>SW_WU3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SW_WU2</name>
              <description>SW_WU2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SW_WU1</name>
              <description>SW_WU1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SW_WU0</name>
              <description>SW_WU0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WUFLAGS</name>
          <description>Wakeup Flags

