tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          his register holds the eight AUX wakeup flags. Each flag can cause AUX operational mode to change as given in OPMODEREQ. To clear flag n you must set bit n in WUFLAGSCLR until flag n is read as 0. You must clear bit n in WUFLAGSCLR before flag n can be set again.</description>
          <addressOffset>28</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SW_WU3</name>
              <description>SW_WU3</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SW_WU2</name>
              <description>SW_WU2</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SW_WU1</name>
              <description>SW_WU1</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SW_WU0</name>
              <description>SW_WU0</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PROG_WU3</name>
              <description>PROG_WU3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PROG_WU2</name>
              <description>PROG_WU2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PROG_WU1</name>
              <description>PROG_WU1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PROG_WU0</name>
              <description>PROG_WU0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WUFLAGSCLR</name>
          <description>Wakeup Flags Clear

          his register clears AUX wakeup flags WUFLAGS. 

          o clear programmable wakeup flags you must disable the AUX wakeup output first. After the programmable wakeup flags are cleared you must re-enable the AUX wakeup output. Write WUGATE to disable or enable the AUX wakeup output. This procedure is not required when you want to clear a software-triggered wakeup.</description>
          <addressOffset>32</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000f</resetValue>
          <fields>
            <field>
              <name>SW_WU3</name>
              <description>SW_WU3</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SW_WU2</name>
              <description>SW_WU2</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SW_WU1</name>
              <description>SW_WU1</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SW_WU0</name>
              <description>SW_WU0</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PROG_WU3</name>
              <description>PROG_WU3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PROG_WU2</name>
              <description>PROG_WU2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PROG_WU1</name>
              <description>PROG_WU1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PROG_WU0</name>
              <description>PROG_WU0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WUGATE</name>
          <description>Wakeup Gate

          ou must disable the AUX wakeup output:
           Before you clear a programmable wakeup flag.
           Before you change the value of [PROGWUnCFG.EN] or [PROGWUnCFG.WU_SRC].

          he AUX wakeup output must be re-enabled after clear operation or programmable wakeup configuration.</description>
          <addressOffset>36</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VECCFG0</name>
          <description>Vector Configuration 0

          UX_SCE wakeup vector 0 configuration</description>
          <addressOffset>40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VEC_EV</name>
              <description>VEC_EV</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VECCFG1</name>
          <description>Vector Configuration 1

          UX_SCE wakeup vector 1 configuration</description>
          <addressOffset>44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VEC_EV</name>
              <description>VEC_EV</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VECCFG2</name>
          <description>Vector Configuration 2

          UX_SCE wakeup vector 2 configuration</description>
          <addressOffset>48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VEC_EV</name>
              <description>VEC_EV</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VECCFG3</name>
          <description>Vector Configuration 3

          UX_SCE wakeup vector 3 configuration</description>
          <addressOffset>52</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VEC_EV</name>
              <description>VEC_EV</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VECCFG4</name>
          <description>Vector Configuration 4

