tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          UX_SCE wakeup vector 4 configuration</description>
          <addressOffset>56</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VEC_EV</name>
              <description>VEC_EV</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VECCFG5</name>
          <description>Vector Configuration 5

          UX_SCE wakeup vector 5 configuration</description>
          <addressOffset>60</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VEC_EV</name>
              <description>VEC_EV</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VECCFG6</name>
          <description>Vector Configuration 6

          UX_SCE wakeup vector 6 configuration</description>
          <addressOffset>64</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VEC_EV</name>
              <description>VEC_EV</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VECCFG7</name>
          <description>Vector Configuration 7

          UX_SCE wakeup vector 7 configuration</description>
          <addressOffset>68</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VEC_EV</name>
              <description>VEC_EV</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVSYNCRATE</name>
          <description>Event Synchronization Rate 

          onfigure synchronization rate for certain events to the synchronous AUX event bus.

          ou must select SCE rate when AUX_SCE uses the event. You must select AUX bus rate when system CPU uses the event.

          CE rate equals rate configured in AON_PMCTL:AUXSCECLK. AUX bus rate equals SCE rate, or SCLK_HF divided by two when MCU domain is active.</description>
          <addressOffset>72</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AUX_COMPA_SYNC_RATE</name>
              <description>AUX_COMPA_SYNC_RATE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>AUX_COMPB_SYNC_RATE</name>
              <description>AUX_COMPB_SYNC_RATE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER2_SYNC_RATE</name>
              <description>AUX_TIMER2_SYNC_RATE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEROPRATE</name>
          <description>Peripheral Operational Rate 

          ome AUX peripherals are operated at either SCE or at AUX bus rate. 

          ou must select SCE rate when AUX_SCE uses such peripheral or an event produced by it. You must select AUX bus rate when system CPU uses such peripheral.

          CE rate equals rate configured in AON_PMCTL:AUXSCECLK. AUX bus rate equals SCE rate, or SCLK_HF divided by 2 when MCU domain is active.</description>
          <addressOffset>76</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ANAIF_DAC_OP_RATE</name>
              <description>ANAIF_DAC_OP_RATE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TIMER01_OP_RATE</name>
              <description>TIMER01_OP_RATE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SPIM_OP_RATE</name>
              <description>SPIM_OP_RATE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MAC_OP_RATE</name>
              <description>MAC_OP_RATE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCLKCTL</name>
          <description>ADC Clock Control</description>
          <addressOffset>80</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACK</name>
              <description>ACK</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>REQ</name>
              <description>REQ</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TDCCLKCTL</name>
          <description>TDC Counter Clock Control

          ontrols if the AUX_TDC counter clock source is enabled. TDC counter clock source is configured in DDI_0_OSC:CTL0.ACLK_TDC_SRC_SEL.</description>
          <addressOffset>84</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACK</name>
              <description>ACK</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>REQ</name>
              <description>REQ</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TDCREFCLKCTL</name>
          <description>TDC Reference Clock Control

