tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          ontrols if the AUX_TDC reference clock source is enabled. This clock is compared against the AUX_TDC counter clock. TDC reference clock source is configured in DDI_0_OSC:CTL0.ACLK_REF_SRC_SEL.</description>
          <addressOffset>88</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACK</name>
              <description>ACK</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>REQ</name>
              <description>REQ</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER2CLKCTL</name>
          <description>AUX_TIMER2 Clock Control

          ccess to AUX_TIMER2 is only possible when TIMER2CLKSTAT.STAT is different from NONE.</description>
          <addressOffset>92</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SRC</name>
              <description>SRC</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER2CLKSTAT</name>
          <description>AUX_TIMER2 Clock Status</description>
          <addressOffset>96</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER2CLKSWITCH</name>
          <description>AUX_TIMER2 Clock Switch</description>
          <addressOffset>100</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>RDY</name>
              <description>RDY</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER2DBGCTL</name>
          <description>AUX_TIMER2 Debug Control</description>
          <addressOffset>104</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DBG_FREEZE_EN</name>
              <description>DBG_FREEZE_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKSHIFTDET</name>
          <description>Clock Shift Detection

           transition in the MCU domain state causes a non-accumulative change to the SCE clock period when the AUX clock rate is derived from SCLK_MF or SCLK_LF:
           A single SCE clock cycle is 6 thru 8 SCLK_HF cycles longer when MCU domain enters active state.
           A single SCE clock cycle is 6 thru 8 SCLK_HF cycles shorter when MCU domain exits active state.
 
          UX_SCE detects if such events occurred to the SCE clock during the time period between a clear of STAT and a read of STAT.</description>
          <addressOffset>112</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RECHARGETRIG</name>
          <description>VDDR Recharge Trigger</description>
          <addressOffset>116</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RECHARGEDET</name>
          <description>VDDR Recharge Detection

          ome applications can be sensitive to power noise caused by recharge of VDDR. You can detect if VDDR recharge occurs.</description>
          <addressOffset>120</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCSUBSECINC0</name>
          <description>Real Time Counter Sub Second Increment 0

          NC15_0 will replace bits 15:0 in AON_RTC:SUBSECINC when RTCSUBSECINCCTL.UPD_REQ is set.</description>
          <addressOffset>124</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INC15_0</name>
              <description>INC15_0</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCSUBSECINC1</name>
          <description>Real Time Counter Sub Second Increment 1

          NC23_16 will replace bits 23:16 in AON_RTC:SUBSECINC when RTCSUBSECINCCTL.UPD_REQ is set.</description>
          <addressOffset>128</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INC23_16</name>
              <description>INC23_16</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCSUBSECINCCTL</name>
          <description>Real Time Counter Sub Second Increment Control</description>
          <addressOffset>132</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UPD_ACK</name>
              <description>UPD_ACK</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UPD_REQ</name>
              <description>UPD_REQ</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCSEC</name>
          <description>Real Time Counter Second 

          ystem CPU must not access this register. Instead, system CPU must access AON_RTC:SEC.VALUE directly.</description>
          <addressOffset>136</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEC</name>
              <description>SEC</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCSUBSEC</name>
          <description>Real Time Counter Sub-Second 

          ystem CPU must not access this register. Instead, system CPU must access AON_RTC:SUBSEC.VALUE directly.</description>
          <addressOffset>140</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SUBSEC</name>
              <description>SUBSEC</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCEVCLR</name>
          <description>AON_RTC Event Clear

          equest to clear events:
           AON_RTC:EVFLAGS.CH2.
           AON_RTC:EVFLAGS.CH2 delayed version.
           AUX_EVCTL:EVSTAT2.AON_RTC_CH2.
           AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY.</description>
          <addressOffset>144</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RTC_CH2_EV_CLR</name>
              <description>RTC_CH2_EV_CLR</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BATMONBAT</name>
          <description>AON_BATMON Battery Voltage Value

