tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          ead access to AON_BATMON:BAT. System CPU must not access this register. Instead, system CPU must access AON_BATMON:BAT directly. AON_BATMON:BAT updates during VDDR recharge or active operational mode.</description>
          <addressOffset>148</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INT</name>
              <description>INT</description>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>FRAC</name>
              <description>FRAC</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BATMONTEMP</name>
          <description>AON_BATMON Temperature Value

          ead access to AON_BATMON:TEMP. System CPU must not access this register. Instead, system CPU must access AON_BATMON:TEMP directly. AON_BATMON:TEMP updates during VDDR recharge or active operational mode.</description>
          <addressOffset>156</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGN</name>
              <description>SIGN</description>
              <bitRange>[15:11]</bitRange>
            </field>
            <field>
              <name>INT</name>
              <description>INT</description>
              <bitRange>[10:2]</bitRange>
            </field>
            <field>
              <name>FRAC</name>
              <description>FRAC</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMERHALT</name>
          <description>Timer Halt

          ebug register</description>
          <addressOffset>160</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PROGDLY</name>
              <description>PROGDLY</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER2</name>
              <description>AUX_TIMER2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER1</name>
              <description>AUX_TIMER1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>AUX_TIMER0</name>
              <description>AUX_TIMER0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER2BRIDGE</name>
          <description>AUX_TIMER2 Bridge</description>
          <addressOffset>176</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BUSY</name>
              <description>BUSY</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SWPWRPROF</name>
          <description>Software Power Profiler</description>
          <addressOffset>180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_TDC</name>
      <description>AUX Time To Digital Converter (AUX_TDC) is used to measure the time between two events with high resolution. 

          UX_TDC consists of a state machine that operates at AUX bus rate and an asynchronous fast-counter which is clocked by the TDC clock. DDI_0_OSC:CTL0.ACLK_TDC_SRC_SEL configures TDC clock source. The fast-counter counts on both edges of the TDC clock to double the resolution.

          ee the Technical Reference Manual for event timing requirements.</description>
      <baseAddress>0x400c4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTL</name>
          <description>Control</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMD</name>
              <description>CMD</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>Status</description>
          <addressOffset>4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>SAT</name>
              <description>SAT</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>DONE</name>
              <description>DONE</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>STATE</name>
              <description>STATE</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT</name>
          <description>Result

          esult of last TDC conversion.</description>
          <addressOffset>8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[24:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SATCFG</name>
          <description>Saturation Configuration</description>
          <addressOffset>12</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000f</resetValue>
          <fields>
            <field>
              <name>LIMIT</name>
              <description>LIMIT</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIGSRC</name>
          <description>Trigger Source

          elect source and polarity for TDC start and stop events. See the Technical Reference Manual for event timing requirements.</description>
          <addressOffset>16</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STOP_POL</name>
              <description>STOP_POL</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>STOP_SRC</name>
              <description>STOP_SRC</description>
              <bitRange>[13:8]</bitRange>
            </field>
            <field>
              <name>START_POL</name>
              <description>START_POL</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>START_SRC</name>
              <description>START_SRC</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIGCNT</name>
          <description>Trigger Counter

          top-counter control and status.</description>
          <addressOffset>20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIGCNTLOAD</name>
          <description>Trigger Counter Load

