tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          top-counter load.</description>
          <addressOffset>24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIGCNTCFG</name>
          <description>Trigger Counter Configuration

          top-counter configuration.</description>
          <addressOffset>28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRECTL</name>
          <description>Prescaler Control

          he prescaler can be used to count events that are faster than the AUX bus rate. 
          t can be used to:
           count pulses on a specified event from the asynchronous event bus.
           prescale a specified event from the asynchronous event bus. 

          o use the prescaler output as an event source in TDC measurements you must set both TRIGSRC.START_SRC and TRIGSRC.STOP_SRC to AUX_TDC_PRE.

          t is recommended to use the prescaler when the signal frequency to measure exceeds 1/10th of the AUX bus rate.</description>
          <addressOffset>32</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000003f</resetValue>
          <fields>
            <field>
              <name>RESET_N</name>
              <description>RESET_N</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RATIO</name>
              <description>RATIO</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SRC</name>
              <description>SRC</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRECNTR</name>
          <description>Prescaler Counter</description>
          <addressOffset>36</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CNT</name>
              <description>CNT</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_TIMER01</name>
      <description>AUX Timer 0 and AUX Timer 1 (AUX_TIMER01) are two 16-bit timers capable of generating one event each:
           AUX_EVCTL:EVSTAT3.AUX_TIMER0_EV.
           AUX_EVCTL:EVSTAT3.AUX_TIMER1_EV.

          he events are described in T0TARGET and T1TARGET. Subscribers to the AUX event bus can use these events to sequence and trigger actions. 

          UX_SYSIF:PEROPRATE.TIMER01_OP_RATE sets the peripheral clock frequency used by the prescaler, timer, and event logic to SCE or AUX bus rate. To use AUX_TIMER01: 
           AUX_SCE must set AUX_SYSIF:PEROPRATE.TIMER01_OP_RATE to SCE_RATE.
           System CPU must set AUX_SYSIF:PEROPRATE.TIMER01_OP_RATE to BUS_RATE.
           The timers must only subscribe to events updated at the peripheral clock frequency or lower.

          nexpected execution behavior can result if software does not obey these rules.</description>
      <baseAddress>0x400c7000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>T0CFG</name>
          <description>Timer 0 Configuration</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TICK_SRC_POL</name>
              <description>TICK_SRC_POL</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TICK_SRC</name>
              <description>TICK_SRC</description>
              <bitRange>[13:8]</bitRange>
            </field>
            <field>
              <name>PRE</name>
              <description>PRE</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RELOAD</name>
              <description>RELOAD</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>T0CTL</name>
          <description>Timer 0 Control</description>
          <addressOffset>4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>T0TARGET</name>
          <description>Timer 0 Target</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>T0CNTR</name>
          <description>Timer 0 Counter</description>
          <addressOffset>12</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>T1CFG</name>
          <description>Timer 1 Configuration</description>
          <addressOffset>16</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TICK_SRC_POL</name>
              <description>TICK_SRC_POL</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TICK_SRC</name>
              <description>TICK_SRC</description>
              <bitRange>[13:8]</bitRange>
            </field>
            <field>
              <name>PRE</name>
              <description>PRE</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RELOAD</name>
              <description>RELOAD</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>T1CTL</name>
          <description>Timer 1 Control</description>
          <addressOffset>20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>T1TARGET</name>
          <description>Timer 1 Target

          imer 1 counter target value</description>
          <addressOffset>24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>T1CNTR</name>
          <description>Timer 1 Counter</description>
          <addressOffset>28</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
