tyropyro/CC1312tester/cc1312/cpu-mmap.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>AUX_TIMER2</name>
      <description>AUX Timer2 (AUX_TIMER2) offers flexible: 
           generation of waveforms and events.
           capture of signal period and duty cycle. 
           generation of single clock pulse.

          t consists of a: 
           16-bit counter.
           4 capture compare channels.
           4 event outputs, which are mapped to AUX event bus, see EVCTL.

          ach channel subscribes to the asynchronous AUX event bus. They can control one or more event outputs in both capture and compare modes.  AUX_SYSIF:TIMER2CLKCTL.SRC selects clock source for the timer.</description>
      <baseAddress>0x400c3000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTL</name>
          <description>Timer Control</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH3_RESET</name>
              <description>CH3_RESET</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CH2_RESET</name>
              <description>CH2_RESET</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CH1_RESET</name>
              <description>CH1_RESET</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CH0_RESET</name>
              <description>CH0_RESET</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TARGET_EN</name>
              <description>TARGET_EN</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TARGET</name>
          <description>Target

          ser defined counter target.</description>
          <addressOffset>4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SHDWTARGET</name>
          <description>Shadow Target</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTR</name>
          <description>Counter</description>
          <addressOffset>12</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRECFG</name>
          <description>Clock Prescaler Configuration</description>
          <addressOffset>16</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLKDIV</name>
              <description>CLKDIV</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCTL</name>
          <description>Event Control 

          et and clear individual events manually. Manual update of an event takes priority over automatic channel updates to the same event. You cannot set and clear an event at the same time, such requests will be neglected.

          n event can be automatically cleared, set, toggled, or pulsed by each channel, listed in decreasing order of priority. The action with highest priority happens when multiple channels want to update an event at the same time.

          he four events connect to the asynchronous AUX event bus: 
           Event 0 connects to AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV0.
           Event 1 connects to AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV1.
           Event 2 connects to AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV2.
           Event 3 connects to AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV3.</description>
          <addressOffset>20</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EV3_SET</name>
              <description>EV3_SET</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EV3_CLR</name>
              <description>EV3_CLR</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EV2_SET</name>
              <description>EV2_SET</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EV2_CLR</name>
              <description>EV2_CLR</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>EV1_SET</name>
              <description>EV1_SET</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EV1_CLR</name>
              <description>EV1_CLR</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EV0_SET</name>
              <description>EV0_SET</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EV0_CLR</name>
              <description>EV0_CLR</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PULSETRIG</name>
          <description>Pulse Trigger</description>
          <addressOffset>24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIG</name>
              <description>TRIG</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0EVCFG</name>
          <description>Channel 0 Event Configuration

          his register configures channel function and enables event outputs.

          ach channel has an edge-detection circuit with memory. The circuit is: 
 - enabled while CCACT selects a capture function and CTL.MODE is different from DIS. 
 - flushed while CCACT selects a capture function and you change CTL.MODE from DIS to another mode. 
 
