tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          he flush action uses two AUX_SYSIF:TIMER2CLKCTL.SRC clock periods. It prevents capture events caused by expired signal values stored in the edge-detection circuit.</description>
          <addressOffset>128</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EV3_GEN</name>
              <description>EV3_GEN</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EV2_GEN</name>
              <description>EV2_GEN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EV1_GEN</name>
              <description>EV1_GEN</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EV0_GEN</name>
              <description>EV0_GEN</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CCACT</name>
              <description>CCACT</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0CCFG</name>
          <description>Channel 0 Capture Configuration</description>
          <addressOffset>132</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CAPT_SRC</name>
              <description>CAPT_SRC</description>
              <bitRange>[6:1]</bitRange>
            </field>
            <field>
              <name>EDGE</name>
              <description>EDGE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0PCC</name>
          <description>Channel 0 Pipeline Capture Compare</description>
          <addressOffset>136</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH0CC</name>
          <description>Channel 0 Capture Compare</description>
          <addressOffset>140</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH1EVCFG</name>
          <description>Channel 1 Event Configuration

          his register configures channel function and enables event outputs.

          ach channel has an edge-detection circuit with memory. The circuit is:  
 - enabled while CCACT selects a capture function and CTL.MODE is different from DIS. 
 - flushed while CCACT selects a capture function and you change CTL.MODE from DIS to another mode. 
 
          he flush action uses two AUX_SYSIF:TIMER2CLKCTL.SRC clock periods. It prevents capture events caused by expired signal values stored in the edge-detection circuit.</description>
          <addressOffset>144</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EV3_GEN</name>
              <description>EV3_GEN</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EV2_GEN</name>
              <description>EV2_GEN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EV1_GEN</name>
              <description>EV1_GEN</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EV0_GEN</name>
              <description>EV0_GEN</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CCACT</name>
              <description>CCACT</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH1CCFG</name>
          <description>Channel 1 Capture Configuration</description>
          <addressOffset>148</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CAPT_SRC</name>
              <description>CAPT_SRC</description>
              <bitRange>[6:1]</bitRange>
            </field>
            <field>
              <name>EDGE</name>
              <description>EDGE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH1PCC</name>
          <description>Channel 1 Pipeline Capture Compare</description>
          <addressOffset>152</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH1CC</name>
          <description>Channel 1 Capture Compare</description>
          <addressOffset>156</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2EVCFG</name>
          <description>Channel 2 Event Configuration

          his register configures channel function and enables event outputs.

          ach channel has an edge-detection circuit with memory. The circuit is:  
 - enabled while CCACT selects a capture function and CTL.MODE is different from DIS. 
 - flushed while CCACT selects a capture function and you change CTL.MODE from DIS to another mode. 
 
