tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          he flush action uses two AUX_SYSIF:TIMER2CLKCTL.SRC clock periods. It prevents capture events caused by expired signal values stored in the edge-detection circuit.</description>
          <addressOffset>160</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EV3_GEN</name>
              <description>EV3_GEN</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EV2_GEN</name>
              <description>EV2_GEN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EV1_GEN</name>
              <description>EV1_GEN</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EV0_GEN</name>
              <description>EV0_GEN</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CCACT</name>
              <description>CCACT</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2CCFG</name>
          <description>Channel 2 Capture Configuration</description>
          <addressOffset>164</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CAPT_SRC</name>
              <description>CAPT_SRC</description>
              <bitRange>[6:1]</bitRange>
            </field>
            <field>
              <name>EDGE</name>
              <description>EDGE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2PCC</name>
          <description>Channel 2 Pipeline Capture Compare</description>
          <addressOffset>168</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH2CC</name>
          <description>Channel 2 Capture Compare</description>
          <addressOffset>172</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3EVCFG</name>
          <description>Channel 3 Event Configuration

          his register configures channel function and enables event outputs.

          ach channel has an edge-detection circuit with memory. The circuit is:  
 - enabled while CCACT selects a capture function and CTL.MODE is different from DIS. 
 - flushed while CCACT selects a capture function and you change CTL.MODE from DIS to another mode. 
 
          he flush action uses two AUX_SYSIF:TIMER2CLKCTL.SRC clock periods. It prevents capture events caused by expired signal values stored in the edge-detection circuit.</description>
          <addressOffset>176</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EV3_GEN</name>
              <description>EV3_GEN</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EV2_GEN</name>
              <description>EV2_GEN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EV1_GEN</name>
              <description>EV1_GEN</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>EV0_GEN</name>
              <description>EV0_GEN</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CCACT</name>
              <description>CCACT</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3CCFG</name>
          <description>Channel 3 Capture Configuration</description>
          <addressOffset>180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CAPT_SRC</name>
              <description>CAPT_SRC</description>
              <bitRange>[6:1]</bitRange>
            </field>
            <field>
              <name>EDGE</name>
              <description>EDGE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3PCC</name>
          <description>Channel 3 Pipeline Capture Compare</description>
          <addressOffset>184</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CH3CC</name>
          <description>Channel 3 Capture Compare</description>
          <addressOffset>188</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CCFG</name>
      <description>Customer configuration area (CCFG)</description>
      <baseAddress>0x50003000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x2000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EXT_LF_CLK</name>
          <description>Extern LF clock configuration</description>
          <addressOffset>8104</addressOffset>
          <access>read-only</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>DIO</name>
              <description>DIO</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>RTC_INCREMENT</name>
              <description>RTC_INCREMENT</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE_CONF_1</name>
          <description>Mode Configuration 1</description>
          <addressOffset>8108</addressOffset>
          <access>read-only</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>ALT_DCDC_VMIN</name>
              <description>ALT_DCDC_VMIN</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>ALT_DCDC_DITHER_EN</name>
              <description>ALT_DCDC_DITHER_EN</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ALT_DCDC_IPEAK</name>
              <description>ALT_DCDC_IPEAK</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>DELTA_IBIAS_INIT</name>
              <description>DELTA_IBIAS_INIT</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>DELTA_IBIAS_OFFSET</name>
              <description>DELTA_IBIAS_OFFSET</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>XOSC_MAX_START</name>
              <description>XOSC_MAX_START</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SIZE_AND_DIS_FLAGS</name>
          <description>CCFG Size and Disable Flags</description>
          <addressOffset>8112</addressOffset>
          <access>read-only</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>SIZE_OF_CCFG</name>
              <description>SIZE_OF_CCFG</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>DISABLE_FLAGS</name>
              <description>DISABLE_FLAGS</description>
              <bitRange>[15:4]</bitRange>
            </field>
            <field>
              <name>DIS_TCXO</name>
              <description>DIS_TCXO</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DIS_GPRAM</name>
              <description>DIS_GPRAM</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DIS_ALT_DCDC_SETTING</name>
              <description>DIS_ALT_DCDC_SETTING</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DIS_XOSC_OVR</name>
              <description>DIS_XOSC_OVR</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE_CONF</name>
          <description>Mode Configuration 0</description>
          <addressOffset>8116</addressOffset>
          <access>read-only</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>VDDR_TRIM_SLEEP_DELTA</name>
              <description>VDDR_TRIM_SLEEP_DELTA</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>DCDC_RECHARGE</name>
              <description>DCDC_RECHARGE</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>DCDC_ACTIVE</name>
              <description>DCDC_ACTIVE</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>VDDR_EXT_LOAD</name>
              <description>VDDR_EXT_LOAD</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>VDDS_BOD_LEVEL</name>
              <description>VDDS_BOD_LEVEL</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SCLK_LF_OPTION</name>
              <description>SCLK_LF_OPTION</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>VDDR_TRIM_SLEEP_TC</name>
              <description>VDDR_TRIM_SLEEP_TC</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>RTC_COMP</name>
              <description>RTC_COMP</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>XOSC_FREQ</name>
              <description>XOSC_FREQ</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>XOSC_CAP_MOD</name>
              <description>XOSC_CAP_MOD</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>HF_COMP</name>
              <description>HF_COMP</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>XOSC_CAPARRAY_DELTA</name>
              <description>XOSC_CAPARRAY_DELTA</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>VDDR_CAP</name>
              <description>VDDR_CAP</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VOLT_LOAD_0</name>
          <description>Voltage Load 0
          nabled by MODE_CONF.VDDR_EXT_LOAD.</description>
          <addressOffset>8120</addressOffset>
          <access>read-only</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>VDDR_EXT_TP45</name>
              <description>VDDR_EXT_TP45</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>VDDR_EXT_TP25</name>
              <description>VDDR_EXT_TP25</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>VDDR_EXT_TP5</name>
              <description>VDDR_EXT_TP5</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>VDDR_EXT_TM15</name>
              <description>VDDR_EXT_TM15</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VOLT_LOAD_1</name>
          <description>Voltage Load 1
          nabled by MODE_CONF.VDDR_EXT_LOAD.</description>
          <addressOffset>8124</addressOffset>
          <access>read-only</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>VDDR_EXT_TP125</name>
              <description>VDDR_EXT_TP125</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>VDDR_EXT_TP105</name>
              <description>VDDR_EXT_TP105</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>VDDR_EXT_TP85</name>
              <description>VDDR_EXT_TP85</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>VDDR_EXT_TP65</name>
              <description>VDDR_EXT_TP65</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTC_OFFSET</name>
          <description>Real Time Clock Offset
          nabled by MODE_CONF.RTC_COMP.</description>
          <addressOffset>8128</addressOffset>
          <access>read-only</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>RTC_COMP_P0</name>
              <description>RTC_COMP_P0</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>RTC_COMP_P1</name>
              <description>RTC_COMP_P1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>RTC_COMP_P2</name>
              <description>RTC_COMP_P2</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQ_OFFSET</name>
          <description>Frequency Offset</description>
          <addressOffset>8132</addressOffset>
          <access>read-only</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>HF_COMP_P0</name>
              <description>HF_COMP_P0</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>HF_COMP_P1</name>
              <description>HF_COMP_P1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>HF_COMP_P2</name>
              <description>HF_COMP_P2</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEEE_MAC_0</name>
          <description>IEEE MAC Address 0</description>
          <addressOffset>8136</addressOffset>
          <access>read-only</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>ADDR</name>
              <description>ADDR</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEEE_MAC_1</name>
          <description>IEEE MAC Address 1</description>
          <addressOffset>8140</addressOffset>
          <access>read-only</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>ADDR</name>
              <description>ADDR</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEEE_BLE_0</name>
          <description>IEEE BLE Address 0</description>
          <addressOffset>8144</addressOffset>
          <access>read-only</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>ADDR</name>
              <description>ADDR</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IEEE_BLE_1</name>
          <description>IEEE BLE Address 1</description>
          <addressOffset>8148</addressOffset>
          <access>read-only</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>ADDR</name>
              <description>ADDR</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BL_CONFIG</name>
          <description>Bootloader Configuration
          onfigures the functionality of the ROM boot loader.
          f both the boot loader is enabled by the BOOTLOADER_ENABLE field and the boot loader backdoor is enabled by the BL_ENABLE field it is possible to force entry of the ROM boot loader even if a valid image is present in flash.</description>
          <addressOffset>8152</addressOffset>
          <access>read-only</access>
          <resetValue>0xc5ffffff</resetValue>
          <fields>
            <field>
              <name>BOOTLOADER_ENABLE</name>
              <description>BOOTLOADER_ENABLE</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>BL_LEVEL</name>
              <description>BL_LEVEL</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>BL_PIN_NUMBER</name>
              <description>BL_PIN_NUMBER</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>BL_ENABLE</name>
              <description>BL_ENABLE</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASE_CONF</name>
          <description>Erase Configuration</description>
          <addressOffset>8156</addressOffset>
          <access>read-only</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>CHIP_ERASE_DIS_N</name>
              <description>CHIP_ERASE_DIS_N</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>BANK_ERASE_DIS_N</name>
              <description>BANK_ERASE_DIS_N</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCFG_TI_OPTIONS</name>
          <description>TI Options</description>
          <addressOffset>8160</addressOffset>
          <access>read-only</access>
          <resetValue>0xffffffc5</resetValue>
          <fields>
            <field>
              <name>TI_FA_ENABLE</name>
              <description>TI_FA_ENABLE</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCFG_TAP_DAP_0</name>
          <description>Test Access Points Enable 0</description>
          <addressOffset>8164</addressOffset>
          <access>read-only</access>
          <resetValue>0xffc5c5c5</resetValue>
          <fields>
            <field>
              <name>CPU_DAP_ENABLE</name>
              <description>CPU_DAP_ENABLE</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>PWRPROF_TAP_ENABLE</name>
              <description>PWRPROF_TAP_ENABLE</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>TEST_TAP_ENABLE</name>
              <description>TEST_TAP_ENABLE</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCFG_TAP_DAP_1</name>
          <description>Test Access Points Enable 1</description>
          <addressOffset>8168</addressOffset>
          <access>read-only</access>
          <resetValue>0xffc5c5c5</resetValue>
          <fields>
            <field>
              <name>PBIST2_TAP_ENABLE</name>
              <description>PBIST2_TAP_ENABLE</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>PBIST1_TAP_ENABLE</name>
              <description>PBIST1_TAP_ENABLE</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>AON_TAP_ENABLE</name>
              <description>AON_TAP_ENABLE</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IMAGE_VALID_CONF</name>
          <description>Image Valid</description>
          <addressOffset>8172</addressOffset>
          <access>read-only</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>IMAGE_VALID</name>
              <description>IMAGE_VALID</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
