tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>CCFG_PROT_127_96</name>
          <description>Protect Sectors 96-127
          ach bit write protects one flash sector from being both programmed and erased. Bit must be set to 0 in order to enable sector write protect. Not in use.</description>
          <addressOffset>8188</addressOffset>
          <access>read-only</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>WRT_PROT_SEC_127</name>
              <description>WRT_PROT_SEC_127</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_126</name>
              <description>WRT_PROT_SEC_126</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_125</name>
              <description>WRT_PROT_SEC_125</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_124</name>
              <description>WRT_PROT_SEC_124</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_123</name>
              <description>WRT_PROT_SEC_123</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_122</name>
              <description>WRT_PROT_SEC_122</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_121</name>
              <description>WRT_PROT_SEC_121</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_120</name>
              <description>WRT_PROT_SEC_120</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_119</name>
              <description>WRT_PROT_SEC_119</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_118</name>
              <description>WRT_PROT_SEC_118</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_117</name>
              <description>WRT_PROT_SEC_117</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_116</name>
              <description>WRT_PROT_SEC_116</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_115</name>
              <description>WRT_PROT_SEC_115</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_114</name>
              <description>WRT_PROT_SEC_114</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_113</name>
              <description>WRT_PROT_SEC_113</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_112</name>
              <description>WRT_PROT_SEC_112</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_111</name>
              <description>WRT_PROT_SEC_111</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_110</name>
              <description>WRT_PROT_SEC_110</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_109</name>
              <description>WRT_PROT_SEC_109</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_108</name>
              <description>WRT_PROT_SEC_108</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_107</name>
              <description>WRT_PROT_SEC_107</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_106</name>
              <description>WRT_PROT_SEC_106</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_105</name>
              <description>WRT_PROT_SEC_105</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_104</name>
              <description>WRT_PROT_SEC_104</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_103</name>
              <description>WRT_PROT_SEC_103</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_102</name>
              <description>WRT_PROT_SEC_102</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_101</name>
              <description>WRT_PROT_SEC_101</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_100</name>
              <description>WRT_PROT_SEC_100</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_99</name>
              <description>WRT_PROT_SEC_99</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_98</name>
              <description>WRT_PROT_SEC_98</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_97</name>
              <description>WRT_PROT_SEC_97</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>WRT_PROT_SEC_96</name>
              <description>WRT_PROT_SEC_96</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
