tyropyro/CC1312tester/cc1312/cpu-mmap.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU_DWT</name>
      <description>Cortex-M's Data watchpoint and Trace (DWT)</description>
      <baseAddress>0xe0001000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control
          se the DWT Control Register to enable the DWT unit.</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <fields>
            <field>
              <name>NOCYCCNT</name>
              <description>NOCYCCNT</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>NOPRFCNT</name>
              <description>NOPRFCNT</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CYCEVTENA</name>
              <description>CYCEVTENA</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>FOLDEVTENA</name>
              <description>FOLDEVTENA</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>LSUEVTENA</name>
              <description>LSUEVTENA</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SLEEPEVTENA</name>
              <description>SLEEPEVTENA</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EXCEVTENA</name>
              <description>EXCEVTENA</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CPIEVTENA</name>
              <description>CPIEVTENA</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EXCTRCENA</name>
              <description>EXCTRCENA</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>PCSAMPLEENA</name>
              <description>PCSAMPLEENA</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYNCTAP</name>
              <description>SYNCTAP</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>CYCTAP</name>
              <description>CYCTAP</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>POSTCNT</name>
              <description>POSTCNT</description>
              <bitRange>[8:5]</bitRange>
            </field>
            <field>
              <name>POSTPRESET</name>
              <description>POSTPRESET</description>
              <bitRange>[4:1]</bitRange>
            </field>
            <field>
              <name>CYCCNTENA</name>
              <description>CYCCNTENA</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CYCCNT</name>
          <description>Current PC Sampler Cycle Count
          his register is used to count the number of core cycles. This counter can measure elapsed execution time. This is a free-running counter (this counter will not advance in power modes where free-running clock to CPU stops). The counter has three functions: 

          : When CTRL.PCSAMPLEENA = 1, the PC is sampled and emitted when the selected tapped bit changes value (0 to 1 or 1 to 0) and any post-scalar value counts to 0. 
          : When CTRL.CYCEVTENA = 1 , (and CTRL.PCSAMPLEENA = 0), an event is emitted when the selected tapped bit changes value (0 to 1 or 1 to 0) and any post-scalar value counts to 0. 
          : Applications and debuggers can use the counter to measure elapsed execution time. By subtracting a start and an end time, an application can measure time between in-core clocks (other than when Halted in debug). This is valid to 2^32 core clock cycles (for example, almost 89.5 seconds at 48MHz).</description>
          <addressOffset>4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CYCCNT</name>
              <description>CYCCNT</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPICNT</name>
          <description>CPI Count
          his register is used to count the total number of instruction cycles beyond the first cycle.</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPICNT</name>
              <description>CPICNT</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EXCCNT</name>
          <description>Exception Overhead Count
          his register is used to count the total cycles spent in interrupt processing.</description>
          <addressOffset>12</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXCCNT</name>
              <description>EXCCNT</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SLEEPCNT</name>
          <description>Sleep Count
          his register is used to count the total number of cycles during which the processor is sleeping.</description>
          <addressOffset>16</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SLEEPCNT</name>
              <description>SLEEPCNT</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LSUCNT</name>
          <description>LSU Count
          his register is used to count the total number of cycles during which the processor is processing an LSU operation beyond the first cycle.</description>
          <addressOffset>20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LSUCNT</name>
              <description>LSUCNT</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FOLDCNT</name>
          <description>Fold Count
          his register is used to count the total number of folded instructions. The counter increments on each instruction which takes 0 cycles.</description>
          <addressOffset>24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FOLDCNT</name>
              <description>FOLDCNT</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCSR</name>
          <description>Program Counter Sample
          his register is used to enable coarse-grained software profiling using a debug agent, without changing the currently executing code. If the core is not in debug state, the value returned is the instruction address of a recently executed instruction. If the core is in debug state, the value returned is 0xFFFFFFFF.</description>
          <addressOffset>28</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EIASAMPLE</name>
              <description>EIASAMPLE</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP0</name>
          <description>Comparator 0
          his register is used to write the reference value for comparator 0.</description>
          <addressOffset>32</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COMP</name>
              <description>COMP</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK0</name>
          <description>Mask 0
          se the DWT Mask Registers 0 to apply a mask to data addresses when matching against COMP0.</description>
          <addressOffset>36</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MASK</name>
              <description>MASK</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNCTION0</name>
          <description>Function 0
          se the DWT Function Registers 0 to control the operation of the comparator 0. This comparator can:
          . Match against either the PC or the data address. This is controlled by CYCMATCH. This function is only available for comparator 0 (COMP0). 
          . Emit data or PC couples, trigger the ETM, or generate a watchpoint depending on the operation defined by FUNCTION.</description>
          <addressOffset>40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MATCHED</name>
              <description>MATCHED</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CYCMATCH</name>
              <description>CYCMATCH</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EMITRANGE</name>
              <description>EMITRANGE</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>FUNCTION</name>
              <description>FUNCTION</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP1</name>
          <description>Comparator 1
          his register is used to write the reference value for comparator 1.</description>
          <addressOffset>48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COMP</name>
              <description>COMP</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK1</name>
          <description>Mask 1
          se the DWT Mask Registers 1 to apply a mask to data addresses when matching against COMP1.</description>
          <addressOffset>52</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MASK</name>
              <description>MASK</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNCTION1</name>
          <description>Function 1
          se the DWT Function Registers 1 to control the operation of the comparator 1. This comparator can:
          . Perform data value comparisons if associated address comparators have performed an address match. This function is only available for comparator 1 (COMP1). 
          . Emit data or PC couples, trigger the ETM, or generate a watchpoint depending on the operation defined by FUNCTION.</description>
          <addressOffset>56</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <fields>
            <field>
              <name>MATCHED</name>
              <description>MATCHED</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DATAVADDR1</name>
              <description>DATAVADDR1</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>DATAVADDR0</name>
              <description>DATAVADDR0</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>DATAVSIZE</name>
              <description>DATAVSIZE</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>LNK1ENA</name>
              <description>LNK1ENA</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DATAVMATCH</name>
              <description>DATAVMATCH</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EMITRANGE</name>
              <description>EMITRANGE</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>FUNCTION</name>
              <description>FUNCTION</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP2</name>
          <description>Comparator 2
          his register is used to write the reference value for comparator 2.</description>
          <addressOffset>64</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COMP</name>
              <description>COMP</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK2</name>
          <description>Mask 2
          se the DWT Mask Registers 2 to apply a mask to data addresses when matching against COMP2.</description>
          <addressOffset>68</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MASK</name>
              <description>MASK</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNCTION2</name>
          <description>Function 2
          se the DWT Function Registers 2 to control the operation of the comparator 2. This comparator can emit data or PC couples, trigger the ETM, or generate a watchpoint depending on the operation defined by FUNCTION.</description>
          <addressOffset>72</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MATCHED</name>
              <description>MATCHED</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>EMITRANGE</name>
              <description>EMITRANGE</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>FUNCTION</name>
              <description>FUNCTION</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP3</name>
          <description>Comparator 3
          his register is used to write the reference value for comparator 3.</description>
          <addressOffset>80</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COMP</name>
              <description>COMP</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MASK3</name>
          <description>Mask 3
          se the DWT Mask Registers 3 to apply a mask to data addresses when matching against COMP3.</description>
          <addressOffset>84</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MASK</name>
              <description>MASK</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNCTION3</name>
          <description>Function 3
          se the DWT Function Registers 3 to control the operation of the comparator 3. This comparator can emit data or PC couples, trigger the ETM, or generate a watchpoint depending on the operation defined by FUNCTION.</description>
          <addressOffset>88</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MATCHED</name>
              <description>MATCHED</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>EMITRANGE</name>
              <description>EMITRANGE</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>FUNCTION</name>
              <description>FUNCTION</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
