tyropyro/CC1312tester/cc1312/cpu-mmap.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU_FPB</name>
      <description>Cortex-M's Flash Patch and Breakpoint (FPB)</description>
      <baseAddress>0xe0002000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control
          his register is used to enable the flash patch block.</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000260</resetValue>
          <fields>
            <field>
              <name>NUM_CODE2</name>
              <description>NUM_CODE2</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>NUM_LIT</name>
              <description>NUM_LIT</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>NUM_CODE1</name>
              <description>NUM_CODE1</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>KEY</name>
              <description>KEY</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ENABLE</name>
              <description>ENABLE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP</name>
          <description>Remap
          his register provides the remap base address location where a matched addresses are remapped. The three most significant bits and the five least significant bits of the remap base address are hard-coded to 3'b001 and 5'b00000 respectively. The remap base address must be in system space and is it required to be 8-word aligned, with one word allocated to each of the eight FPB comparators.</description>
          <addressOffset>4</addressOffset>
          <access>read-write</access>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>REMAP</name>
              <description>REMAP</description>
              <bitRange>[28:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP0</name>
          <description>Comparator 0</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REPLACE</name>
              <description>REPLACE</description>
              <bitRange>[31:30]</bitRange>
            </field>
            <field>
              <name>COMP</name>
              <description>COMP</description>
              <bitRange>[28:2]</bitRange>
            </field>
            <field>
              <name>ENABLE</name>
              <description>ENABLE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP1</name>
          <description>Comparator 1</description>
          <addressOffset>12</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REPLACE</name>
              <description>REPLACE</description>
              <bitRange>[31:30]</bitRange>
            </field>
            <field>
              <name>COMP</name>
              <description>COMP</description>
              <bitRange>[28:2]</bitRange>
            </field>
            <field>
              <name>ENABLE</name>
              <description>ENABLE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP2</name>
          <description>Comparator 2</description>
          <addressOffset>16</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REPLACE</name>
              <description>REPLACE</description>
              <bitRange>[31:30]</bitRange>
            </field>
            <field>
              <name>COMP</name>
              <description>COMP</description>
              <bitRange>[28:2]</bitRange>
            </field>
            <field>
              <name>ENABLE</name>
              <description>ENABLE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP3</name>
          <description>Comparator 3</description>
          <addressOffset>20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REPLACE</name>
              <description>REPLACE</description>
              <bitRange>[31:30]</bitRange>
            </field>
            <field>
              <name>COMP</name>
              <description>COMP</description>
              <bitRange>[28:2]</bitRange>
            </field>
            <field>
              <name>ENABLE</name>
              <description>ENABLE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP4</name>
          <description>Comparator 4</description>
          <addressOffset>24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REPLACE</name>
              <description>REPLACE</description>
              <bitRange>[31:30]</bitRange>
            </field>
            <field>
              <name>COMP</name>
              <description>COMP</description>
              <bitRange>[28:2]</bitRange>
            </field>
            <field>
              <name>ENABLE</name>
              <description>ENABLE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP5</name>
          <description>Comparator 5</description>
          <addressOffset>28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REPLACE</name>
              <description>REPLACE</description>
              <bitRange>[31:30]</bitRange>
            </field>
            <field>
              <name>COMP</name>
              <description>COMP</description>
              <bitRange>[28:2]</bitRange>
            </field>
            <field>
              <name>ENABLE</name>
              <description>ENABLE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP6</name>
          <description>Comparator 6</description>
          <addressOffset>32</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REPLACE</name>
              <description>REPLACE</description>
              <bitRange>[31:30]</bitRange>
            </field>
            <field>
              <name>COMP</name>
              <description>COMP</description>
              <bitRange>[28:2]</bitRange>
            </field>
            <field>
              <name>ENABLE</name>
              <description>ENABLE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>COMP7</name>
          <description>Comparator 7</description>
          <addressOffset>36</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REPLACE</name>
              <description>REPLACE</description>
              <bitRange>[31:30]</bitRange>
            </field>
            <field>
              <name>COMP</name>
              <description>COMP</description>
              <bitRange>[28:2]</bitRange>
            </field>
            <field>
              <name>ENABLE</name>
              <description>ENABLE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
