tyropyro/CC1312tester/cc1312/cpu-mmap.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU_ITM</name>
      <description>Cortex-M's Instrumentation Trace Macrocell (ITM)</description>
      <baseAddress>0xe0000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>STIM0</name>
          <description>Stimulus Port 0</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM0</name>
              <description>STIM0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM1</name>
          <description>Stimulus Port 1</description>
          <addressOffset>4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM1</name>
              <description>STIM1</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM2</name>
          <description>Stimulus Port 2</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM2</name>
              <description>STIM2</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM3</name>
          <description>Stimulus Port 3</description>
          <addressOffset>12</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM3</name>
              <description>STIM3</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM4</name>
          <description>Stimulus Port 4</description>
          <addressOffset>16</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM4</name>
              <description>STIM4</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM5</name>
          <description>Stimulus Port 5</description>
          <addressOffset>20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM5</name>
              <description>STIM5</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM6</name>
          <description>Stimulus Port 6</description>
          <addressOffset>24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM6</name>
              <description>STIM6</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM7</name>
          <description>Stimulus Port 7</description>
          <addressOffset>28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM7</name>
              <description>STIM7</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM8</name>
          <description>Stimulus Port 8</description>
          <addressOffset>32</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM8</name>
              <description>STIM8</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM9</name>
          <description>Stimulus Port 9</description>
          <addressOffset>36</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM9</name>
              <description>STIM9</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM10</name>
          <description>Stimulus Port 10</description>
          <addressOffset>40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM10</name>
              <description>STIM10</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM11</name>
          <description>Stimulus Port 11</description>
          <addressOffset>44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM11</name>
              <description>STIM11</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM12</name>
          <description>Stimulus Port 12</description>
          <addressOffset>48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM12</name>
              <description>STIM12</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM13</name>
          <description>Stimulus Port 13</description>
          <addressOffset>52</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM13</name>
              <description>STIM13</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM14</name>
          <description>Stimulus Port 14</description>
          <addressOffset>56</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM14</name>
              <description>STIM14</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM15</name>
          <description>Stimulus Port 15</description>
          <addressOffset>60</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM15</name>
              <description>STIM15</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM16</name>
          <description>Stimulus Port 16</description>
          <addressOffset>64</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM16</name>
              <description>STIM16</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM17</name>
          <description>Stimulus Port 17</description>
          <addressOffset>68</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM17</name>
              <description>STIM17</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM18</name>
          <description>Stimulus Port 18</description>
          <addressOffset>72</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM18</name>
              <description>STIM18</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM19</name>
          <description>Stimulus Port 19</description>
          <addressOffset>76</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM19</name>
              <description>STIM19</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM20</name>
          <description>Stimulus Port 20</description>
          <addressOffset>80</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM20</name>
              <description>STIM20</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM21</name>
          <description>Stimulus Port 21</description>
          <addressOffset>84</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM21</name>
              <description>STIM21</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM22</name>
          <description>Stimulus Port 22</description>
          <addressOffset>88</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM22</name>
              <description>STIM22</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM23</name>
          <description>Stimulus Port 23</description>
          <addressOffset>92</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM23</name>
              <description>STIM23</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM24</name>
          <description>Stimulus Port 24</description>
          <addressOffset>96</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM24</name>
              <description>STIM24</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM25</name>
          <description>Stimulus Port 25</description>
          <addressOffset>100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM25</name>
              <description>STIM25</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM26</name>
          <description>Stimulus Port 26</description>
          <addressOffset>104</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM26</name>
              <description>STIM26</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM27</name>
          <description>Stimulus Port 27</description>
          <addressOffset>108</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM27</name>
              <description>STIM27</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM28</name>
          <description>Stimulus Port 28</description>
          <addressOffset>112</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM28</name>
              <description>STIM28</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM29</name>
          <description>Stimulus Port 29</description>
          <addressOffset>116</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM29</name>
              <description>STIM29</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM30</name>
          <description>Stimulus Port 30</description>
          <addressOffset>120</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM30</name>
              <description>STIM30</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIM31</name>
          <description>Stimulus Port 31</description>
          <addressOffset>124</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIM31</name>
              <description>STIM31</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TER</name>
          <description>Trace Enable
          se the Trace Enable Register to generate trace data by writing to the corresponding stimulus port. Note: Privileged writes are accepted to this register if TCR.ITMENA is set. User writes are accepted to this register if TCR.ITMENA is set and the appropriate privilege mask is cleared. Privileged access to the stimulus ports enables an RTOS kernel to guarantee instrumentation slots or bandwidth as required.</description>
          <addressOffset>3584</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STIMENA31</name>
              <description>STIMENA31</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>STIMENA30</name>
              <description>STIMENA30</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>STIMENA29</name>
              <description>STIMENA29</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>STIMENA28</name>
              <description>STIMENA28</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>STIMENA27</name>
              <description>STIMENA27</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>STIMENA26</name>
              <description>STIMENA26</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>STIMENA25</name>
              <description>STIMENA25</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>STIMENA24</name>
              <description>STIMENA24</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>STIMENA23</name>
              <description>STIMENA23</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>STIMENA22</name>
              <description>STIMENA22</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>STIMENA21</name>
              <description>STIMENA21</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>STIMENA20</name>
              <description>STIMENA20</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>STIMENA19</name>
              <description>STIMENA19</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>STIMENA18</name>
              <description>STIMENA18</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>STIMENA17</name>
              <description>STIMENA17</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>STIMENA16</name>
              <description>STIMENA16</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>STIMENA15</name>
              <description>STIMENA15</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>STIMENA14</name>
              <description>STIMENA14</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>STIMENA13</name>
              <description>STIMENA13</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>STIMENA12</name>
              <description>STIMENA12</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>STIMENA11</name>
              <description>STIMENA11</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>STIMENA10</name>
              <description>STIMENA10</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>STIMENA9</name>
              <description>STIMENA9</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>STIMENA8</name>
              <description>STIMENA8</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>STIMENA7</name>
              <description>STIMENA7</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>STIMENA6</name>
              <description>STIMENA6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>STIMENA5</name>
              <description>STIMENA5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>STIMENA4</name>
              <description>STIMENA4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>STIMENA3</name>
              <description>STIMENA3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>STIMENA2</name>
              <description>STIMENA2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>STIMENA1</name>
              <description>STIMENA1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>STIMENA0</name>
              <description>STIMENA0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TPR</name>
          <description>Trace Privilege
          his register is used to enable an operating system to control which stimulus ports are accessible by user code. This register can only be used in privileged mode.</description>
          <addressOffset>3648</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIVMASK</name>
              <description>PRIVMASK</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TCR</name>
          <description>Trace Control
          se this register to configure and control ITM transfers. This register can only be written in privilege mode. DWT is not enabled in the ITM block. However, DWT stimulus entry into the FIFO is controlled by DWTENA. If DWT requires timestamping, the TSENA bit must be set.</description>
          <addressOffset>3712</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BUSY</name>
              <description>BUSY</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ATBID</name>
              <description>ATBID</description>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>TSPRESCALE</name>
              <description>TSPRESCALE</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SWOENA</name>
              <description>SWOENA</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DWTENA</name>
              <description>DWTENA</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYNCENA</name>
              <description>SYNCENA</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TSENA</name>
              <description>TSENA</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ITMENA</name>
              <description>ITMENA</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
