tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>LAR</name>
          <description>Lock Access 
          his register is used to prevent write accesses to the Control Registers: TER, TPR and TCR.</description>
          <addressOffset>4016</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LOCK_ACCESS</name>
              <description>LOCK_ACCESS</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LSR</name>
          <description>Lock Status
          se this register to enable write accesses to the Control Register.</description>
          <addressOffset>4020</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>BYTEACC</name>
              <description>BYTEACC</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ACCESS</name>
              <description>ACCESS</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PRESENT</name>
              <description>PRESENT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU_ROM_TABLE</name>
      <description>Cortex-M's ROM table</description>
      <baseAddress>0xe00ff000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SCS</name>
          <description>System Control Space Component</description>
          <addressOffset>0</addressOffset>
          <access>read-only</access>
          <resetValue>0xfff0f003</resetValue>
          <fields>
            <field>
              <name>SCS</name>
              <description>SCS</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DWT</name>
          <description>Data Watchpoint and Trace Component
          oints to the Data Watchpoint and Trace block at 0xE0001000. Value has bit [0] set if DWT is present.</description>
          <addressOffset>4</addressOffset>
          <access>read-only</access>
          <resetValue>0xfff02003</resetValue>
          <fields>
            <field>
              <name>DWT</name>
              <description>DWT</description>
              <bitRange>[31:1]</bitRange>
            </field>
            <field>
              <name>DWT_PRESENT</name>
              <description>DWT_PRESENT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FPB</name>
          <description>Flash Patch and Breakpoint Component
          oints to the Flash Patch and Breakpoint block at 0xE0002000. Value has bit [0] set to 1 if FPB is present.</description>
          <addressOffset>8</addressOffset>
          <access>read-only</access>
          <resetValue>0xfff03003</resetValue>
          <fields>
            <field>
              <name>FPB</name>
              <description>FPB</description>
              <bitRange>[31:1]</bitRange>
            </field>
            <field>
              <name>FPB_PRESENT</name>
              <description>FPB_PRESENT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ITM</name>
          <description>Instrumentation Trace Component
          oints to the Instrumentation Trace block at 0xE0000000. Value has bit [0] set if ITM is present.</description>
          <addressOffset>12</addressOffset>
          <access>read-only</access>
          <resetValue>0xfff01003</resetValue>
          <fields>
            <field>
              <name>ITM</name>
              <description>ITM</description>
              <bitRange>[31:1]</bitRange>
            </field>
            <field>
              <name>ITM_PRESENT</name>
              <description>ITM_PRESENT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TPIU</name>
          <description>Trace Port Interface Component
          oints to the TPIU. Value has bit [0] set to 1 if TPIU is present. TPIU is at 0xE0040000.</description>
          <addressOffset>16</addressOffset>
          <access>read-only</access>
          <resetValue>0xfff41003</resetValue>
          <fields>
            <field>
              <name>TPIU</name>
              <description>TPIU</description>
              <bitRange>[31:1]</bitRange>
            </field>
            <field>
              <name>TPIU_PRESENT</name>
              <description>TPIU_PRESENT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM</name>
          <description>Enhanced Trace Component
          oints to the ETM. Value has bit [0] set to 1 if ETM is present. ETM is at 0xE0041000.</description>
          <addressOffset>20</addressOffset>
          <access>read-only</access>
          <resetValue>0xfff42002</resetValue>
          <fields>
            <field>
              <name>ETM</name>
              <description>ETM</description>
              <bitRange>[31:1]</bitRange>
            </field>
            <field>
              <name>ETM_PRESENT</name>
              <description>ETM_PRESENT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>END</name>
          <description>End Marker
          arks the end of the ROM table. If CoreSight components are added, they are added starting from this location and the End marker is moved to the next location after the additional components.</description>
          <addressOffset>24</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>END</name>
              <description>END</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTEM_ACCESS</name>
          <description>System Memory Map Access for DAP</description>
          <addressOffset>4044</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SYSTEM_ACCESS</name>
              <description>SYSTEM_ACCESS</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
