tyropyro/CC1312tester/cc1312/cpu-mmap.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU_SCS</name>
      <description>Cortex-M's System Control Space (SCS)</description>
      <baseAddress>0xe000e000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>NMI_FAULT</name>
        <description>The NMI handler</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>HARD_FAULT</name>
        <description>The hard fault handler</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>MEMMANAGE_FAULT</name>
        <description>Memory Management (MemManage) Fault</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>BUS_FAULT</name>
        <description>The bus fault handler</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>USAGE_FAULT</name>
        <description>The usage fault handler</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>SVCALL</name>
        <description>Supervisor Call (SVCall)</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>DEBUG</name>
        <description>Debug monitor handler</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>PENDSV</name>
        <description>The PendSV handler</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>SYSTICK</name>
        <description>The SysTick handler</description>
        <value>15</value>
      </interrupt>
      <registers>
        <register>
          <name>ICTR</name>
          <description>Interrupt Control Type
          ead this register to see the number of interrupt lines that the NVIC supports.</description>
          <addressOffset>4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>INTLINESNUM</name>
              <description>INTLINESNUM</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACTLR</name>
          <description>Auxiliary Control
          his register is used to disable certain aspects of functionality within the processor</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DISOOFP</name>
              <description>DISOOFP</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DISFPCA</name>
              <description>DISFPCA</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DISFOLD</name>
              <description>DISFOLD</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DISDEFWBUF</name>
              <description>DISDEFWBUF</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DISMCYCINT</name>
              <description>DISMCYCINT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STCSR</name>
          <description>SysTick Control and Status
          his register enables the SysTick features and returns status flags related to SysTick.</description>
          <addressOffset>16</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>COUNTFLAG</name>
              <description>COUNTFLAG</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CLKSOURCE</name>
              <description>CLKSOURCE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TICKINT</name>
              <description>TICKINT</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ENABLE</name>
              <description>ENABLE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STRVR</name>
          <description>SysTick Reload Value
          his register is used to specify the start value to load into the current value register STCVR.CURRENT when the counter reaches 0. It can be any value between 1 and 0x00FFFFFF. A start value of 0 is possible, but has no effect because the SysTick interrupt and STCSR.COUNTFLAG are activated when counting from 1 to 0.</description>
          <addressOffset>20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RELOAD</name>
              <description>RELOAD</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STCVR</name>
          <description>SysTick Current Value
          ead from this register returns the current value of SysTick counter. Writing to this register resets the SysTick counter (as well as  STCSR.COUNTFLAG).</description>
          <addressOffset>24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CURRENT</name>
              <description>CURRENT</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STCR</name>
          <description>SysTick Calibration Value
          sed to enable software to scale to any required speed using divide and multiply.</description>
          <addressOffset>28</addressOffset>
          <access>read-only</access>
          <resetValue>0xc0075300</resetValue>
          <fields>
            <field>
              <name>NOREF</name>
              <description>NOREF</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>SKEW</name>
              <description>SKEW</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>TENMS</name>
              <description>TENMS</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_ISER0</name>
          <description>Irq 0 to 31 Set Enable
          his register is used to enable interrupts and determine which interrupts are currently enabled.</description>
          <addressOffset>256</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SETENA31</name>
              <description>SETENA31</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>SETENA30</name>
              <description>SETENA30</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>SETENA29</name>
              <description>SETENA29</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>SETENA28</name>
              <description>SETENA28</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>SETENA27</name>
              <description>SETENA27</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SETENA26</name>
              <description>SETENA26</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SETENA25</name>
              <description>SETENA25</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SETENA24</name>
              <description>SETENA24</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SETENA23</name>
              <description>SETENA23</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>SETENA22</name>
              <description>SETENA22</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SETENA21</name>
              <description>SETENA21</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SETENA20</name>
              <description>SETENA20</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SETENA19</name>
              <description>SETENA19</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SETENA18</name>
              <description>SETENA18</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SETENA17</name>
              <description>SETENA17</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SETENA16</name>
              <description>SETENA16</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SETENA15</name>
              <description>SETENA15</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SETENA14</name>
              <description>SETENA14</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SETENA13</name>
              <description>SETENA13</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SETENA12</name>
              <description>SETENA12</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SETENA11</name>
              <description>SETENA11</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SETENA10</name>
              <description>SETENA10</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SETENA9</name>
              <description>SETENA9</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SETENA8</name>
              <description>SETENA8</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SETENA7</name>
              <description>SETENA7</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SETENA6</name>
              <description>SETENA6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SETENA5</name>
              <description>SETENA5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SETENA4</name>
              <description>SETENA4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SETENA3</name>
              <description>SETENA3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SETENA2</name>
              <description>SETENA2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SETENA1</name>
              <description>SETENA1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SETENA0</name>
              <description>SETENA0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_ISER1</name>
          <description>Irq 32 to 63 Set Enable
          his register is used to enable interrupts and determine which interrupts are currently enabled.</description>
          <addressOffset>260</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SETENA37</name>
              <description>SETENA37</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SETENA36</name>
              <description>SETENA36</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SETENA35</name>
              <description>SETENA35</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SETENA34</name>
              <description>SETENA34</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SETENA33</name>
              <description>SETENA33</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SETENA32</name>
              <description>SETENA32</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_ICER0</name>
          <description>Irq 0 to 31 Clear Enable
          his register is used to disable interrupts and determine which interrupts are currently enabled.</description>
          <addressOffset>384</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLRENA31</name>
              <description>CLRENA31</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>CLRENA30</name>
              <description>CLRENA30</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CLRENA29</name>
              <description>CLRENA29</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CLRENA28</name>
              <description>CLRENA28</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CLRENA27</name>
              <description>CLRENA27</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>CLRENA26</name>
              <description>CLRENA26</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CLRENA25</name>
              <description>CLRENA25</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CLRENA24</name>
              <description>CLRENA24</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CLRENA23</name>
              <description>CLRENA23</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CLRENA22</name>
              <description>CLRENA22</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CLRENA21</name>
              <description>CLRENA21</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CLRENA20</name>
              <description>CLRENA20</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CLRENA19</name>
              <description>CLRENA19</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CLRENA18</name>
              <description>CLRENA18</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CLRENA17</name>
              <description>CLRENA17</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CLRENA16</name>
              <description>CLRENA16</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CLRENA15</name>
              <description>CLRENA15</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CLRENA14</name>
              <description>CLRENA14</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CLRENA13</name>
              <description>CLRENA13</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CLRENA12</name>
              <description>CLRENA12</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CLRENA11</name>
              <description>CLRENA11</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CLRENA10</name>
              <description>CLRENA10</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CLRENA9</name>
              <description>CLRENA9</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CLRENA8</name>
              <description>CLRENA8</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CLRENA7</name>
              <description>CLRENA7</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CLRENA6</name>
              <description>CLRENA6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CLRENA5</name>
              <description>CLRENA5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CLRENA4</name>
              <description>CLRENA4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CLRENA3</name>
              <description>CLRENA3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CLRENA2</name>
              <description>CLRENA2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CLRENA1</name>
              <description>CLRENA1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CLRENA0</name>
              <description>CLRENA0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_ICER1</name>
          <description>Irq 32 to 63 Clear Enable
          his register is used to disable interrupts and determine which interrupts are currently enabled.</description>
          <addressOffset>388</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLRENA37</name>
              <description>CLRENA37</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CLRENA36</name>
              <description>CLRENA36</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CLRENA35</name>
              <description>CLRENA35</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CLRENA34</name>
              <description>CLRENA34</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CLRENA33</name>
              <description>CLRENA33</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CLRENA32</name>
              <description>CLRENA32</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
