tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>NVIC_ISPR0</name>
          <description>Irq 0 to 31 Set Pending
          his register is used to force interrupts into the pending state and determine which interrupts are currently pending.</description>
          <addressOffset>512</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SETPEND31</name>
              <description>SETPEND31</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>SETPEND30</name>
              <description>SETPEND30</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>SETPEND29</name>
              <description>SETPEND29</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>SETPEND28</name>
              <description>SETPEND28</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>SETPEND27</name>
              <description>SETPEND27</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SETPEND26</name>
              <description>SETPEND26</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SETPEND25</name>
              <description>SETPEND25</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SETPEND24</name>
              <description>SETPEND24</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SETPEND23</name>
              <description>SETPEND23</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>SETPEND22</name>
              <description>SETPEND22</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SETPEND21</name>
              <description>SETPEND21</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SETPEND20</name>
              <description>SETPEND20</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SETPEND19</name>
              <description>SETPEND19</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SETPEND18</name>
              <description>SETPEND18</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SETPEND17</name>
              <description>SETPEND17</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SETPEND16</name>
              <description>SETPEND16</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SETPEND15</name>
              <description>SETPEND15</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SETPEND14</name>
              <description>SETPEND14</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SETPEND13</name>
              <description>SETPEND13</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SETPEND12</name>
              <description>SETPEND12</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SETPEND11</name>
              <description>SETPEND11</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SETPEND10</name>
              <description>SETPEND10</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SETPEND9</name>
              <description>SETPEND9</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SETPEND8</name>
              <description>SETPEND8</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SETPEND7</name>
              <description>SETPEND7</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SETPEND6</name>
              <description>SETPEND6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SETPEND5</name>
              <description>SETPEND5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SETPEND4</name>
              <description>SETPEND4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SETPEND3</name>
              <description>SETPEND3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SETPEND2</name>
              <description>SETPEND2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SETPEND1</name>
              <description>SETPEND1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SETPEND0</name>
              <description>SETPEND0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_ISPR1</name>
          <description>Irq 32 to 63 Set Pending
          his register is used to force interrupts into the pending state and determine which interrupts are currently pending.</description>
          <addressOffset>516</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SETPEND37</name>
              <description>SETPEND37</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SETPEND36</name>
              <description>SETPEND36</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SETPEND35</name>
              <description>SETPEND35</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SETPEND34</name>
              <description>SETPEND34</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SETPEND33</name>
              <description>SETPEND33</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SETPEND32</name>
              <description>SETPEND32</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_ICPR0</name>
          <description>Irq 0 to 31 Clear Pending
          his register is used to clear pending interrupts and determine which interrupts are currently pending.</description>
          <addressOffset>640</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLRPEND31</name>
              <description>CLRPEND31</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>CLRPEND30</name>
              <description>CLRPEND30</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CLRPEND29</name>
              <description>CLRPEND29</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CLRPEND28</name>
              <description>CLRPEND28</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CLRPEND27</name>
              <description>CLRPEND27</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>CLRPEND26</name>
              <description>CLRPEND26</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CLRPEND25</name>
              <description>CLRPEND25</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CLRPEND24</name>
              <description>CLRPEND24</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CLRPEND23</name>
              <description>CLRPEND23</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CLRPEND22</name>
              <description>CLRPEND22</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CLRPEND21</name>
              <description>CLRPEND21</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CLRPEND20</name>
              <description>CLRPEND20</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CLRPEND19</name>
              <description>CLRPEND19</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CLRPEND18</name>
              <description>CLRPEND18</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CLRPEND17</name>
              <description>CLRPEND17</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CLRPEND16</name>
              <description>CLRPEND16</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CLRPEND15</name>
              <description>CLRPEND15</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CLRPEND14</name>
              <description>CLRPEND14</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CLRPEND13</name>
              <description>CLRPEND13</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CLRPEND12</name>
              <description>CLRPEND12</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CLRPEND11</name>
              <description>CLRPEND11</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CLRPEND10</name>
              <description>CLRPEND10</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CLRPEND9</name>
              <description>CLRPEND9</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CLRPEND8</name>
              <description>CLRPEND8</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CLRPEND7</name>
              <description>CLRPEND7</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CLRPEND6</name>
              <description>CLRPEND6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CLRPEND5</name>
              <description>CLRPEND5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CLRPEND4</name>
              <description>CLRPEND4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CLRPEND3</name>
              <description>CLRPEND3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CLRPEND2</name>
              <description>CLRPEND2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CLRPEND1</name>
              <description>CLRPEND1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CLRPEND0</name>
              <description>CLRPEND0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_ICPR1</name>
          <description>Irq 32 to 63 Clear Pending
          his register is used to clear pending interrupts and determine which interrupts are currently pending.</description>
          <addressOffset>644</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLRPEND37</name>
              <description>CLRPEND37</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CLRPEND36</name>
              <description>CLRPEND36</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CLRPEND35</name>
              <description>CLRPEND35</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CLRPEND34</name>
              <description>CLRPEND34</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CLRPEND33</name>
              <description>CLRPEND33</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CLRPEND32</name>
              <description>CLRPEND32</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IABR0</name>
          <description>Irq 0 to 31 Active Bit
          his register is used to determine which interrupts are active. Each flag in the register corresponds to one interrupt.</description>
          <addressOffset>768</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACTIVE31</name>
              <description>ACTIVE31</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>ACTIVE30</name>
              <description>ACTIVE30</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ACTIVE29</name>
              <description>ACTIVE29</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ACTIVE28</name>
              <description>ACTIVE28</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ACTIVE27</name>
              <description>ACTIVE27</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ACTIVE26</name>
              <description>ACTIVE26</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ACTIVE25</name>
              <description>ACTIVE25</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ACTIVE24</name>
              <description>ACTIVE24</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ACTIVE23</name>
              <description>ACTIVE23</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ACTIVE22</name>
              <description>ACTIVE22</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ACTIVE21</name>
              <description>ACTIVE21</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ACTIVE20</name>
              <description>ACTIVE20</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ACTIVE19</name>
              <description>ACTIVE19</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ACTIVE18</name>
              <description>ACTIVE18</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ACTIVE17</name>
              <description>ACTIVE17</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ACTIVE16</name>
              <description>ACTIVE16</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ACTIVE15</name>
              <description>ACTIVE15</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ACTIVE14</name>
              <description>ACTIVE14</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ACTIVE13</name>
              <description>ACTIVE13</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ACTIVE12</name>
              <description>ACTIVE12</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ACTIVE11</name>
              <description>ACTIVE11</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ACTIVE10</name>
              <description>ACTIVE10</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ACTIVE9</name>
              <description>ACTIVE9</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ACTIVE8</name>
              <description>ACTIVE8</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ACTIVE7</name>
              <description>ACTIVE7</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ACTIVE6</name>
              <description>ACTIVE6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ACTIVE5</name>
              <description>ACTIVE5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ACTIVE4</name>
              <description>ACTIVE4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACTIVE3</name>
              <description>ACTIVE3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACTIVE2</name>
              <description>ACTIVE2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ACTIVE1</name>
              <description>ACTIVE1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ACTIVE0</name>
              <description>ACTIVE0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IABR1</name>
          <description>Irq 32 to 63 Active Bit
          his register is used to determine which interrupts are active. Each flag in the register corresponds to one interrupt.</description>
          <addressOffset>772</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACTIVE37</name>
              <description>ACTIVE37</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ACTIVE36</name>
              <description>ACTIVE36</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ACTIVE35</name>
              <description>ACTIVE35</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ACTIVE34</name>
              <description>ACTIVE34</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ACTIVE33</name>
              <description>ACTIVE33</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ACTIVE32</name>
              <description>ACTIVE32</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR0</name>
          <description>Irq 0 to 3 Priority
          his register is used to assign a priority from 0 to 255 to each of the available interrupts. 0 is the highest priority, and 255 is the lowest. The interpretation of the Interrupt Priority Registers changes based on the setting in AIRCR.PRIGROUP.</description>
          <addressOffset>1024</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRI_3</name>
              <description>PRI_3</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>PRI_2</name>
              <description>PRI_2</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>PRI_1</name>
              <description>PRI_1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>PRI_0</name>
              <description>PRI_0</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
