tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>NVIC_IPR1</name>
          <description>Irq 4 to 7 Priority
          his register is used to assign a priority from 0 to 255 to each of the available interrupts. 0 is the highest priority, and 255 is the lowest. The interpretation of the Interrupt Priority Registers changes based on the setting in AIRCR.PRIGROUP.</description>
          <addressOffset>1028</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRI_7</name>
              <description>PRI_7</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>PRI_6</name>
              <description>PRI_6</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>PRI_5</name>
              <description>PRI_5</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>PRI_4</name>
              <description>PRI_4</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR2</name>
          <description>Irq 8 to 11 Priority
          his register is used to assign a priority from 0 to 255 to each of the available interrupts. 0 is the highest priority, and 255 is the lowest. The interpretation of the Interrupt Priority Registers changes based on the setting in AIRCR.PRIGROUP.</description>
          <addressOffset>1032</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRI_11</name>
              <description>PRI_11</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>PRI_10</name>
              <description>PRI_10</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>PRI_9</name>
              <description>PRI_9</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>PRI_8</name>
              <description>PRI_8</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR3</name>
          <description>Irq 12 to 15 Priority
          his register is used to assign a priority from 0 to 255 to each of the available interrupts. 0 is the highest priority, and 255 is the lowest. The interpretation of the Interrupt Priority Registers changes based on the setting in AIRCR.PRIGROUP.</description>
          <addressOffset>1036</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRI_15</name>
              <description>PRI_15</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>PRI_14</name>
              <description>PRI_14</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>PRI_13</name>
              <description>PRI_13</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>PRI_12</name>
              <description>PRI_12</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR4</name>
          <description>Irq 16 to 19 Priority
          his register is used to assign a priority from 0 to 255 to each of the available interrupts. 0 is the highest priority, and 255 is the lowest. The interpretation of the Interrupt Priority Registers changes based on the setting in AIRCR.PRIGROUP.</description>
          <addressOffset>1040</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRI_19</name>
              <description>PRI_19</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>PRI_18</name>
              <description>PRI_18</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>PRI_17</name>
              <description>PRI_17</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>PRI_16</name>
              <description>PRI_16</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR5</name>
          <description>Irq 20 to 23 Priority
          his register is used to assign a priority from 0 to 255 to each of the available interrupts. 0 is the highest priority, and 255 is the lowest. The interpretation of the Interrupt Priority Registers changes based on the setting in AIRCR.PRIGROUP.</description>
          <addressOffset>1044</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRI_23</name>
              <description>PRI_23</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>PRI_22</name>
              <description>PRI_22</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>PRI_21</name>
              <description>PRI_21</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>PRI_20</name>
              <description>PRI_20</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR6</name>
          <description>Irq 24 to 27 Priority
          his register is used to assign a priority from 0 to 255 to each of the available interrupts. 0 is the highest priority, and 255 is the lowest. The interpretation of the Interrupt Priority Registers changes based on the setting in AIRCR.PRIGROUP.</description>
          <addressOffset>1048</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRI_27</name>
              <description>PRI_27</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>PRI_26</name>
              <description>PRI_26</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>PRI_25</name>
              <description>PRI_25</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>PRI_24</name>
              <description>PRI_24</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR7</name>
          <description>Irq 28 to 31 Priority
          his register is used to assign a priority from 0 to 255 to each of the available interrupts. 0 is the highest priority, and 255 is the lowest. The interpretation of the Interrupt Priority Registers changes based on the setting in AIRCR.PRIGROUP.</description>
          <addressOffset>1052</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRI_31</name>
              <description>PRI_31</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>PRI_30</name>
              <description>PRI_30</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>PRI_29</name>
              <description>PRI_29</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>PRI_28</name>
              <description>PRI_28</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR8</name>
          <description>Irq 32 to 35 Priority
          his register is used to assign a priority from 0 to 255 to each of the available interrupts. 0 is the highest priority, and 255 is the lowest. The interpretation of the Interrupt Priority Registers changes based on the setting in AIRCR.PRIGROUP.</description>
          <addressOffset>1056</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRI_35</name>
              <description>PRI_35</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>PRI_34</name>
              <description>PRI_34</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>PRI_33</name>
              <description>PRI_33</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>PRI_32</name>
              <description>PRI_32</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_IPR9</name>
          <description>Irq 32 to 35 Priority
          his register is used to assign a priority from 0 to 255 to each of the available interrupts. 0 is the highest priority, and 255 is the lowest. The interpretation of the Interrupt Priority Registers changes based on the setting in AIRCR.PRIGROUP.</description>
          <addressOffset>1060</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRI_37</name>
              <description>PRI_37</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>PRI_36</name>
              <description>PRI_36</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUID</name>
          <description>CPUID Base
          his register determines the ID number of the processor core, the version number of the processor core and the implementation details of the processor core.</description>
          <addressOffset>3328</addressOffset>
          <access>read-only</access>
          <resetValue>0x410fc241</resetValue>
          <fields>
            <field>
              <name>IMPLEMENTER</name>
              <description>IMPLEMENTER</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>VARIANT</name>
              <description>VARIANT</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>CONSTANT</name>
              <description>CONSTANT</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>PARTNO</name>
              <description>PARTNO</description>
              <bitRange>[15:4]</bitRange>
            </field>
            <field>
              <name>REVISION</name>
              <description>REVISION</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICSR</name>
          <description>Interrupt Control State
          his register is used to set a pending Non-Maskable Interrupt (NMI), set or clear a pending SVC, set or clear a pending SysTick, check for pending exceptions, check the vector number of the highest priority pended exception, and check the vector number of the active exception.</description>
          <addressOffset>3332</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NMIPENDSET</name>
              <description>NMIPENDSET</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>PENDSVSET</name>
              <description>PENDSVSET</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>PENDSVCLR</name>
              <description>PENDSVCLR</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PENDSTSET</name>
              <description>PENDSTSET</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>PENDSTCLR</name>
              <description>PENDSTCLR</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ISRPREEMPT</name>
              <description>ISRPREEMPT</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ISRPENDING</name>
              <description>ISRPENDING</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>VECTPENDING</name>
              <description>VECTPENDING</description>
              <bitRange>[17:12]</bitRange>
            </field>
            <field>
              <name>RETTOBASE</name>
              <description>RETTOBASE</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>VECTACTIVE</name>
              <description>VECTACTIVE</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VTOR</name>
          <description>Vector Table Offset
          his register is used to relocated the vector table base address. The vector table base offset determines the offset from the bottom of the memory map. The two most significant bits and the seven least significant bits of the vector table base offset must be 0. The portion of vector table base offset that is allowed to change is TBLOFF.</description>
          <addressOffset>3336</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TBLOFF</name>
              <description>TBLOFF</description>
              <bitRange>[29:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AIRCR</name>
          <description>Application Interrupt/Reset Control
          his register is used to determine data endianness, clear all active state information for debug or to recover from a hard failure, execute a system reset, alter the priority grouping position (binary point).</description>
          <addressOffset>3340</addressOffset>
          <access>read-write</access>
          <resetValue>0xfa050000</resetValue>
          <fields>
            <field>
              <name>VECTKEY</name>
              <description>VECTKEY</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>ENDIANESS</name>
              <description>ENDIANESS</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>PRIGROUP</name>
              <description>PRIGROUP</description>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>SYSRESETREQ</name>
              <description>SYSRESETREQ</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>VECTCLRACTIVE</name>
              <description>VECTCLRACTIVE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>VECTRESET</name>
              <description>VECTRESET</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCR</name>
          <description>System Control
          his register is used for power-management functions, i.e., signaling to the system when the processor can enter a low power state, controlling how the processor enters and exits low power states.</description>
          <addressOffset>3344</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SEVONPEND</name>
              <description>SEVONPEND</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SLEEPDEEP</name>
              <description>SLEEPDEEP</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SLEEPONEXIT</name>
              <description>SLEEPONEXIT</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>Configuration Control
          his register is used to enable NMI, HardFault and FAULTMASK to ignore bus fault, trap divide by zero and unaligned accesses, enable user access to the Software Trigger Interrupt Register (STIR), control entry to Thread Mode.</description>
          <addressOffset>3348</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <fields>
            <field>
              <name>STKALIGN</name>
              <description>STKALIGN</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BFHFNMIGN</name>
              <description>BFHFNMIGN</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIV_0_TRP</name>
              <description>DIV_0_TRP</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UNALIGN_TRP</name>
              <description>UNALIGN_TRP</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USERSETMPEND</name>
              <description>USERSETMPEND</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>NONBASETHREDENA</name>
              <description>NONBASETHREDENA</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SHPR1</name>
          <description>System Handlers 4-7 Priority
          his register is used to prioritize the following system handlers: Memory manage, Bus fault, and Usage fault. System Handlers are a special class of exception handler that can have their priority set to any of the priority levels. Most can be masked on (enabled) or off (disabled). When disabled, the fault is always treated as a Hard Fault.</description>
          <addressOffset>3352</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRI_6</name>
              <description>PRI_6</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>PRI_5</name>
              <description>PRI_5</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>PRI_4</name>
              <description>PRI_4</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SHPR2</name>
          <description>System Handlers 8-11 Priority
          his register is used to prioritize the SVC handler. System Handlers are a special class of exception handler that can have their priority set to any of the priority levels. Most can be masked on (enabled) or off (disabled). When disabled, the fault is always treated as a Hard Fault.</description>
          <addressOffset>3356</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRI_11</name>
              <description>PRI_11</description>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SHPR3</name>
          <description>System Handlers 12-15 Priority
          his register is used to prioritize the following system handlers: SysTick, PendSV and Debug Monitor. System Handlers are a special class of exception handler that can have their priority set to any of the priority levels. Most can be masked on (enabled) or off (disabled). When disabled, the fault is always treated as a Hard Fault.</description>
          <addressOffset>3360</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRI_15</name>
              <description>PRI_15</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>PRI_14</name>
              <description>PRI_14</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>PRI_12</name>
              <description>PRI_12</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
