tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>SHCSR</name>
          <description>System Handler Control and State
          his register is used to enable or disable the system handlers, determine the pending status of bus fault, mem manage fault, and SVC, determine the active status of the system handlers. If a fault condition occurs while its fault handler is disabled, the fault escalates to a Hard Fault.</description>
          <addressOffset>3364</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>USGFAULTENA</name>
              <description>USGFAULTENA</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>BUSFAULTENA</name>
              <description>BUSFAULTENA</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>MEMFAULTENA</name>
              <description>MEMFAULTENA</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SVCALLPENDED</name>
              <description>SVCALLPENDED</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>BUSFAULTPENDED</name>
              <description>BUSFAULTPENDED</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>MEMFAULTPENDED</name>
              <description>MEMFAULTPENDED</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>USGFAULTPENDED</name>
              <description>USGFAULTPENDED</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SYSTICKACT</name>
              <description>SYSTICKACT</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PENDSVACT</name>
              <description>PENDSVACT</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>MONITORACT</name>
              <description>MONITORACT</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SVCALLACT</name>
              <description>SVCALLACT</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>USGFAULTACT</name>
              <description>USGFAULTACT</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BUSFAULTACT</name>
              <description>BUSFAULTACT</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MEMFAULTACT</name>
              <description>MEMFAULTACT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFSR</name>
          <description>Configurable Fault Status
          his register is used to obtain information about local faults. These registers include three subsections: The first byte is Memory Manage Fault Status Register (MMFSR). The second byte is Bus Fault Status Register (BFSR). The higher half-word is Usage Fault Status Register (UFSR). The flags in these registers indicate the causes of local faults. Multiple flags can be set if more than one fault occurs. These register are read/write-clear. This means that they can be read normally, but writing a 1 to any bit clears that bit.
          he CFSR is byte accessible. CFSR or its subregisters can be accessed as follows:
          he following accesses are possible to the CFSR register:
           access the complete register with a word access to 0xE000ED28. 
           access the MMFSR with a byte access to 0xE000ED28
           access the MMFSR and BFSR with a halfword access to 0xE000ED28
           access the BFSR with a byte access to 0xE000ED29
           access the UFSR with a halfword access to 0xE000ED2A.</description>
          <addressOffset>3368</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIVBYZERO</name>
              <description>DIVBYZERO</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>UNALIGNED</name>
              <description>UNALIGNED</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>NOCP</name>
              <description>NOCP</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>INVPC</name>
              <description>INVPC</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>INVSTATE</name>
              <description>INVSTATE</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>UNDEFINSTR</name>
              <description>UNDEFINSTR</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>BFARVALID</name>
              <description>BFARVALID</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>STKERR</name>
              <description>STKERR</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UNSTKERR</name>
              <description>UNSTKERR</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>IMPRECISERR</name>
              <description>IMPRECISERR</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>PRECISERR</name>
              <description>PRECISERR</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IBUSERR</name>
              <description>IBUSERR</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>MMARVALID</name>
              <description>MMARVALID</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>MSTKERR</name>
              <description>MSTKERR</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MUNSTKERR</name>
              <description>MUNSTKERR</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DACCVIOL</name>
              <description>DACCVIOL</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IACCVIOL</name>
              <description>IACCVIOL</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HFSR</name>
          <description>Hard Fault Status
          his register is used to obtain information about events that activate the Hard Fault handler. This register is a write-clear register. This means that writing a 1 to a bit clears that bit.</description>
          <addressOffset>3372</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DEBUGEVT</name>
              <description>DEBUGEVT</description>
              <bitRange>[31:31]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>FORCED</name>
              <description>FORCED</description>
              <bitRange>[30:30]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>VECTTBL</name>
              <description>VECTTBL</description>
              <bitRange>[1:1]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DFSR</name>
          <description>Debug Fault Status
          his register is used to monitor external debug requests, vector catches, data watchpoint match, BKPT instruction execution, halt requests. Multiple flags in the Debug Fault Status Register can be set when multiple fault conditions occur. The register is read/write clear. This means that it can be read normally. Writing a 1 to a bit clears that bit. Note that these bits are not set unless the event is caught. This means that it causes a stop of some sort. If halting debug is enabled, these events stop the processor into debug. If debug is disabled and the debug monitor is enabled, then this becomes a debug monitor handler call, if priority permits. If debug and the monitor are both disabled, some of these events are Hard Faults, and some are ignored.</description>
          <addressOffset>3376</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EXTERNAL</name>
              <description>EXTERNAL</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>VCATCH</name>
              <description>VCATCH</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DWTTRAP</name>
              <description>DWTTRAP</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BKPT</name>
              <description>BKPT</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HALTED</name>
              <description>HALTED</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MMFAR</name>
          <description>Mem Manage Fault Address
          his register is used to read the address of the location that caused a Memory Manage Fault.</description>
          <addressOffset>3380</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>ADDRESS</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BFAR</name>
          <description>Bus Fault Address
          his register is used to read the address of the location that generated a Bus Fault.</description>
          <addressOffset>3384</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>ADDRESS</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AFSR</name>
          <description>Auxiliary Fault Status
          his register is used to determine additional system fault information to software. Single-cycle high level on an auxiliary faults is latched as one. The bit can only be cleared by writing a one to the corresponding bit. Auxiliary fault inputs to the CPU are tied to 0.</description>
          <addressOffset>3388</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IMPDEF</name>
              <description>IMPDEF</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_PFR0</name>
          <description>Processor Feature 0</description>
          <addressOffset>3392</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000030</resetValue>
          <fields>
            <field>
              <name>STATE1</name>
              <description>STATE1</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>STATE0</name>
              <description>STATE0</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_PFR1</name>
          <description>Processor Feature 1</description>
          <addressOffset>3396</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000200</resetValue>
          <fields>
            <field>
              <name>MICROCONTROLLER_PROGRAMMERS_MODEL</name>
              <description>MICROCONTROLLER_PROGRAMMERS_MODEL</description>
              <bitRange>[11:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_DFR0</name>
          <description>Debug Feature 0
          his register provides a high level view of the debug system. Further details are provided in the debug infrastructure itself.</description>
          <addressOffset>3400</addressOffset>
          <access>read-only</access>
          <resetValue>0x00100000</resetValue>
          <fields>
            <field>
              <name>MICROCONTROLLER_DEBUG_MODEL</name>
              <description>MICROCONTROLLER_DEBUG_MODEL</description>
              <bitRange>[23:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_AFR0</name>
          <description>Auxiliary Feature 0
          his register provides some freedom for implementation defined features to be registered. Not used in Cortex-M.</description>
          <addressOffset>3404</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>ID_MMFR0</name>
          <description>Memory Model Feature 0
          eneral information on the memory model and memory management support.</description>
          <addressOffset>3408</addressOffset>
          <access>read-only</access>
          <resetValue>0x00100030</resetValue>
        </register>
        <register>
          <name>ID_MMFR1</name>
          <description>Memory Model Feature 1
          eneral information on the memory model and memory management support.</description>
          <addressOffset>3412</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>ID_MMFR2</name>
          <description>Memory Model Feature 2
          eneral information on the memory model and memory management support.</description>
          <addressOffset>3416</addressOffset>
          <access>read-only</access>
          <resetValue>0x01000000</resetValue>
          <fields>
            <field>
              <name>WAIT_FOR_INTERRUPT_STALLING</name>
              <description>WAIT_FOR_INTERRUPT_STALLING</description>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ID_MMFR3</name>
          <description>Memory Model Feature 3
          eneral information on the memory model and memory management support.</description>
          <addressOffset>3420</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>ID_ISAR0</name>
          <description>ISA Feature 0
          nformation on the instruction set attributes register</description>
          <addressOffset>3424</addressOffset>
          <access>read-only</access>
          <resetValue>0x01141110</resetValue>
        </register>
        <register>
          <name>ID_ISAR1</name>
          <description>ISA Feature 1
          nformation on the instruction set attributes register</description>
          <addressOffset>3428</addressOffset>
          <access>read-only</access>
          <resetValue>0x02112000</resetValue>
        </register>
        <register>
          <name>ID_ISAR2</name>
          <description>ISA Feature 2
          nformation on the instruction set attributes register</description>
          <addressOffset>3432</addressOffset>
          <access>read-only</access>
          <resetValue>0x21232231</resetValue>
        </register>
        <register>
          <name>ID_ISAR3</name>
          <description>ISA Feature 3
          nformation on the instruction set attributes register</description>
          <addressOffset>3436</addressOffset>
          <access>read-only</access>
          <resetValue>0x01111131</resetValue>
        </register>
        <register>
          <name>ID_ISAR4</name>
          <description>ISA Feature 4
          nformation on the instruction set attributes register</description>
          <addressOffset>3440</addressOffset>
          <access>read-only</access>
          <resetValue>0x01310102</resetValue>
        </register>
        <register>
          <name>CPACR</name>
          <description>Coprocessor Access Control
          his register specifies the access privileges for coprocessors.</description>
          <addressOffset>3464</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>MPU_TYPE</name>
          <description>MPU Type
          his register indicates many regions the MPU supports.</description>
          <addressOffset>3472</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000800</resetValue>
          <fields>
            <field>
              <name>IREGION</name>
              <description>IREGION</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>DREGION</name>
              <description>DREGION</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>SEPARATE</name>
              <description>SEPARATE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_CTRL</name>
          <description>MPU Control
          his register is used to enable the MPU, enable the default memory map (background region), and enable the MPU when in Hard Fault, Non-maskable Interrupt (NMI), and FAULTMASK escalated handlers. When the MPU is enabled, at least one region of the memory map must be enabled for the MPU to function unless the PRIVDEFENA bit is set. If the PRIVDEFENA bit is set and no regions are enabled, then only privileged code can operate. When the MPU is disabled, the default address map is used, as if no MPU is present. When the MPU is enabled, only the system partition and vector table loads are always accessible. Other areas are accessible based on regions and whether PRIVDEFENA is enabled. Unless HFNMIENA is set, the MPU is not enabled when the exception priority is -1 or -2. These priorities are only possible when in Hard fault, NMI, or when FAULTMASK is enabled. The HFNMIENA bit enables the MPU when operating with these two priorities.</description>
          <addressOffset>3476</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIVDEFENA</name>
              <description>PRIVDEFENA</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HFNMIENA</name>
              <description>HFNMIENA</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ENABLE</name>
              <description>ENABLE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_RNR</name>
          <description>MPU Region Number
          his register is used to select which protection region is accessed. The following write to  MPU_RASR or MPU_RBAR configures the characteristics of the protection region that is selected by this register.</description>
          <addressOffset>3480</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REGION</name>
              <description>REGION</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_RBAR</name>
          <description>MPU Region Base Address
          his register writes the base address of a region. It also contains a REGION field that can be used to override MPU_RNR.REGION, if the VALID bit is set. This register sets the base for the region. It is aligned by the size. So, a 64-KB sized region must be aligned on a multiple of 64KB, for example, 0x00010000 or 0x00020000. The region always reads back as the current MPU region number. VALID always reads back as 0. Writing VALID = 1 and REGION = n changes the region number to n. This is a short-hand way to write the MPU_RNR. This register is unpredictable if accessed other than as a word.</description>
          <addressOffset>3484</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDR</name>
              <description>ADDR</description>
              <bitRange>[31:5]</bitRange>
            </field>
            <field>
              <name>VALID</name>
              <description>VALID</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>REGION</name>
              <description>REGION</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
