tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>MPU_RASR</name>
          <description>MPU Region Attribute and Size
          his register controls the MPU access permissions. The register is made up of two part registers, each of halfword size. These can be accessed using the halfword size, or they can both be simultaneously accessed using a word operation. The sub-region disable bits are not supported for region sizes of 32 bytes, 64 bytes, and 128 bytes. When these region sizes are used, the subregion disable bits must be programmed as 0.</description>
          <addressOffset>3488</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XN</name>
              <description>XN</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>AP</name>
              <description>AP</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>TEX</name>
              <description>TEX</description>
              <bitRange>[21:19]</bitRange>
            </field>
            <field>
              <name>S</name>
              <description>S</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>C</name>
              <description>C</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>B</name>
              <description>B</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SRD</name>
              <description>SRD</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>SIZE</name>
              <description>SIZE</description>
              <bitRange>[5:1]</bitRange>
            </field>
            <field>
              <name>ENABLE</name>
              <description>ENABLE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_RBAR_A1</name>
          <description>MPU Alias 1 Region Base Address
          lias for MPU_RBAR</description>
          <addressOffset>3492</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MPU_RBAR_A1</name>
              <description>MPU_RBAR_A1</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_RASR_A1</name>
          <description>MPU Alias 1 Region Attribute and Size
          lias for MPU_RASR</description>
          <addressOffset>3496</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MPU_RASR_A1</name>
              <description>MPU_RASR_A1</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_RBAR_A2</name>
          <description>MPU Alias 2 Region Base Address
          lias for MPU_RBAR</description>
          <addressOffset>3500</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MPU_RBAR_A2</name>
              <description>MPU_RBAR_A2</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_RASR_A2</name>
          <description>MPU Alias 2 Region Attribute and Size
          lias for MPU_RASR</description>
          <addressOffset>3504</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MPU_RASR_A2</name>
              <description>MPU_RASR_A2</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_RBAR_A3</name>
          <description>MPU Alias 3 Region Base Address
          lias for MPU_RBAR</description>
          <addressOffset>3508</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MPU_RBAR_A3</name>
              <description>MPU_RBAR_A3</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MPU_RASR_A3</name>
          <description>MPU Alias 3 Region Attribute and Size
          lias for MPU_RASR</description>
          <addressOffset>3512</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MPU_RASR_A3</name>
              <description>MPU_RASR_A3</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHCSR</name>
          <description>Debug Halting Control and Status
          he purpose of this register is to provide status information about the state of the processor, enable core debug, halt and step the processor. For writes, 0xA05F must be written to higher half-word of this register, otherwise the write operation is ignored and no bits are written into the register. If not enabled for Halting mode, C_DEBUGEN = 1, all other fields are disabled. This register is not reset on a core reset. It is reset by a power-on reset. However, C_HALT always clears on a core reset. To halt on a reset, the following bits must be enabled: DEMCR.VC_CORERESET and C_DEBUGEN. Note that writes to this register in any size other than word are unpredictable. It is acceptable to read in any size, and it can be used to avoid or intentionally change a sticky bit.

          ehavior of the system when writing to this register while CPU is halted (i.e. C_DEBUGEN = 1 and S_HALT= 1):
          _HALT=0, C_STEP=0, C_MASKINTS=0               Exit Debug state and start instruction execution. Exceptions activate according to the exception configuration rules.
          _HALT=0, C_STEP=0, C_MASKINTS=1               Exit Debug state and start instruction execution. PendSV, SysTick and external configurable interrupts are disabled, otherwise exceptions activate according to standard configuration rules.
          _HALT=0, C_STEP=1, C_MASKINTS=0               Exit Debug state, step an instruction and halt. Exceptions activate according to the exception configuration rules.
          _HALT=0, C_STEP=1, C_MASKINTS=1               Exit Debug state, step an instruction and halt. PendSV, SysTick and external configurable interrupts are disabled, otherwise exceptions activate according to standard configuration rules.
          _HALT=1, C_STEP=x, C_MASKINTS=x               Remain in Debug state</description>
          <addressOffset>3568</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S_RESET_ST</name>
              <description>S_RESET_ST</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>S_RETIRE_ST</name>
              <description>S_RETIRE_ST</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>S_LOCKUP</name>
              <description>S_LOCKUP</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>S_SLEEP</name>
              <description>S_SLEEP</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>S_HALT</name>
              <description>S_HALT</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>S_REGRDY</name>
              <description>S_REGRDY</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>C_SNAPSTALL</name>
              <description>C_SNAPSTALL</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>C_MASKINTS</name>
              <description>C_MASKINTS</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>C_STEP</name>
              <description>C_STEP</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>C_HALT</name>
              <description>C_HALT</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>C_DEBUGEN</name>
              <description>C_DEBUGEN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRSR</name>
          <description>Deubg Core Register Selector
          he purpose of this register is to select the processor register to transfer data to or from. This write-only register generates a handshake to the core to transfer data to or from Debug Core Register Data Register and the selected register. Until this core transaction is complete, DHCSR.S_REGRDY is 0. Note that writes to this register in any size but word are Unpredictable. 
          ote that PSR registers are fully accessible this way, whereas some read as 0 when using MRS instructions. Note that all bits can be written, but some combinations cause a fault when execution is resumed.</description>
          <addressOffset>3572</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REGWNR</name>
              <description>REGWNR</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>REGSEL</name>
              <description>REGSEL</description>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCRDR</name>
          <description>Debug Core Register Data</description>
          <addressOffset>3576</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DCRDR</name>
              <description>DCRDR</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DEMCR</name>
          <description>Debug Exception and Monitor Control
          he purpose of this register is vector catching and debug monitor control.  This register manages exception behavior under debug. Vector catching is only available to halting debug. The upper halfword is for monitor controls and the lower halfword is for halting exception support. This register is not reset on a system reset. This register is reset by a power-on reset. The fields MON_EN, MON_PEND, MON_STEP and MON_REQ are always cleared on a core reset. The debug monitor is enabled by software in the reset handler or later, or by the **AHB-AP** port. Vector catching is semi-synchronous. When a matching event is seen, a Halt is requested. Because the processor can only halt on an instruction boundary, it must wait until the next instruction boundary. As a result, it stops on the first instruction of the exception handler. However, two special cases exist when a vector catch has triggered: 1. If a fault is taken during a vector read or stack push error the halt occurs on the corresponding fault handler for the vector error or stack push. 2. If a late arriving interrupt detected during a vector read or stack push error it is not taken. That is, an implementation that supports the late arrival optimization must suppress it in this case.</description>
          <addressOffset>3580</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRCENA</name>
              <description>TRCENA</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>MON_REQ</name>
              <description>MON_REQ</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>MON_STEP</name>
              <description>MON_STEP</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>MON_PEND</name>
              <description>MON_PEND</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>MON_EN</name>
              <description>MON_EN</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>VC_HARDERR</name>
              <description>VC_HARDERR</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>VC_INTERR</name>
              <description>VC_INTERR</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>VC_BUSERR</name>
              <description>VC_BUSERR</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>VC_STATERR</name>
              <description>VC_STATERR</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>VC_CHKERR</name>
              <description>VC_CHKERR</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>VC_NOCPERR</name>
              <description>VC_NOCPERR</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>VC_MMERR</name>
              <description>VC_MMERR</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>VC_CORERESET</name>
              <description>VC_CORERESET</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STIR</name>
          <description>Software Trigger Interrupt</description>
          <addressOffset>3840</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTID</name>
              <description>INTID</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FPCCR</name>
          <description>Floating Point Context Control
          his register holds control data for the floating-point unit. Accessible only by privileged software.</description>
          <addressOffset>3892</addressOffset>
          <access>read-write</access>
          <resetValue>0xc0000000</resetValue>
          <fields>
            <field>
              <name>ASPEN</name>
              <description>ASPEN</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>LSPEN</name>
              <description>LSPEN</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>MONRDY</name>
              <description>MONRDY</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>BFRDY</name>
              <description>BFRDY</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>MMRDY</name>
              <description>MMRDY</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>HFRDY</name>
              <description>HFRDY</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>THREAD</name>
              <description>THREAD</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USER</name>
              <description>USER</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LSPACT</name>
              <description>LSPACT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FPCAR</name>
          <description>Floating-Point Context Address 
          his register holds the location of the unpopulated floating-point register space allocated on an exception stack frame.</description>
          <addressOffset>3896</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDRESS</name>
              <description>ADDRESS</description>
              <bitRange>[31:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FPDSCR</name>
          <description>Floating Point Default Status Control
          his register holds the default values for the floating-point status control data that the processor assigns to the FPSCR when it creates a new floating-point context. Accessible only by privileged software.</description>
          <addressOffset>3900</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AHP</name>
              <description>AHP</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>DN</name>
              <description>DN</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>FZ</name>
              <description>FZ</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>RMODE</name>
              <description>RMODE</description>
              <bitRange>[23:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MVFR0</name>
          <description>Media and FP Feature 0
          escribes the features provided by the Floating-point extension.</description>
          <addressOffset>3904</addressOffset>
          <access>read-only</access>
          <resetValue>0x10110021</resetValue>
          <fields>
            <field>
              <name>FP_ROUNDING_MODES</name>
              <description>FP_ROUNDING_MODES</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>SHORT_VECTORS</name>
              <description>SHORT_VECTORS</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>SQUARE_ROOT</name>
              <description>SQUARE_ROOT</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>DIVIDE</name>
              <description>DIVIDE</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>FP_EXCEPTION_TRAPPING</name>
              <description>FP_EXCEPTION_TRAPPING</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>DOUBLE_PRECISION</name>
              <description>DOUBLE_PRECISION</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>SINGLE_PRECISION</name>
              <description>SINGLE_PRECISION</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>A_SIMD</name>
              <description>A_SIMD</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MVFR1</name>
          <description>Media and FP Feature 1
          escribes the features provided by the Floating-point extension.</description>
          <addressOffset>3908</addressOffset>
          <access>read-only</access>
          <resetValue>0x11000011</resetValue>
          <fields>
            <field>
              <name>FP_FUSED_MAC</name>
              <description>FP_FUSED_MAC</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>FP_HPFP</name>
              <description>FP_HPFP</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>D_NAN_MODE</name>
              <description>D_NAN_MODE</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>FTZ_MODE</name>
              <description>FTZ_MODE</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
