tyropyro/CC1312tester/cc1312/cpu-mmap.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU_TIPROP</name>
      <description>Cortex-M's TI proprietary registers</description>
      <baseAddress>0xe00fe000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TRACECLKMUX</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4088</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRACECLK_N_SWV</name>
              <description>TRACECLK_N_SWV</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CPU_TPIU</name>
      <description>Cortex-M's Trace Port Interface Unit (TPIU)</description>
      <baseAddress>0xe0040000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SSPSR</name>
          <description>Supported Sync Port Sizes
          his register represents a single port size that is supported on the device, that is, 4, 2 or 1. This is to ensure that tools do not attempt to select a port width that an attached TPA cannot capture.</description>
          <addressOffset>0</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000000b</resetValue>
          <fields>
            <field>
              <name>FOUR</name>
              <description>FOUR</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>THREE</name>
              <description>THREE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TWO</name>
              <description>TWO</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ONE</name>
              <description>ONE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CSPSR</name>
          <description>Current Sync Port Size
          his register has the same format as SSPSR but only one bit can be set, and all others must be zero. Writing values with more than one bit set, or setting a bit that is not indicated as supported can cause Unpredictable behavior. On reset this defaults to the smallest possible port size, 1 bit.</description>
          <addressOffset>4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>FOUR</name>
              <description>FOUR</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>THREE</name>
              <description>THREE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TWO</name>
              <description>TWO</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ONE</name>
              <description>ONE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACPR</name>
          <description>Async Clock Prescaler
          his register scales the baud rate of the asynchronous output.</description>
          <addressOffset>16</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRESCALER</name>
              <description>PRESCALER</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SPPR</name>
          <description>Selected Pin Protocol
          his register selects the protocol to be used for trace output. 
          ote: If this register is changed while trace data is being output, data corruption occurs.</description>
          <addressOffset>240</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>PROTOCOL</name>
              <description>PROTOCOL</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FFSR</name>
          <description>Formatter and Flush Status</description>
          <addressOffset>768</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>FTNONSTOP</name>
              <description>FTNONSTOP</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FFCR</name>
          <description>Formatter and Flush Control
          hen one of the two single wire output (SWO) modes is selected, ENFCONT enables the formatter to be bypassed. If the formatter is bypassed, only the ITM/DWT trace source (ATDATA2) passes through. The TPIU accepts and discards data that is presented on the ETM port (ATDATA1). This function is intended to be used when it is necessary to connect a device containing an ETM to a trace capture device that is only able to capture Serial Wire Output (SWO) data. Enabling or disabling the formatter causes momentary data corruption. 
          ote: If the selected pin protocol register (SPPR.PROTOCOL) is set to 0x00 (TracePort mode), this register always reads 0x102, because the formatter is automatically enabled. If one of the serial wire modes is then selected, the register reverts to its previously programmed value.</description>
          <addressOffset>772</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000102</resetValue>
          <fields>
            <field>
              <name>TRIGIN</name>
              <description>TRIGIN</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ENFCONT</name>
              <description>ENFCONT</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSCR</name>
          <description>Formatter Synchronization Counter</description>
          <addressOffset>776</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FSCR</name>
              <description>FSCR</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLAIMMASK</name>
          <description>Claim Tag Mask</description>
          <addressOffset>4000</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000000f</resetValue>
          <fields>
            <field>
              <name>CLAIMMASK</name>
              <description>CLAIMMASK</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLAIMSET</name>
          <description>Claim Tag Set</description>
          <addressOffset>4000</addressOffset>
          <access>write-only</access>
          <resetValue>0x0000000f</resetValue>
          <fields>
            <field>
              <name>CLAIMSET</name>
              <description>CLAIMSET</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLAIMTAG</name>
          <description>Current Claim Tag</description>
          <addressOffset>4004</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLAIMTAG</name>
              <description>CLAIMTAG</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLAIMCLR</name>
          <description>Claim Tag Clear</description>
          <addressOffset>4004</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLAIMCLR</name>
              <description>CLAIMCLR</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVID</name>
          <description>Device ID</description>
          <addressOffset>4040</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000ca0</resetValue>
          <fields>
            <field>
              <name>DEVID</name>
              <description>DEVID</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
