tyropyro/CC1312tester/cc1312/cpu-mmap.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FCFG1</name>
      <description>Factory configuration area (FCFG1)</description>
      <baseAddress>0x50001000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MISC_CONF_1</name>
          <description>Misc configurations</description>
          <addressOffset>160</addressOffset>
          <access>read-only</access>
          <resetValue>0xffffff00</resetValue>
          <fields>
            <field>
              <name>DEVICE_MINOR_REV</name>
              <description>DEVICE_MINOR_REV</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC_CONF_2</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>164</addressOffset>
          <access>read-only</access>
          <resetValue>0xffffff00</resetValue>
          <fields>
            <field>
              <name>HPOSC_COMP_P3</name>
              <description>HPOSC_COMP_P3</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_CC26_FE</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>196</addressOffset>
          <access>read-only</access>
          <resetValue>0x70000f00</resetValue>
          <fields>
            <field>
              <name>IFAMP_IB</name>
              <description>IFAMP_IB</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>LNA_IB</name>
              <description>LNA_IB</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>IFAMP_TRIM</name>
              <description>IFAMP_TRIM</description>
              <bitRange>[23:19]</bitRange>
            </field>
            <field>
              <name>CTL_PA0_TRIM</name>
              <description>CTL_PA0_TRIM</description>
              <bitRange>[18:14]</bitRange>
            </field>
            <field>
              <name>PATRIMCOMPLETE_N</name>
              <description>PATRIMCOMPLETE_N</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RSSITRIMCOMPLETE_N</name>
              <description>RSSITRIMCOMPLETE_N</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RSSI_OFFSET</name>
              <description>RSSI_OFFSET</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_CC13_FE</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>200</addressOffset>
          <access>read-only</access>
          <resetValue>0x70000f00</resetValue>
          <fields>
            <field>
              <name>IFAMP_IB</name>
              <description>IFAMP_IB</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>LNA_IB</name>
              <description>LNA_IB</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>IFAMP_TRIM</name>
              <description>IFAMP_TRIM</description>
              <bitRange>[23:19]</bitRange>
            </field>
            <field>
              <name>CTL_PA0_TRIM</name>
              <description>CTL_PA0_TRIM</description>
              <bitRange>[18:14]</bitRange>
            </field>
            <field>
              <name>PATRIMCOMPLETE_N</name>
              <description>PATRIMCOMPLETE_N</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RSSITRIMCOMPLETE_N</name>
              <description>RSSITRIMCOMPLETE_N</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RSSI_OFFSET</name>
              <description>RSSI_OFFSET</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_RF_COMMON</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>204</addressOffset>
          <access>read-only</access>
          <resetValue>0x01c0014d</resetValue>
          <fields>
            <field>
              <name>DISABLE_CORNER_CAP</name>
              <description>DISABLE_CORNER_CAP</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>SLDO_TRIM_OUTPUT</name>
              <description>SLDO_TRIM_OUTPUT</description>
              <bitRange>[30:25]</bitRange>
            </field>
            <field>
              <name>PA20DBMTRIMCOMPLETE_N</name>
              <description>PA20DBMTRIMCOMPLETE_N</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CTL_PA_20DBM_TRIM</name>
              <description>CTL_PA_20DBM_TRIM</description>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>RFLDO_TRIM_OUTPUT</name>
              <description>RFLDO_TRIM_OUTPUT</description>
              <bitRange>[15:9]</bitRange>
            </field>
            <field>
              <name>QUANTCTLTHRES</name>
              <description>QUANTCTLTHRES</description>
              <bitRange>[8:6]</bitRange>
            </field>
            <field>
              <name>DACTRIM</name>
              <description>DACTRIM</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV2_CC26_2G4</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>208</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001f</resetValue>
          <fields>
            <field>
              <name>MIN_ALLOWED_RTRIM</name>
              <description>MIN_ALLOWED_RTRIM</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>RFC_MDM_DEMIQMC0</description>
              <bitRange>[27:12]</bitRange>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>LDOVCO_TRIM_OUTPUT</description>
              <bitRange>[11:6]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</name>
              <description>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV2_CC13_2G4</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>212</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001f</resetValue>
          <fields>
            <field>
              <name>MIN_ALLOWED_RTRIM</name>
              <description>MIN_ALLOWED_RTRIM</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>RFC_MDM_DEMIQMC0</description>
              <bitRange>[27:12]</bitRange>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>LDOVCO_TRIM_OUTPUT</description>
              <bitRange>[11:6]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</name>
              <description>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV2_CC26_1G</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>216</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001f</resetValue>
          <fields>
            <field>
              <name>MIN_ALLOWED_RTRIM</name>
              <description>MIN_ALLOWED_RTRIM</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>RFC_MDM_DEMIQMC0</description>
              <bitRange>[27:12]</bitRange>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>LDOVCO_TRIM_OUTPUT</description>
              <bitRange>[11:6]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</name>
              <description>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV2_CC13_1G</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>220</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001f</resetValue>
          <fields>
            <field>
              <name>MIN_ALLOWED_RTRIM</name>
              <description>MIN_ALLOWED_RTRIM</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>RFC_MDM_DEMIQMC0</description>
              <bitRange>[27:12]</bitRange>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>LDOVCO_TRIM_OUTPUT</description>
              <bitRange>[11:6]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</name>
              <description>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV4_CC26</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>224</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001f</resetValue>
          <fields>
            <field>
              <name>MIN_ALLOWED_RTRIM</name>
              <description>MIN_ALLOWED_RTRIM</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>RFC_MDM_DEMIQMC0</description>
              <bitRange>[27:12]</bitRange>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>LDOVCO_TRIM_OUTPUT</description>
              <bitRange>[11:6]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</name>
              <description>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV4_CC13</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>228</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001f</resetValue>
          <fields>
            <field>
              <name>MIN_ALLOWED_RTRIM</name>
              <description>MIN_ALLOWED_RTRIM</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>RFC_MDM_DEMIQMC0</description>
              <bitRange>[27:12]</bitRange>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>LDOVCO_TRIM_OUTPUT</description>
              <bitRange>[11:6]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</name>
              <description>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV5</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>232</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001f</resetValue>
          <fields>
            <field>
              <name>MIN_ALLOWED_RTRIM</name>
              <description>MIN_ALLOWED_RTRIM</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>RFC_MDM_DEMIQMC0</description>
              <bitRange>[27:12]</bitRange>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>LDOVCO_TRIM_OUTPUT</description>
              <bitRange>[11:6]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</name>
              <description>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV6_CC26</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>236</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001f</resetValue>
          <fields>
            <field>
              <name>MIN_ALLOWED_RTRIM</name>
              <description>MIN_ALLOWED_RTRIM</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>RFC_MDM_DEMIQMC0</description>
              <bitRange>[27:12]</bitRange>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>LDOVCO_TRIM_OUTPUT</description>
              <bitRange>[11:6]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</name>
              <description>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV6_CC13</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>240</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001f</resetValue>
          <fields>
            <field>
              <name>MIN_ALLOWED_RTRIM</name>
              <description>MIN_ALLOWED_RTRIM</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>RFC_MDM_DEMIQMC0</description>
              <bitRange>[27:12]</bitRange>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>LDOVCO_TRIM_OUTPUT</description>
              <bitRange>[11:6]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</name>
              <description>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV10</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>244</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001f</resetValue>
          <fields>
            <field>
              <name>MIN_ALLOWED_RTRIM</name>
              <description>MIN_ALLOWED_RTRIM</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>RFC_MDM_DEMIQMC0</description>
              <bitRange>[27:12]</bitRange>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>LDOVCO_TRIM_OUTPUT</description>
              <bitRange>[11:6]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</name>
              <description>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV12_CC26</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>248</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001f</resetValue>
          <fields>
            <field>
              <name>MIN_ALLOWED_RTRIM</name>
              <description>MIN_ALLOWED_RTRIM</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>RFC_MDM_DEMIQMC0</description>
              <bitRange>[27:12]</bitRange>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>LDOVCO_TRIM_OUTPUT</description>
              <bitRange>[11:6]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</name>
              <description>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV12_CC13</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>252</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001f</resetValue>
          <fields>
            <field>
              <name>MIN_ALLOWED_RTRIM</name>
              <description>MIN_ALLOWED_RTRIM</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>RFC_MDM_DEMIQMC0</description>
              <bitRange>[27:12]</bitRange>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>LDOVCO_TRIM_OUTPUT</description>
              <bitRange>[11:6]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</name>
              <description>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV15</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>256</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001f</resetValue>
          <fields>
            <field>
              <name>MIN_ALLOWED_RTRIM</name>
              <description>MIN_ALLOWED_RTRIM</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>RFC_MDM_DEMIQMC0</description>
              <bitRange>[27:12]</bitRange>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>LDOVCO_TRIM_OUTPUT</description>
              <bitRange>[11:6]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</name>
              <description>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_SYNTH_DIV30</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>260</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001f</resetValue>
          <fields>
            <field>
              <name>MIN_ALLOWED_RTRIM</name>
              <description>MIN_ALLOWED_RTRIM</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0</name>
              <description>RFC_MDM_DEMIQMC0</description>
              <bitRange>[27:12]</bitRange>
            </field>
            <field>
              <name>LDOVCO_TRIM_OUTPUT</name>
              <description>LDOVCO_TRIM_OUTPUT</description>
              <bitRange>[11:6]</bitRange>
            </field>
            <field>
              <name>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</name>
              <description>RFC_MDM_DEMIQMC0_TRIMCOMPLETE_N</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_NUMBER</name>
          <description>Flash information</description>
          <addressOffset>356</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LOT_NUMBER</name>
              <description>LOT_NUMBER</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_COORDINATE</name>
          <description>Flash information</description>
          <addressOffset>364</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>XCOORDINATE</name>
              <description>XCOORDINATE</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>YCOORDINATE</name>
              <description>YCOORDINATE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_E_P</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>368</addressOffset>
          <access>read-only</access>
          <resetValue>0x4c644c64</resetValue>
          <fields>
            <field>
              <name>PSU</name>
              <description>PSU</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>ESU</name>
              <description>ESU</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>PVSU</name>
              <description>PVSU</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>EVSU</name>
              <description>EVSU</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
