tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>FLASH_C_E_P_R</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>372</addressOffset>
          <access>read-only</access>
          <resetValue>0x0a0a2000</resetValue>
          <fields>
            <field>
              <name>RVSU</name>
              <description>RVSU</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>PV_ACCESS</name>
              <description>PV_ACCESS</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>A_EXEZ_SETUP</name>
              <description>A_EXEZ_SETUP</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>CVSU</name>
              <description>CVSU</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_P_R_PV</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>376</addressOffset>
          <access>read-only</access>
          <resetValue>0x02c10200</resetValue>
          <fields>
            <field>
              <name>PH</name>
              <description>PH</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>RH</name>
              <description>RH</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>PVH</name>
              <description>PVH</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>PVH2</name>
              <description>PVH2</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_EH_SEQ</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>380</addressOffset>
          <access>read-only</access>
          <resetValue>0x0200f000</resetValue>
          <fields>
            <field>
              <name>EH</name>
              <description>EH</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>SEQ</name>
              <description>SEQ</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>VSTAT</name>
              <description>VSTAT</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>SM_FREQUENCY</name>
              <description>SM_FREQUENCY</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_VHV_E</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>384</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>VHV_E_START</name>
              <description>VHV_E_START</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>VHV_E_STEP_HIGHT</name>
              <description>VHV_E_STEP_HIGHT</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_PP</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>388</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000014</resetValue>
          <fields>
            <field>
              <name>PUMP_SU</name>
              <description>PUMP_SU</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>TRIM3P4</name>
              <description>TRIM3P4</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>MAX_PP</name>
              <description>MAX_PP</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_PROG_EP</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>392</addressOffset>
          <access>read-only</access>
          <resetValue>0x0fa00010</resetValue>
          <fields>
            <field>
              <name>MAX_EP</name>
              <description>MAX_EP</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>PROGRAM_PW</name>
              <description>PROGRAM_PW</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_ERA_PW</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>396</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000fa0</resetValue>
          <fields>
            <field>
              <name>ERASE_PW</name>
              <description>ERASE_PW</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_VHV</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>400</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>TRIM13_P</name>
              <description>TRIM13_P</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>VHV_P</name>
              <description>VHV_P</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>TRIM13_E</name>
              <description>TRIM13_E</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>VHV_E</name>
              <description>VHV_E</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_VHV_PV</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>404</addressOffset>
          <access>read-only</access>
          <resetValue>0x00080001</resetValue>
          <fields>
            <field>
              <name>TRIM13_PV</name>
              <description>TRIM13_PV</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>VHV_PV</name>
              <description>VHV_PV</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>VCG2P5</name>
              <description>VCG2P5</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>VINH</name>
              <description>VINH</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_V</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>408</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VSL_P</name>
              <description>VSL_P</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>VWL_P</name>
              <description>VWL_P</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>V_READ</name>
              <description>V_READ</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>TRIM0P8</name>
              <description>TRIM0P8</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>USER_ID</name>
          <description>User Identification.
          eading this register and the FCFG1:ICEPICK_DEVICE_ID register is the only supported way of identifying a device.
          he value of this register will be written to AON_PMCTL:JTAGUSERCODE by boot FW while in safezone.</description>
          <addressOffset>660</addressOffset>
          <access>read-only</access>
          <resetValue>0x30000000</resetValue>
          <fields>
            <field>
              <name>PG_REV</name>
              <description>PG_REV</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>VER</name>
              <description>VER</description>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>PA</name>
              <description>PA</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CC13</name>
              <description>CC13</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>SEQUENCE</name>
              <description>SEQUENCE</description>
              <bitRange>[22:19]</bitRange>
            </field>
            <field>
              <name>PKG</name>
              <description>PKG</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>PROTOCOL</name>
              <description>PROTOCOL</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OTP_DATA3</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>688</addressOffset>
          <access>read-only</access>
          <resetValue>0x00110003</resetValue>
          <fields>
            <field>
              <name>EC_STEP_SIZE</name>
              <description>EC_STEP_SIZE</description>
              <bitRange>[31:23]</bitRange>
            </field>
            <field>
              <name>DO_PRECOND</name>
              <description>DO_PRECOND</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>MAX_EC_LEVEL</name>
              <description>MAX_EC_LEVEL</description>
              <bitRange>[21:18]</bitRange>
            </field>
            <field>
              <name>TRIM_1P7</name>
              <description>TRIM_1P7</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>FLASH_SIZE</name>
              <description>FLASH_SIZE</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>WAIT_SYSCODE</name>
              <description>WAIT_SYSCODE</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANA2_TRIM</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>692</addressOffset>
          <access>read-only</access>
          <resetValue>0x8240787f</resetValue>
          <fields>
            <field>
              <name>RCOSCHFCTRIMFRACT_EN</name>
              <description>RCOSCHFCTRIMFRACT_EN</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>RCOSCHFCTRIMFRACT</name>
              <description>RCOSCHFCTRIMFRACT</description>
              <bitRange>[30:26]</bitRange>
            </field>
            <field>
              <name>SET_RCOSC_HF_FINE_RESISTOR</name>
              <description>SET_RCOSC_HF_FINE_RESISTOR</description>
              <bitRange>[24:23]</bitRange>
            </field>
            <field>
              <name>ATESTLF_UDIGLDO_IBIAS_TRIM</name>
              <description>ATESTLF_UDIGLDO_IBIAS_TRIM</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>NANOAMP_RES_TRIM</name>
              <description>NANOAMP_RES_TRIM</description>
              <bitRange>[21:15]</bitRange>
            </field>
            <field>
              <name>DITHER_EN</name>
              <description>DITHER_EN</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DCDC_IPEAK</name>
              <description>DCDC_IPEAK</description>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>DEAD_TIME_TRIM</name>
              <description>DEAD_TIME_TRIM</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>DCDC_LOW_EN_SEL</name>
              <description>DCDC_LOW_EN_SEL</description>
              <bitRange>[5:3]</bitRange>
            </field>
            <field>
              <name>DCDC_HIGH_EN_SEL</name>
              <description>DCDC_HIGH_EN_SEL</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LDO_TRIM</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>696</addressOffset>
          <access>read-only</access>
          <resetValue>0xe0f8e0fb</resetValue>
          <fields>
            <field>
              <name>VDDR_TRIM_SLEEP</name>
              <description>VDDR_TRIM_SLEEP</description>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>GLDO_CURSRC</name>
              <description>GLDO_CURSRC</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>ITRIM_DIGLDO_LOAD</name>
              <description>ITRIM_DIGLDO_LOAD</description>
              <bitRange>[12:11]</bitRange>
            </field>
            <field>
              <name>ITRIM_UDIGLDO</name>
              <description>ITRIM_UDIGLDO</description>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>VTRIM_DELTA</name>
              <description>VTRIM_DELTA</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_BLE_0</name>
          <description>MAC BLE Address 0</description>
          <addressOffset>744</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDR_0_31</name>
              <description>ADDR_0_31</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_BLE_1</name>
          <description>MAC BLE Address 1</description>
          <addressOffset>748</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDR_32_63</name>
              <description>ADDR_32_63</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_15_4_0</name>
          <description>MAC IEEE 802.15.4 Address 0</description>
          <addressOffset>752</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDR_0_31</name>
              <description>ADDR_0_31</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_15_4_1</name>
          <description>MAC IEEE 802.15.4 Address 1</description>
          <addressOffset>756</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDR_32_63</name>
              <description>ADDR_32_63</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OTP_DATA4</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>776</addressOffset>
          <access>read-only</access>
          <resetValue>0x98989f9f</resetValue>
          <fields>
            <field>
              <name>STANDBY_MODE_SEL_INT_WRT</name>
              <description>STANDBY_MODE_SEL_INT_WRT</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>STANDBY_PW_SEL_INT_WRT</name>
              <description>STANDBY_PW_SEL_INT_WRT</description>
              <bitRange>[30:29]</bitRange>
            </field>
            <field>
              <name>DIS_STANDBY_INT_WRT</name>
              <description>DIS_STANDBY_INT_WRT</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>DIS_IDLE_INT_WRT</name>
              <description>DIS_IDLE_INT_WRT</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>VIN_AT_X_INT_WRT</name>
              <description>VIN_AT_X_INT_WRT</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>STANDBY_MODE_SEL_EXT_WRT</name>
              <description>STANDBY_MODE_SEL_EXT_WRT</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>STANDBY_PW_SEL_EXT_WRT</name>
              <description>STANDBY_PW_SEL_EXT_WRT</description>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>DIS_STANDBY_EXT_WRT</name>
              <description>DIS_STANDBY_EXT_WRT</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>DIS_IDLE_EXT_WRT</name>
              <description>DIS_IDLE_EXT_WRT</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>VIN_AT_X_EXT_WRT</name>
              <description>VIN_AT_X_EXT_WRT</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>STANDBY_MODE_SEL_INT_RD</name>
              <description>STANDBY_MODE_SEL_INT_RD</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>STANDBY_PW_SEL_INT_RD</name>
              <description>STANDBY_PW_SEL_INT_RD</description>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>DIS_STANDBY_INT_RD</name>
              <description>DIS_STANDBY_INT_RD</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DIS_IDLE_INT_RD</name>
              <description>DIS_IDLE_INT_RD</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>VIN_AT_X_INT_RD</name>
              <description>VIN_AT_X_INT_RD</description>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>STANDBY_MODE_SEL_EXT_RD</name>
              <description>STANDBY_MODE_SEL_EXT_RD</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>STANDBY_PW_SEL_EXT_RD</name>
              <description>STANDBY_PW_SEL_EXT_RD</description>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>DIS_STANDBY_EXT_RD</name>
              <description>DIS_STANDBY_EXT_RD</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DIS_IDLE_EXT_RD</name>
              <description>DIS_IDLE_EXT_RD</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>VIN_AT_X_EXT_RD</name>
              <description>VIN_AT_X_EXT_RD</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC_TRIM</name>
          <description>Miscellaneous Trim  Parameters</description>
          <addressOffset>780</addressOffset>
          <access>read-only</access>
          <resetValue>0xfffe003b</resetValue>
          <fields>
            <field>
              <name>TRIM_RECHARGE_COMP_OFFSET</name>
              <description>TRIM_RECHARGE_COMP_OFFSET</description>
              <bitRange>[16:12]</bitRange>
            </field>
            <field>
              <name>TRIM_RECHARGE_COMP_REFLEVEL</name>
              <description>TRIM_RECHARGE_COMP_REFLEVEL</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>TEMPVSLOPE</name>
              <description>TEMPVSLOPE</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCOSC_HF_TEMPCOMP</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>784</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>FINE_RESISTOR</name>
              <description>FINE_RESISTOR</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>CTRIM</name>
              <description>CTRIM</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>CTRIMFRACT_QUAD</name>
              <description>CTRIMFRACT_QUAD</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CTRIMFRACT_SLOPE</name>
              <description>CTRIMFRACT_SLOPE</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
