tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>ICEPICK_DEVICE_ID</name>
          <description>IcePick Device Identification
          eading this register and the FCFG1:USER_ID register is the only supported way of identifying a device.</description>
          <addressOffset>792</addressOffset>
          <access>read-only</access>
          <resetValue>0x3bb4102f</resetValue>
          <fields>
            <field>
              <name>PG_REV</name>
              <description>PG_REV</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>WAFER_ID</name>
              <description>WAFER_ID</description>
              <bitRange>[27:12]</bitRange>
            </field>
            <field>
              <name>MANUFACTURER_ID</name>
              <description>MANUFACTURER_ID</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FCFG1_REVISION</name>
          <description>Factory Configuration (FCFG1) Revision</description>
          <addressOffset>796</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000028</resetValue>
          <fields>
            <field>
              <name>REV</name>
              <description>REV</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC_OTP_DATA</name>
          <description>Misc OTP Data</description>
          <addressOffset>800</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000cf00</resetValue>
          <fields>
            <field>
              <name>RCOSC_HF_ITUNE</name>
              <description>RCOSC_HF_ITUNE</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>RCOSC_HF_CRIM</name>
              <description>RCOSC_HF_CRIM</description>
              <bitRange>[27:20]</bitRange>
            </field>
            <field>
              <name>PER_M</name>
              <description>PER_M</description>
              <bitRange>[19:15]</bitRange>
            </field>
            <field>
              <name>PER_E</name>
              <description>PER_E</description>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>TEST_PROGRAM_REV</name>
              <description>TEST_PROGRAM_REV</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCONF</name>
          <description>IO Configuration</description>
          <addressOffset>836</addressOffset>
          <access>read-only</access>
          <resetValue>0xffffff00</resetValue>
          <fields>
            <field>
              <name>GPIO_CNT</name>
              <description>GPIO_CNT</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_IF_ADC</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>844</addressOffset>
          <access>read-only</access>
          <resetValue>0x3460f400</resetValue>
          <fields>
            <field>
              <name>FF2ADJ</name>
              <description>FF2ADJ</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>FF3ADJ</name>
              <description>FF3ADJ</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>INT3ADJ</name>
              <description>INT3ADJ</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>FF1ADJ</name>
              <description>FF1ADJ</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>AAFCAP</name>
              <description>AAFCAP</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>INT2ADJ</name>
              <description>INT2ADJ</description>
              <bitRange>[13:10]</bitRange>
            </field>
            <field>
              <name>IFDIGLDO_TRIM_OUTPUT</name>
              <description>IFDIGLDO_TRIM_OUTPUT</description>
              <bitRange>[9:5]</bitRange>
            </field>
            <field>
              <name>IFANALDO_TRIM_OUTPUT</name>
              <description>IFANALDO_TRIM_OUTPUT</description>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG_OSC_TOP</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>848</addressOffset>
          <access>read-only</access>
          <resetValue>0xdc07fc00</resetValue>
          <fields>
            <field>
              <name>XOSC_HF_ROW_Q12</name>
              <description>XOSC_HF_ROW_Q12</description>
              <bitRange>[29:26]</bitRange>
            </field>
            <field>
              <name>XOSC_HF_COLUMN_Q12</name>
              <description>XOSC_HF_COLUMN_Q12</description>
              <bitRange>[25:10]</bitRange>
            </field>
            <field>
              <name>RCOSCLF_CTUNE_TRIM</name>
              <description>RCOSCLF_CTUNE_TRIM</description>
              <bitRange>[9:2]</bitRange>
            </field>
            <field>
              <name>RCOSCLF_RTUNE_TRIM</name>
              <description>RCOSCLF_RTUNE_TRIM</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SOC_ADC_ABS_GAIN</name>
          <description>AUX_ADC Gain in Absolute Reference Mode</description>
          <addressOffset>860</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SOC_ADC_ABS_GAIN_TEMP1</name>
              <description>SOC_ADC_ABS_GAIN_TEMP1</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SOC_ADC_REL_GAIN</name>
          <description>AUX_ADC Gain in Relative Reference Mode</description>
          <addressOffset>864</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SOC_ADC_REL_GAIN_TEMP1</name>
              <description>SOC_ADC_REL_GAIN_TEMP1</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SOC_ADC_OFFSET_INT</name>
          <description>AUX_ADC Temperature Offsets in Absolute Reference Mode</description>
          <addressOffset>872</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SOC_ADC_REL_OFFSET_TEMP1</name>
              <description>SOC_ADC_REL_OFFSET_TEMP1</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>SOC_ADC_ABS_OFFSET_TEMP1</name>
              <description>SOC_ADC_ABS_OFFSET_TEMP1</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SOC_ADC_REF_TRIM_AND_OFFSET_EXT</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>876</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000c080</resetValue>
          <fields>
            <field>
              <name>SOC_ADC_REF_VOLTAGE_TRIM_TEMP1</name>
              <description>SOC_ADC_REF_VOLTAGE_TRIM_TEMP1</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AMPCOMP_TH1</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>880</addressOffset>
          <access>read-only</access>
          <resetValue>0xff7b828e</resetValue>
          <fields>
            <field>
              <name>HPMRAMP3_LTH</name>
              <description>HPMRAMP3_LTH</description>
              <bitRange>[23:18]</bitRange>
            </field>
            <field>
              <name>HPMRAMP3_HTH</name>
              <description>HPMRAMP3_HTH</description>
              <bitRange>[15:10]</bitRange>
            </field>
            <field>
              <name>IBIASCAP_LPTOHP_OL_CNT</name>
              <description>IBIASCAP_LPTOHP_OL_CNT</description>
              <bitRange>[9:6]</bitRange>
            </field>
            <field>
              <name>HPMRAMP1_TH</name>
              <description>HPMRAMP1_TH</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AMPCOMP_TH2</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>884</addressOffset>
          <access>read-only</access>
          <resetValue>0x6b8b0303</resetValue>
          <fields>
            <field>
              <name>LPMUPDATE_LTH</name>
              <description>LPMUPDATE_LTH</description>
              <bitRange>[31:26]</bitRange>
            </field>
            <field>
              <name>LPMUPDATE_HTM</name>
              <description>LPMUPDATE_HTM</description>
              <bitRange>[23:18]</bitRange>
            </field>
            <field>
              <name>ADC_COMP_AMPTH_LPM</name>
              <description>ADC_COMP_AMPTH_LPM</description>
              <bitRange>[15:10]</bitRange>
            </field>
            <field>
              <name>ADC_COMP_AMPTH_HPM</name>
              <description>ADC_COMP_AMPTH_HPM</description>
              <bitRange>[7:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AMPCOMP_CTRL1</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>888</addressOffset>
          <access>read-only</access>
          <resetValue>0xff483f47</resetValue>
          <fields>
            <field>
              <name>AMPCOMP_REQ_MODE</name>
              <description>AMPCOMP_REQ_MODE</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IBIAS_OFFSET</name>
              <description>IBIAS_OFFSET</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>IBIAS_INIT</name>
              <description>IBIAS_INIT</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>LPM_IBIAS_WAIT_CNT_FINAL</name>
              <description>LPM_IBIAS_WAIT_CNT_FINAL</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>CAP_STEP</name>
              <description>CAP_STEP</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>IBIASCAP_HPTOLP_OL_CNT</name>
              <description>IBIASCAP_HPTOLP_OL_CNT</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANABYPASS_VALUE2</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>892</addressOffset>
          <access>read-only</access>
          <resetValue>0xffffc3ff</resetValue>
          <fields>
            <field>
              <name>XOSC_HF_IBIASTHERM</name>
              <description>XOSC_HF_IBIASTHERM</description>
              <bitRange>[13:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VOLT_TRIM</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>904</addressOffset>
          <access>read-only</access>
          <resetValue>0xe0e0e0e0</resetValue>
          <fields>
            <field>
              <name>VDDR_TRIM_HH</name>
              <description>VDDR_TRIM_HH</description>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>VDDR_TRIM_H</name>
              <description>VDDR_TRIM_H</description>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>VDDR_TRIM_SLEEP_H</name>
              <description>VDDR_TRIM_SLEEP_H</description>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>TRIMBOD_H</name>
              <description>TRIMBOD_H</description>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSC_CONF</name>
          <description>OSC Configuration</description>
          <addressOffset>908</addressOffset>
          <access>read-only</access>
          <resetValue>0xf00900e6</resetValue>
          <fields>
            <field>
              <name>ADC_SH_VBUF_EN</name>
              <description>ADC_SH_VBUF_EN</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ADC_SH_MODE_EN</name>
              <description>ADC_SH_MODE_EN</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ATESTLF_RCOSCLF_IBIAS_TRIM</name>
              <description>ATESTLF_RCOSCLF_IBIAS_TRIM</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>XOSCLF_REGULATOR_TRIM</name>
              <description>XOSCLF_REGULATOR_TRIM</description>
              <bitRange>[26:25]</bitRange>
            </field>
            <field>
              <name>XOSCLF_CMIRRWR_RATIO</name>
              <description>XOSCLF_CMIRRWR_RATIO</description>
              <bitRange>[24:21]</bitRange>
            </field>
            <field>
              <name>XOSC_HF_FAST_START</name>
              <description>XOSC_HF_FAST_START</description>
              <bitRange>[20:19]</bitRange>
            </field>
            <field>
              <name>XOSC_OPTION</name>
              <description>XOSC_OPTION</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>HPOSC_OPTION</name>
              <description>HPOSC_OPTION</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>HPOSC_BIAS_HOLD_MODE_EN</name>
              <description>HPOSC_BIAS_HOLD_MODE_EN</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>HPOSC_CURRMIRR_RATIO</name>
              <description>HPOSC_CURRMIRR_RATIO</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>HPOSC_BIAS_RES_SET</name>
              <description>HPOSC_BIAS_RES_SET</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>HPOSC_FILTER_EN</name>
              <description>HPOSC_FILTER_EN</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>HPOSC_BIAS_RECHARGE_DELAY</name>
              <description>HPOSC_BIAS_RECHARGE_DELAY</description>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>HPOSC_SERIES_CAP</name>
              <description>HPOSC_SERIES_CAP</description>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>HPOSC_DIV3_BYPASS</name>
              <description>HPOSC_DIV3_BYPASS</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQ_OFFSET</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>912</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HPOSC_COMP_P0</name>
              <description>HPOSC_COMP_P0</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>HPOSC_COMP_P1</name>
              <description>HPOSC_COMP_P1</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>HPOSC_COMP_P2</name>
              <description>HPOSC_COMP_P2</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MISC_OTP_DATA_1</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>920</addressOffset>
          <access>read-only</access>
          <resetValue>0xe08403f8</resetValue>
          <fields>
            <field>
              <name>PEAK_DET_ITRIM</name>
              <description>PEAK_DET_ITRIM</description>
              <bitRange>[28:27]</bitRange>
            </field>
            <field>
              <name>HP_BUF_ITRIM</name>
              <description>HP_BUF_ITRIM</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>LP_BUF_ITRIM</name>
              <description>LP_BUF_ITRIM</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>DBLR_LOOP_FILTER_RESET_VOLTAGE</name>
              <description>DBLR_LOOP_FILTER_RESET_VOLTAGE</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>HPM_IBIAS_WAIT_CNT</name>
              <description>HPM_IBIAS_WAIT_CNT</description>
              <bitRange>[19:10]</bitRange>
            </field>
            <field>
              <name>LPM_IBIAS_WAIT_CNT</name>
              <description>LPM_IBIAS_WAIT_CNT</description>
              <bitRange>[9:4]</bitRange>
            </field>
            <field>
              <name>IDAC_STEP</name>
              <description>IDAC_STEP</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SHDW_DIE_ID_0</name>
          <description>Shadow of DIE_ID_0 register in eFuse</description>
          <addressOffset>976</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ID_31_0</name>
              <description>ID_31_0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SHDW_DIE_ID_1</name>
          <description>Shadow of DIE_ID_1 register in eFuse</description>
          <addressOffset>980</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ID_63_32</name>
              <description>ID_63_32</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SHDW_DIE_ID_2</name>
          <description>Shadow of DIE_ID_2 register in eFuse</description>
          <addressOffset>984</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ID_95_64</name>
              <description>ID_95_64</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SHDW_DIE_ID_3</name>
          <description>Shadow of DIE_ID_3 register in eFuse</description>
          <addressOffset>988</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ID_127_96</name>
              <description>ID_127_96</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SHDW_OSC_BIAS_LDO_TRIM</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>1016</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TRIMMAG</name>
              <description>TRIMMAG</description>
              <bitRange>[26:23]</bitRange>
            </field>
            <field>
              <name>TRIMIREF</name>
              <description>TRIMIREF</description>
              <bitRange>[22:18]</bitRange>
            </field>
            <field>
              <name>ITRIM_DIG_LDO</name>
              <description>ITRIM_DIG_LDO</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>VTRIM_DIG</name>
              <description>VTRIM_DIG</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>VTRIM_COARSE</name>
              <description>VTRIM_COARSE</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>RCOSCHF_CTRIM</name>
              <description>RCOSCHF_CTRIM</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
