tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>SHDW_ANA_TRIM</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>1020</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BOD_BANDGAP_TRIM_CNF</name>
              <description>BOD_BANDGAP_TRIM_CNF</description>
              <bitRange>[26:25]</bitRange>
            </field>
            <field>
              <name>VDDR_ENABLE_PG1</name>
              <description>VDDR_ENABLE_PG1</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>VDDR_OK_HYS</name>
              <description>VDDR_OK_HYS</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>IPTAT_TRIM</name>
              <description>IPTAT_TRIM</description>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>VDDR_TRIM</name>
              <description>VDDR_TRIM</description>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>TRIMBOD_INTMODE</name>
              <description>TRIMBOD_INTMODE</description>
              <bitRange>[15:11]</bitRange>
            </field>
            <field>
              <name>TRIMBOD_EXTMODE</name>
              <description>TRIMBOD_EXTMODE</description>
              <bitRange>[10:6]</bitRange>
            </field>
            <field>
              <name>TRIMTEMP</name>
              <description>TRIMTEMP</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC_BIAS_CNF</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>1036</addressOffset>
          <access>read-only</access>
          <resetValue>0xfffc00ff</resetValue>
          <fields>
            <field>
              <name>LPM_TRIM_IOUT</name>
              <description>LPM_TRIM_IOUT</description>
              <bitRange>[17:12]</bitRange>
            </field>
            <field>
              <name>LPM_BIAS_WIDTH_TRIM</name>
              <description>LPM_BIAS_WIDTH_TRIM</description>
              <bitRange>[11:9]</bitRange>
            </field>
            <field>
              <name>LPM_BIAS_BACKUP_EN</name>
              <description>LPM_BIAS_BACKUP_EN</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TFW_PROBE</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>1048</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REV</name>
              <description>REV</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TFW_FT</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>1052</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REV</name>
              <description>REV</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC_CAL0</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>1056</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SOC_DAC_VOUT_CAL_DECOUPLE_C2</name>
              <description>SOC_DAC_VOUT_CAL_DECOUPLE_C2</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>SOC_DAC_VOUT_CAL_DECOUPLE_C1</name>
              <description>SOC_DAC_VOUT_CAL_DECOUPLE_C1</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC_CAL1</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>1060</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SOC_DAC_VOUT_CAL_PRECH_C2</name>
              <description>SOC_DAC_VOUT_CAL_PRECH_C2</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>SOC_DAC_VOUT_CAL_PRECH_C1</name>
              <description>SOC_DAC_VOUT_CAL_PRECH_C1</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC_CAL2</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>1064</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SOC_DAC_VOUT_CAL_ADCREF_C2</name>
              <description>SOC_DAC_VOUT_CAL_ADCREF_C2</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>SOC_DAC_VOUT_CAL_ADCREF_C1</name>
              <description>SOC_DAC_VOUT_CAL_ADCREF_C1</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DAC_CAL3</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>1068</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SOC_DAC_VOUT_CAL_VDDS_C2</name>
              <description>SOC_DAC_VOUT_CAL_VDDS_C2</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>SOC_DAC_VOUT_CAL_VDDS_C1</name>
              <description>SOC_DAC_VOUT_CAL_VDDS_C1</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
