tyropyro/CC1312tester/cc1312/cpu-mmap.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FCFG2</name>
      <description>Factory Configuration Area 2</description>
      <baseAddress>0x50002000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>FLASH</name>
      <description>Flash sub-system registers, includes the Flash Memory Controller (FMC), flash read path, and an integrated Efuse controller and EFUSEROM.</description>
      <baseAddress>0x40030000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00004000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>STAT</name>
          <description>FMC and Efuse Status</description>
          <addressOffset>28</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EFUSE_BLANK</name>
              <description>EFUSE_BLANK</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EFUSE_TIMEOUT</name>
              <description>EFUSE_TIMEOUT</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SPRS_BYTE_NOT_OK</name>
              <description>SPRS_BYTE_NOT_OK</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EFUSE_ERRCODE</name>
              <description>EFUSE_ERRCODE</description>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>SAMHOLD_DIS</name>
              <description>SAMHOLD_DIS</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BUSY</name>
              <description>BUSY</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>POWER_MODE</name>
              <description>POWER_MODE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>36</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STANDBY_MODE_SEL</name>
              <description>STANDBY_MODE_SEL</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>STANDBY_PW_SEL</name>
              <description>STANDBY_PW_SEL</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>DIS_EFUSECLK</name>
              <description>DIS_EFUSECLK</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DIS_READACCESS</name>
              <description>DIS_READACCESS</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ENABLE_SWINTF</name>
              <description>ENABLE_SWINTF</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DIS_STANDBY</name>
              <description>DIS_STANDBY</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DIS_IDLE</name>
              <description>DIS_IDLE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCODE_START</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SYSCODE_START</name>
              <description>SYSCODE_START</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SIZE</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SECTORS</name>
              <description>SECTORS</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FWLOCK</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>60</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FWLOCK</name>
              <description>FWLOCK</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FWFLAG</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>64</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FWFLAG</name>
              <description>FWFLAG</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSE</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4096</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INSTRUCTION</name>
              <description>INSTRUCTION</description>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>DUMPWORD</name>
              <description>DUMPWORD</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSEADDR</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BLOCK</name>
              <description>BLOCK</description>
              <bitRange>[15:11]</bitRange>
            </field>
            <field>
              <name>ROW</name>
              <description>ROW</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATAUPPER</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4104</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPARE</name>
              <description>SPARE</description>
              <bitRange>[7:3]</bitRange>
            </field>
            <field>
              <name>P</name>
              <description>P</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>R</name>
              <description>R</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EEN</name>
              <description>EEN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATALOWER</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4108</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>DATA</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSECFG</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4112</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>IDLEGATING</name>
              <description>IDLEGATING</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SLAVEPOWER</name>
              <description>SLAVEPOWER</description>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>GATING</name>
              <description>GATING</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSESTAT</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4116</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>RESETDONE</name>
              <description>RESETDONE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACC</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4120</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACCUMULATOR</name>
              <description>ACCUMULATOR</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BOUNDARY</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4124</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DISROW0</name>
              <description>DISROW0</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>SPARE</name>
              <description>SPARE</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EFC_SELF_TEST_ERROR</name>
              <description>EFC_SELF_TEST_ERROR</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EFC_INSTRUCTION_INFO</name>
              <description>EFC_INSTRUCTION_INFO</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EFC_INSTRUCTION_ERROR</name>
              <description>EFC_INSTRUCTION_ERROR</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EFC_AUTOLOAD_ERROR</name>
              <description>EFC_AUTOLOAD_ERROR</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>OUTPUTENABLE</name>
              <description>OUTPUTENABLE</description>
              <bitRange>[17:14]</bitRange>
            </field>
            <field>
              <name>SYS_ECC_SELF_TEST_EN</name>
              <description>SYS_ECC_SELF_TEST_EN</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SYS_ECC_OVERRIDE_EN</name>
              <description>SYS_ECC_OVERRIDE_EN</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EFC_FDI</name>
              <description>EFC_FDI</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SYS_DIEID_AUTOLOAD_EN</name>
              <description>SYS_DIEID_AUTOLOAD_EN</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SYS_REPAIR_EN</name>
              <description>SYS_REPAIR_EN</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SYS_WS_READ_STATES</name>
              <description>SYS_WS_READ_STATES</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>INPUTENABLE</name>
              <description>INPUTENABLE</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSEFLAG</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4128</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY</name>
              <description>KEY</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSEKEY</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4132</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CODE</name>
              <description>CODE</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSERELEASE</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4136</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ODPYEAR</name>
              <description>ODPYEAR</description>
              <bitRange>[31:25]</bitRange>
            </field>
            <field>
              <name>ODPMONTH</name>
              <description>ODPMONTH</description>
              <bitRange>[24:21]</bitRange>
            </field>
            <field>
              <name>ODPDAY</name>
              <description>ODPDAY</description>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>EFUSEYEAR</name>
              <description>EFUSEYEAR</description>
              <bitRange>[15:9]</bitRange>
            </field>
            <field>
              <name>EFUSEMONTH</name>
              <description>EFUSEMONTH</description>
              <bitRange>[8:5]</bitRange>
            </field>
            <field>
              <name>EFUSEDAY</name>
              <description>EFUSEDAY</description>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSEPINS</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4140</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EFC_SELF_TEST_DONE</name>
              <description>EFC_SELF_TEST_DONE</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>EFC_SELF_TEST_ERROR</name>
              <description>EFC_SELF_TEST_ERROR</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SYS_ECC_SELF_TEST_EN</name>
              <description>SYS_ECC_SELF_TEST_EN</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>EFC_INSTRUCTION_INFO</name>
              <description>EFC_INSTRUCTION_INFO</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>EFC_INSTRUCTION_ERROR</name>
              <description>EFC_INSTRUCTION_ERROR</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>EFC_AUTOLOAD_ERROR</name>
              <description>EFC_AUTOLOAD_ERROR</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SYS_ECC_OVERRIDE_EN</name>
              <description>SYS_ECC_OVERRIDE_EN</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EFC_READY</name>
              <description>EFC_READY</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EFC_FCLRZ</name>
              <description>EFC_FCLRZ</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYS_DIEID_AUTOLOAD_EN</name>
              <description>SYS_DIEID_AUTOLOAD_EN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SYS_REPAIR_EN</name>
              <description>SYS_REPAIR_EN</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>SYS_WS_READ_STATES</name>
              <description>SYS_WS_READ_STATES</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSECRA</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4144</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>DATA</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSEREAD</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4148</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATABIT</name>
              <description>DATABIT</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>READCLOCK</name>
              <description>READCLOCK</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>DEBUG</name>
              <description>DEBUG</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SPARE</name>
              <description>SPARE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MARGIN</name>
              <description>MARGIN</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSEPROGRAM</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4152</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COMPAREDISABLE</name>
              <description>COMPAREDISABLE</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CLOCKSTALL</name>
              <description>CLOCKSTALL</description>
              <bitRange>[29:14]</bitRange>
            </field>
            <field>
              <name>VPPTOVDD</name>
              <description>VPPTOVDD</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ITERATIONS</name>
              <description>ITERATIONS</description>
              <bitRange>[12:9]</bitRange>
            </field>
            <field>
              <name>WRITECLOCK</name>
              <description>WRITECLOCK</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EFUSEERROR</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4156</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DONE</name>
              <description>DONE</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CODE</name>
              <description>CODE</description>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLEBIT</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4160</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FROMN</name>
              <description>FROMN</description>
              <bitRange>[31:1]</bitRange>
            </field>
            <field>
              <name>FROM0</name>
              <description>FROM0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TWOBIT</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4164</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FROMN</name>
              <description>FROMN</description>
              <bitRange>[31:1]</bitRange>
            </field>
            <field>
              <name>FROM0</name>
              <description>FROM0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SELFTESTCYC</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4168</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CYCLES</name>
              <description>CYCLES</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SELFTESTSIGN</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>4172</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGNATURE</name>
              <description>SIGNATURE</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
