tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>FPSTROBES</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8452</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000103</resetValue>
          <fields>
            <field>
              <name>EXECUTEZ</name>
              <description>EXECUTEZ</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>V3PWRDNZ</name>
              <description>V3PWRDNZ</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>V5PWRDNZ</name>
              <description>V5PWRDNZ</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FBMODE</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8456</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FTCR</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8460</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TCR</name>
              <description>TCR</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FADDR</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8464</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FADDR</name>
              <description>FADDR</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FTCTL</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8476</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WDATA_BLK_CLR</name>
              <description>WDATA_BLK_CLR</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>TEST_EN</name>
              <description>TEST_EN</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FWPWRITE0</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8480</addressOffset>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>FWPWRITE0</name>
              <description>FWPWRITE0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FWPWRITE1</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8484</addressOffset>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>FWPWRITE1</name>
              <description>FWPWRITE1</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FWPWRITE2</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8488</addressOffset>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>FWPWRITE2</name>
              <description>FWPWRITE2</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FWPWRITE3</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8492</addressOffset>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>FWPWRITE3</name>
              <description>FWPWRITE3</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FWPWRITE4</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8496</addressOffset>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>FWPWRITE4</name>
              <description>FWPWRITE4</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FWPWRITE5</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8500</addressOffset>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>FWPWRITE5</name>
              <description>FWPWRITE5</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FWPWRITE6</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8504</addressOffset>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>FWPWRITE6</name>
              <description>FWPWRITE6</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FWPWRITE7</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8508</addressOffset>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>FWPWRITE7</name>
              <description>FWPWRITE7</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FWPWRITE_ECC</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8512</addressOffset>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>ECCBYTES07_00</name>
              <description>ECCBYTES07_00</description>
              <bitRange>[31:24]</bitRange>
            </field>
            <field>
              <name>ECCBYTES15_08</name>
              <description>ECCBYTES15_08</description>
              <bitRange>[23:16]</bitRange>
            </field>
            <field>
              <name>ECCBYTES23_16</name>
              <description>ECCBYTES23_16</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>ECCBYTES31_24</name>
              <description>ECCBYTES31_24</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSWSTAT</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8516</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SAFELV</name>
              <description>SAFELV</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_GLBCTL</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8704</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>CLKSEL</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_STATE</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8708</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000c00</resetValue>
          <fields>
            <field>
              <name>CTRLENZ</name>
              <description>CTRLENZ</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>EXECUTEZ</name>
              <description>EXECUTEZ</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>FSM_ACT</name>
              <description>FSM_ACT</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TIOTP_ACT</name>
              <description>TIOTP_ACT</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>OTP_ACT</name>
              <description>OTP_ACT</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_STAT</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8712</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>NON_OP</name>
              <description>NON_OP</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OVR_PUL_CNT</name>
              <description>OVR_PUL_CNT</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>INV_DAT</name>
              <description>INV_DAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_CMD</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8716</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FSMCMD</name>
              <description>FSMCMD</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_PE_OSU</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8720</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PGM_OSU</name>
              <description>PGM_OSU</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>ERA_OSU</name>
              <description>ERA_OSU</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_VSTAT</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8724</addressOffset>
          <access>read-write</access>
          <resetValue>0x00003000</resetValue>
          <fields>
            <field>
              <name>VSTAT_CNT</name>
              <description>VSTAT_CNT</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_PE_VSU</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8728</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PGM_VSU</name>
              <description>PGM_VSU</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>ERA_VSU</name>
              <description>ERA_VSU</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_CMP_VSU</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8732</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADD_EXZ</name>
              <description>ADD_EXZ</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_EX_VAL</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8736</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000301</resetValue>
          <fields>
            <field>
              <name>REP_VSU</name>
              <description>REP_VSU</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>EXE_VALD</name>
              <description>EXE_VALD</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_RD_H</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8740</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000005a</resetValue>
          <fields>
            <field>
              <name>RD_H</name>
              <description>RD_H</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_P_OH</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8744</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000100</resetValue>
          <fields>
            <field>
              <name>PGM_OH</name>
              <description>PGM_OH</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_ERA_OH</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8748</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>ERA_OH</name>
              <description>ERA_OH</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_SAV_PPUL</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8752</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SAV_P_PUL</name>
              <description>SAV_P_PUL</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_PE_VH</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8756</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000100</resetValue>
          <fields>
            <field>
              <name>PGM_VH</name>
              <description>PGM_VH</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_PRG_PW</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8768</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PROG_PUL_WIDTH</name>
              <description>PROG_PUL_WIDTH</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_ERA_PW</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8772</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FSM_ERA_PW</name>
              <description>FSM_ERA_PW</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_SAV_ERA_PUL</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8788</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SAV_ERA_PUL</name>
              <description>SAV_ERA_PUL</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_TIMER</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8792</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FSM_TIMER</name>
              <description>FSM_TIMER</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_MODE</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8796</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDV_SUBMODE</name>
              <description>RDV_SUBMODE</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>PGM_SUBMODE</name>
              <description>PGM_SUBMODE</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>ERA_SUBMODE</name>
              <description>ERA_SUBMODE</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>SUBMODE</name>
              <description>SUBMODE</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>SAV_PGM_CMD</name>
              <description>SAV_PGM_CMD</description>
              <bitRange>[11:9]</bitRange>
            </field>
            <field>
              <name>SAV_ERA_MODE</name>
              <description>SAV_ERA_MODE</description>
              <bitRange>[8:6]</bitRange>
            </field>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitRange>[5:3]</bitRange>
            </field>
            <field>
              <name>CMD</name>
              <description>CMD</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_PGM</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8800</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PGM_BANK</name>
              <description>PGM_BANK</description>
              <bitRange>[25:23]</bitRange>
            </field>
            <field>
              <name>PGM_ADDR</name>
              <description>PGM_ADDR</description>
              <bitRange>[22:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_ERA</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8804</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ERA_BANK</name>
              <description>ERA_BANK</description>
              <bitRange>[25:23]</bitRange>
            </field>
            <field>
              <name>ERA_ADDR</name>
              <description>ERA_ADDR</description>
              <bitRange>[22:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_PRG_PUL</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8808</addressOffset>
          <access>read-write</access>
          <resetValue>0x00040032</resetValue>
          <fields>
            <field>
              <name>BEG_EC_LEVEL</name>
              <description>BEG_EC_LEVEL</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>MAX_PRG_PUL</name>
              <description>MAX_PRG_PUL</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_ERA_PUL</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8812</addressOffset>
          <access>read-write</access>
          <resetValue>0x00040bb8</resetValue>
          <fields>
            <field>
              <name>MAX_EC_LEVEL</name>
              <description>MAX_EC_LEVEL</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>MAX_ERA_PUL</name>
              <description>MAX_ERA_PUL</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSM_STEP_SIZE</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>8816</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EC_STEP_SIZE</name>
              <description>EC_STEP_SIZE</description>
              <bitRange>[24:16]</bitRange>
            </field>
          </fields>
        </register>
