tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          nterrupts can be generated when the timer value is equal to the value in this register in one-shot or periodic mode.

          n Edge-Count mode, this register along with TAILR, determines how many edge events are counted.
          he total number of edge events counted is equal to the value in TAILR minus this value.

          ote that in edge-count mode, when executing an up-count, the value of TAPR and TAILR must be greater than the value of TAPMR and this register.

          n PWM mode, this value along with TAILR, determines the duty cycle of the output PWM signal.

          hen a 16/32-bit GPT is configured to one of the 32-bit modes, TAMATCHR appears as a 32-bit register. (The upper 16-bits correspond to the contents TBMATCHR).

          n a 16-bit mode, the upper 16 bits of this register read as 0s and have no effect on the state of TBMATCHR.

          ote : This register is updated internally (takes effect) based on TAMR.TAMRSU</description>
          <addressOffset>48</addressOffset>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>TAMATCHR</name>
              <description>TAMATCHR</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBMATCHR</name>
          <description>Timer B Match Register

 When a GPT is configured to one of the 32-bit modes, the contents of bits 15:0 in this register are loaded into the upper 16 bits of  TAMATCHR.
          eads from this register return the current match value of Timer B and writes are ignored.
          n a 16-bit mode, bits 15:0 are used for the match value. Bits 31:16 are reserved in both cases.

          ote : This register is updated internally (takes effect) based on TBMR.TBMRSU</description>
          <addressOffset>52</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000ffff</resetValue>
          <fields>
            <field>
              <name>TBMATCHR</name>
              <description>TBMATCHR</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAPR</name>
          <description>Timer A Pre-scale
          his register allows software to extend the range of the timers when they are used individually.
          hen in one-shot or periodic down count modes, this register acts as a true prescaler for the timer counter.
          hen acting as a true prescaler, the prescaler counts down to 0 before the value in TAR and TAV registers are incremented.
          n all other individual/split modes, this register is a linear extension of the upper range of the timer counter, holding bits 23:16 in the 16-bit modes of the 16/32-bit GPT.</description>
          <addressOffset>56</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TAPSR</name>
              <description>TAPSR</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBPR</name>
          <description>Timer B Pre-scale
          his register allows software to extend the range of the timers when they are used individually.
          hen in one-shot or periodic down count modes, this register acts as a true prescaler for the timer counter.
          hen acting as a true prescaler, the prescaler counts down to 0 before the value in TBR and TBV registers are incremented.
          n all other individual/split modes, this register is a linear extension of the upper range of the timer counter, holding bits 23:16 in the 16-bit modes of the 16/32-bit GPT.</description>
          <addressOffset>60</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TBPSR</name>
              <description>TBPSR</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAPMR</name>
          <description>Timer A Pre-scale Match
          his register allows software to extend the range of the TAMATCHR when used individually.</description>
          <addressOffset>64</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TAPSMR</name>
              <description>TAPSMR</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBPMR</name>
          <description>Timer B Pre-scale Match
          his register allows software to extend the range of the TBMATCHR when used individually.</description>
          <addressOffset>68</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TBPSMR</name>
              <description>TBPSMR</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAR</name>
          <description>Timer A Register
          his register shows the current value of the Timer A counter in all cases except for Input Edge Count and Time modes. In the Input Edge Count mode, this register contains the number of edges that
          ave occurred. In the Input Edge Time mode, this register contains the time at which the last edge event took place.

          hen a GPT is configured to one of the 32-bit modes, this register appears as a 32-bit register (the upper 16-bits correspond to the contents of the Timer B (TBR) register). In
          he16-bit Input Edge Count, Input Edge Time, and PWM modes, bits 15:0 contain the value of the counter and bits 23:16 contain the value of the prescaler, which is the upper 8 bits of the count. Bits
          1:24 always read as 0. To read the value of the prescaler in 16-bit One-Shot and Periodic modes, read bits [23:16] in the TAV register. To read the value of the prescalar in periodic snapshot
          ode, read the Timer A Prescale Snapshot (TAPS) register.</description>
          <addressOffset>72</addressOffset>
          <access>read-only</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>TAR</name>
              <description>TAR</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBR</name>
          <description>Timer B Register
          his register shows the current value of the Timer B counter in all cases except for Input Edge Count and Time modes. In the Input Edge Count mode, this register contains the number of edges that
          ave occurred. In the Input Edge Time mode, this register contains the time at which the last edge event took place.

          hen a GPTM is configured to one of the 32-bit modes, the contents of bits 15:0 in this register are loaded into the upper 16 bits of the TAR register. Reads from this register return the current
          alue of Timer B. In a 16-bit mode, bits 15:0 contain the value of the counter and bits 23:16 contain the value of the prescaler in Input Edge Count, Input Edge Time, and PWM modes, which is the
          pper 8 bits of the count. Bits 31:24 always read as 0. To read the value of the prescaler in 16-bit One-Shot and Periodic modes, read bits [23:16] in the TBV register. To read the value of the
          rescalar in periodic snapshot mode, read the Timer B Prescale Snapshot (TBPS) register.</description>
          <addressOffset>76</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000ffff</resetValue>
          <fields>
            <field>
              <name>TBR</name>
              <description>TBR</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAV</name>
          <description>Timer A Value 
          hen read, this register shows the current, free-running value of Timer A in all modes. Softwarecan use this value to determine the time elapsed between an interrupt and the ISR entry when using
          he snapshot feature with the periodic operating mode. When written, the value written into this register is loaded into the TAR register on the next clock cycle.

          hen a 16/32-bit GPTM is configured to one of the 32-bit modes, this register appears as a 32-bit register (the upper 16-bits correspond to the contents of the GPTM Timer B Value (TBV) register). In a 16-bit mode, bits 15:0 contain the value of the counter and bits 23:16 contain the current, free-running value of the prescaler, which is the upper 8 bits of the count in Input Edge Count, Input Edge Time, PWM and one-shot or periodic up count modes. In one-shot or periodic
          own count modes, the prescaler stored in 23:16 is a true prescaler, meaning bits 23:16 count down before decrementing the value in bits 15:0. The prescaler in bits 31:24 always reads as 0.</description>
          <addressOffset>80</addressOffset>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>TAV</name>
              <description>TAV</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBV</name>
          <description>Timer B Value 
          hen read, this register shows the current, free-running value of Timer B in all modes. Software can use this value to determine the time elapsed between an interrupt and the ISR entry. When
          ritten, the value written into this register is loaded into the TBR register on the next clock cycle.

          hen a 16/32-bit GPTM is configured to one of the 32-bit modes, the contents of bits 15:0 in this register are loaded into the upper 16 bits of the TAV register. Reads from this register return
          he current free-running value of Timer B. In a 16-bit mode, bits 15:0 contain the value of the counter and bits 23:16 contain the current, free-running value of the prescaler, which is the upper 8 bits of
          he count in Input Edge Count, Input Edge Time, PWM and one-shot or periodic up count modes.
          n one-shot or periodic down count modes, the prescaler stored in 23:16 is a true prescaler, meaning bits 23:16 count down before decrementing the value in bits 15:0. The prescaler in bits 31:24 always reads as 0.</description>
          <addressOffset>84</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000ffff</resetValue>
          <fields>
            <field>
              <name>TBV</name>
              <description>TBV</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAPS</name>
          <description>Timer A Pre-scale Snap-shot 

