tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          ased on the value in the register field TAMR.TAILD, this register is updated with the value from TAPR register either on the next cycle or on the next timeout.


          his register shows the current value of the Timer A pre-scaler in the 16-bit mode.</description>
          <addressOffset>92</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PSS</name>
              <description>PSS</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBPS</name>
          <description>Timer B Pre-scale Snap-shot 

          ased on the value in the register field TBMR.TBILD, this register is updated with the value from TBPR register either on the next cycle or on the next timeout.

          his register shows the current value of the Timer B pre-scaler in the 16-bit mode.</description>
          <addressOffset>96</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PSS</name>
              <description>PSS</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TAPV</name>
          <description>Timer A Pre-scale Value 
          his register shows the current value of the Timer A free running pre-scaler in the 16-bit mode.</description>
          <addressOffset>100</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PSV</name>
              <description>PSV</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBPV</name>
          <description>Timer B Pre-scale Value 
          his register shows the current value of the Timer B free running pre-scaler in the 16-bit mode.</description>
          <addressOffset>104</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PSV</name>
              <description>PSV</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAEV</name>
          <description>DMA Event 
          his register allows software to enable/disable GPT DMA trigger events.</description>
          <addressOffset>108</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TBMDMAEN</name>
              <description>TBMDMAEN</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CBEDMAEN</name>
              <description>CBEDMAEN</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CBMDMAEN</name>
              <description>CBMDMAEN</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TBTODMAEN</name>
              <description>TBTODMAEN</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TAMDMAEN</name>
              <description>TAMDMAEN</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CAEDMAEN</name>
              <description>CAEDMAEN</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CAMDMAEN</name>
              <description>CAMDMAEN</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TATODMAEN</name>
              <description>TATODMAEN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VERSION</name>
          <description>Peripheral Version
          his register provides information regarding the GPT version</description>
          <addressOffset>4016</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000400</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>VERSION</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ANDCCP</name>
          <description>Combined CCP Output
          his register is used to logically AND CCP output pairs for each timer</description>
          <addressOffset>4020</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LD_TO_EN</name>
              <description>LD_TO_EN</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CCP_AND_EN</name>
              <description>CCP_AND_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PKA</name>
      <description>Integrated module which combines the Public Key Acceleration module, optional True Random Gnerator, optional interrupt controller and a standard bus interface</description>
      <baseAddress>0x40025000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>APTR</name>
          <description>PKA Vector A Address
          uring execution of basic PKCP operations, this register is double buffered and can be written with a new value for the next operation; when not written, the value remains intact. During the execution of sequencer-controlled complex operations, this register may not be written and its value is undefined at the conclusion of the operation. The driver software cannot rely on the written value to remain intact.</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>APTR</name>
              <description>APTR</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BPTR</name>
          <description>PKA Vector B Address
          uring execution of basic PKCP operations, this register is double buffered and can be written with a new value for the next operation; when not written, the value remains intact. During the execution of sequencer-controlled complex operations, this register may not be written and its value is undefined at the conclusion of the operation. The driver software cannot rely on the written value to remain intact.</description>
          <addressOffset>4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BPTR</name>
              <description>BPTR</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPTR</name>
          <description>PKA Vector C Address
          uring execution of basic PKCP operations, this register is double buffered and can be written with a new value for the next operation; when not written, the value remains intact. During the execution of sequencer-controlled complex operations, this register may not be written and its value is undefined at the conclusion of the operation. The driver software cannot rely on the written value to remain intact.</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CPTR</name>
              <description>CPTR</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DPTR</name>
          <description>PKA Vector D Address
          uring execution of basic PKCP operations, this register is double buffered and can be written with a new value for the next operation; when not written, the value remains intact. During the execution of sequencer-controlled complex operations, this register may not be written and its value is undefined at the conclusion of the operation. The driver software cannot rely on the written value to remain intact.</description>
          <addressOffset>12</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DPTR</name>
              <description>DPTR</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALENGTH</name>
          <description>PKA Vector A Length
          uring execution of basic PKCP operations, this register is double buffered and can be written with a new value for the next operation; when not written, the value remains intact. During the execution of sequencer-controlled complex operations, this register may not be written and its value is undefined at the conclusion of the operation. The driver software cannot rely on the written value to remain intact.</description>
          <addressOffset>16</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ALENGTH</name>
              <description>ALENGTH</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BLENGTH</name>
          <description>PKA Vector B Length
          uring execution of basic PKCP operations, this register is double buffered and can be written with a new value for the next operation; when not written, the value remains intact. During the execution of sequencer-controlled complex operations, this register may not be written and its value is undefined at the conclusion of the operation. The driver software cannot rely on the written value to remain intact.</description>
          <addressOffset>20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BLENGTH</name>
              <description>BLENGTH</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SHIFT</name>
          <description>PKA Bit Shift Value
          or basic PKCP operations, modifying the contents of this register is made impossible while the operation is being performed. For the ExpMod-variable and ExpMod-CRT operations, this register is used to indicate the number of odd powers to use (directly as a value in the range 1-16). For the ModInv and ECC operations, this register is used to hold a completion code.</description>
          <addressOffset>24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NUM_BITS_TO_SHIFT</name>
              <description>NUM_BITS_TO_SHIFT</description>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNCTION</name>
          <description>PKA Function
          his register contains the control bits to start basic PKCP as well as complex sequencer operations. The run bit can be used to poll for the completion of the operation. Modifying bits [11:0] is made impossible during the execution of a basic PKCP operation.
          uring the execution of sequencer-controlled complex operations, this register is modified, the run and stall result bits are set to zero at the conclusion, but other bits are undefined.

