tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          OTE: Continuously reading this register to poll the run bit is not allowed when executing complex sequencer operations (the sequencer cannot access the PKCP when this is done). Leave at least one sysclk cycle between poll operations.</description>
          <addressOffset>28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00008000</resetValue>
          <fields>
            <field>
              <name>STALL_RESULT</name>
              <description>STALL_RESULT</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>RUN</name>
              <description>RUN</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SEQUENCER_OPERATIONS</name>
              <description>SEQUENCER_OPERATIONS</description>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>COPY</name>
              <description>COPY</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>COMPARE</name>
              <description>COMPARE</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>MODULO</name>
              <description>MODULO</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DIVIDE</name>
              <description>DIVIDE</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LSHIFT</name>
              <description>LSHIFT</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RSHIFT</name>
              <description>RSHIFT</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SUBTRACT</name>
              <description>SUBTRACT</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ADD</name>
              <description>ADD</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MS_ONE</name>
              <description>MS_ONE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ADDSUB</name>
              <description>ADDSUB</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MULTIPLY</name>
              <description>MULTIPLY</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>COMPARE</name>
          <description>PKA compare result
          his register provides the result of a basic PKCP compare operation. It is updated when the FUNCTION.RUN bit is reset at the end of that operation.
          tatus after a complex sequencer operation is unknown</description>
          <addressOffset>32</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>A_GREATER_THAN_B</name>
              <description>A_GREATER_THAN_B</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>A_LESS_THAN_B</name>
              <description>A_LESS_THAN_B</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>A_EQUALS_B</name>
              <description>A_EQUALS_B</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MSW</name>
          <description>PKA most-significant-word of result vector
          his register indicates the (word) address in the PKA RAM where the most significant nonzero 32-bit word of the result is stored. Should be ignored for modulo operations. For basic PKCP operations, this register is updated  FUNCTION.RUN bit is reset at the end of the operation. For the complex-sequencer controlled operations, updating of the final value matching the actual result is done near the end of the operation; note that the result is only meaningful if no errors were detected and that for ECC operations, this register will provide information for the x-coordinate of the result point only.</description>
          <addressOffset>36</addressOffset>
          <access>read-only</access>
          <resetValue>0x00008000</resetValue>
          <fields>
            <field>
              <name>RESULT_IS_ZERO</name>
              <description>RESULT_IS_ZERO</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>MSW_ADDRESS</name>
              <description>MSW_ADDRESS</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVMSW</name>
          <description>PKA most-significant-word of divide remainder
          his register indicates the (32-bit word) address in the PKA RAM where the most significant nonzero 32-bit word of the remainder result for the basic divide and modulo operations is stored. Bits [4:0] are loaded with the bit number of the most-significant nonzero bit in the most-significant nonzero word when MS one control bit is set. For divide, modulo, and MS one reporting, this register is updated when FUNCTION.RUN bit is reset at the end of the operation. For the complex sequencer controlled operations, updating of bits [4:0] of this register with the most-significant bit location of the actual result is done near the end of the operation. The result is meaningful only if no errors were detected and that for ECC operations; this register provides information for the x-coordinate of the result point only.</description>
          <addressOffset>40</addressOffset>
          <access>read-only</access>
          <resetValue>0x00008000</resetValue>
          <fields>
            <field>
              <name>RESULT_IS_ZERO</name>
              <description>RESULT_IS_ZERO</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>MSW_ADDRESS</name>
              <description>MSW_ADDRESS</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SEQCTRL</name>
          <description>PKA sequencer control and status register
          he sequencer is interfaced with the outside world through a single control and status register. With the exception of bit [31], the actual use of bits in the separate sub-fields of this register is determined by the sequencer firmware. This register need only be accessed when the sequencer program is stored in RAM. The reset value of the RESET bit depends upon the option chosen for sequencer program storage.                                                                                                                                                                   NOTE: For Agama the sequencer firmware is executed from ROM.</description>
          <addressOffset>200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000100</resetValue>
          <fields>
            <field>
              <name>RESET</name>
              <description>RESET</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>SEQUENCER_STAT</name>
              <description>SEQUENCER_STAT</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>SW_CONTROL_STAT</name>
              <description>SW_CONTROL_STAT</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTIONS</name>
          <description>PKA hardware options register
          his register provides the host with a means to determine the hardware configuration implemented in this PKA engine, focused on options that have an effect on software interacting with the module.</description>
          <addressOffset>244</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000020</resetValue>
          <fields>
            <field>
              <name>INT_MASKING</name>
              <description>INT_MASKING</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PROTECTION_OPTION</name>
              <description>PROTECTION_OPTION</description>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>PROGRAM_RAM</name>
              <description>PROGRAM_RAM</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SEQUENCER_CONFIGURATION</name>
              <description>SEQUENCER_CONFIGURATION</description>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>PKCP_CONFIGURATION</name>
              <description>PKCP_CONFIGURATION</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FWREV</name>
          <description>PKA firmware revision and capabilities register
          his register allows the host access to the internal firmware revision number of the PKA Engine for software driver matching and diagnostic purposes. This register also contains a field that encodes the capabilities of the embedded firmware.
          his  register is written by the firmware within a few clock cycles after starting up that firmware. The hardware reset value is zero, indicating that the information has not been written yet.</description>
          <addressOffset>248</addressOffset>
          <access>read-only</access>
          <resetValue>0x21500000</resetValue>
          <fields>
            <field>
              <name>FW_CAPABILITIES</name>
              <description>FW_CAPABILITIES</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>MAJOR_FW_REVISION</name>
              <description>MAJOR_FW_REVISION</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>MINOR_FW_REVISION</name>
              <description>MINOR_FW_REVISION</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>FW_PATCH_LEVEL</name>
              <description>FW_PATCH_LEVEL</description>
              <bitRange>[19:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HWREV</name>
          <description>PKA hardware revision register
          his register allows the host access to the hardware revision number of the PKA engine for software driver matching and diagnostic purposes. It is always located at the highest address in the access space of the module and contains an encoding of the EIP number (with its complement as signature) for recognition of the hardware module.</description>
          <addressOffset>252</addressOffset>
          <access>read-only</access>
          <resetValue>0x0151e31c</resetValue>
          <fields>
            <field>
              <name>MAJOR_HW_REVISION</name>
              <description>MAJOR_HW_REVISION</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>MINOR_HW_REVISION</name>
              <description>MINOR_HW_REVISION</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>HW_PATCH_LEVEL</name>
              <description>HW_PATCH_LEVEL</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>COMPLEMENT_OF_BASIC_EIP_NUMBER</name>
              <description>COMPLEMENT_OF_BASIC_EIP_NUMBER</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>BASIC_EIP_NUMBER</name>
              <description>BASIC_EIP_NUMBER</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
