tyropyro/CC1312tester/cc1312/cpu-mmap.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PKA_INT</name>
      <description>Integrated module which includes the PKA K</description>
      <baseAddress>0x40027000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OPTIONS</name>
          <description>PKA Options register</description>
          <addressOffset>4088</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000102</resetValue>
          <fields>
            <field>
              <name>AIC_PRESENT</name>
              <description>AIC_PRESENT</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>EIP76_PRESENT</name>
              <description>EIP76_PRESENT</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>EIP28_PRESENT</name>
              <description>EIP28_PRESENT</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>AXI_INTERFACE</name>
              <description>AXI_INTERFACE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>AHB_IS_ASYNC</name>
              <description>AHB_IS_ASYNC</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>AHB_INTERFACE</name>
              <description>AHB_INTERFACE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PLB_INTERFACE</name>
              <description>PLB_INTERFACE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REVISION</name>
          <description>PKA hardware revision register
          his register allows the host access to the hardware revision number of the PKA engine for software driver matching and diagnostic purposes. It is always located at the highest address in the access space of the module and contains an encoding of the EIP number (with its complement as signature) for recognition of the hardware module.</description>
          <addressOffset>4092</addressOffset>
          <access>read-only</access>
          <resetValue>0x02006996</resetValue>
          <fields>
            <field>
              <name>MAJOR_REVISION</name>
              <description>MAJOR_REVISION</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>MINOR_REVISION</name>
              <description>MINOR_REVISION</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>PATCH_LEVEL</name>
              <description>PATCH_LEVEL</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>COMP_EIP_NUM</name>
              <description>COMP_EIP_NUM</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>EIP_NUM</name>
              <description>EIP_NUM</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PKA_RAM</name>
      <description>This is the a SRAM within the PKA domain, intended for PKA usage only.</description>
      <baseAddress>0x40026000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>512</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-511</dimIndex>
          <name>BANK0%s</name>
          <description>PKA RAM</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>DATA</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RFC_DBELL</name>
      <description>RF core doorbell

          he doorbell module is the main user interface to the radio sub-system. It contains the registers used for both submitting commands to the radio, and for configuring radio interrupts from the RF core.</description>
      <baseAddress>0x40041000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CMDR</name>
          <description>Doorbell Command Register</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMD</name>
              <description>CMD</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMDSTA</name>
          <description>Doorbell Command Status Register</description>
          <addressOffset>4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RFHWIFG</name>
          <description>Interrupt Flags From RF Hardware Modules</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RATCH7</name>
              <description>RATCH7</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>RATCH6</name>
              <description>RATCH6</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RATCH5</name>
              <description>RATCH5</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RATCH4</name>
              <description>RATCH4</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RATCH3</name>
              <description>RATCH3</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RATCH2</name>
              <description>RATCH2</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RATCH1</name>
              <description>RATCH1</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RATCH0</name>
              <description>RATCH0</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RFESOFT2</name>
              <description>RFESOFT2</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>RFESOFT1</name>
              <description>RFESOFT1</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RFESOFT0</name>
              <description>RFESOFT0</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RFEDONE</name>
              <description>RFEDONE</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRCTK</name>
              <description>TRCTK</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>MDMSOFT</name>
              <description>MDMSOFT</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>MDMOUT</name>
              <description>MDMOUT</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MDMIN</name>
              <description>MDMIN</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>MDMDONE</name>
              <description>MDMDONE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>FSCA</name>
              <description>FSCA</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RFHWIEN</name>
          <description>Interrupt Enable For RF Hardware Modules</description>
          <addressOffset>12</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RATCH7</name>
              <description>RATCH7</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>RATCH6</name>
              <description>RATCH6</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RATCH5</name>
              <description>RATCH5</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RATCH4</name>
              <description>RATCH4</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RATCH3</name>
              <description>RATCH3</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RATCH2</name>
              <description>RATCH2</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RATCH1</name>
              <description>RATCH1</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>RATCH0</name>
              <description>RATCH0</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>RFESOFT2</name>
              <description>RFESOFT2</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>RFESOFT1</name>
              <description>RFESOFT1</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>RFESOFT0</name>
              <description>RFESOFT0</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RFEDONE</name>
              <description>RFEDONE</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRCTK</name>
              <description>TRCTK</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>MDMSOFT</name>
              <description>MDMSOFT</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>MDMOUT</name>
              <description>MDMOUT</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MDMIN</name>
              <description>MDMIN</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>MDMDONE</name>
              <description>MDMDONE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>FSCA</name>
              <description>FSCA</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RFCPEIFG</name>
          <description>Interrupt Flags For Command and Packet Engine Generated Interrupts</description>
          <addressOffset>16</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTERNAL_ERROR</name>
              <description>INTERNAL_ERROR</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>BOOT_DONE</name>
              <description>BOOT_DONE</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>MODULES_UNLOCKED</name>
              <description>MODULES_UNLOCKED</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>SYNTH_NO_LOCK</name>
              <description>SYNTH_NO_LOCK</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IRQ27</name>
              <description>IRQ27</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>RX_ABORTED</name>
              <description>RX_ABORTED</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>RX_N_DATA_WRITTEN</name>
              <description>RX_N_DATA_WRITTEN</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>RX_DATA_WRITTEN</name>
              <description>RX_DATA_WRITTEN</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>RX_ENTRY_DONE</name>
              <description>RX_ENTRY_DONE</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>RX_BUF_FULL</name>
              <description>RX_BUF_FULL</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>RX_CTRL_ACK</name>
              <description>RX_CTRL_ACK</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>RX_CTRL</name>
              <description>RX_CTRL</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>RX_EMPTY</name>
              <description>RX_EMPTY</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>RX_IGNORED</name>
              <description>RX_IGNORED</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RX_NOK</name>
              <description>RX_NOK</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>RX_OK</name>
              <description>RX_OK</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>IRQ15</name>
              <description>IRQ15</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>IRQ14</name>
              <description>IRQ14</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FG_COMMAND_STARTED</name>
              <description>FG_COMMAND_STARTED</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COMMAND_STARTED</name>
              <description>COMMAND_STARTED</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TX_BUFFER_CHANGED</name>
              <description>TX_BUFFER_CHANGED</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TX_ENTRY_DONE</name>
              <description>TX_ENTRY_DONE</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TX_RETRANS</name>
              <description>TX_RETRANS</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TX_CTRL_ACK_ACK</name>
              <description>TX_CTRL_ACK_ACK</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TX_CTRL_ACK</name>
              <description>TX_CTRL_ACK</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TX_CTRL</name>
              <description>TX_CTRL</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TX_ACK</name>
              <description>TX_ACK</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TX_DONE</name>
              <description>TX_DONE</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LAST_FG_COMMAND_DONE</name>
              <description>LAST_FG_COMMAND_DONE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>FG_COMMAND_DONE</name>
              <description>FG_COMMAND_DONE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LAST_COMMAND_DONE</name>
              <description>LAST_COMMAND_DONE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>COMMAND_DONE</name>
              <description>COMMAND_DONE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
