tyropyro/CC1312tester/cc1312/cpu-mmap.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RFC_ULLRAM</name>
      <description>Command and packet engine RAM (CPERAM) in the RF core</description>
      <baseAddress>0x21004000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>2048</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-2047</dimIndex>
          <name>BANK1%s</name>
          <description>8 kB ULL SRAM</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>DATA</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SRAM_MMR</name>
      <description>General Purpose RAM</description>
      <baseAddress>0x40035000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x5000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PER_CTL</name>
          <description>Parity Error Control 
          arity error check controls</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PER_DISABLE</name>
              <description>PER_DISABLE</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PER_DEBUG_ENABLE</name>
              <description>PER_DEBUG_ENABLE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PER_CHK</name>
          <description>Parity Error Check
          arity error check results</description>
          <addressOffset>4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PER_ADDR</name>
              <description>PER_ADDR</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PER_DBG</name>
          <description>Parity Error Debug
          arity error check debug address setting</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PER_DEBUG_ADDR</name>
              <description>PER_DEBUG_ADDR</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_CTL</name>
          <description>Memory Control
          ontrols memory initialization</description>
          <addressOffset>12</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MEM_BUSY</name>
              <description>MEM_BUSY</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MEM_CLR_EN</name>
              <description>MEM_CLR_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CRYPTO</name>
      <description>DMA Crypto Core is a low power low gate count crypto core with DMA capability and local key storage.</description>
      <baseAddress>0x40024000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DMACH0CTL</name>
          <description>Channel 0 Control
          his register is used for channel enabling and priority selection. When a channel is disabled, it becomes inactive only when all ongoing requests are finished.</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIO</name>
              <description>PRIO</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACH0EXTADDR</name>
          <description>Channel 0 External Address</description>
          <addressOffset>4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDR</name>
              <description>ADDR</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACH0LEN</name>
          <description>Channel 0 DMA Length</description>
          <addressOffset>12</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMALEN</name>
              <description>DMALEN</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASTAT</name>
          <description>DMAC Status
          his register provides the actual state of each DMA channel. It also reports port errors in case these were received by the master interface module during the data transfer.</description>
          <addressOffset>24</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PORT_ERR</name>
              <description>PORT_ERR</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CH1_ACT</name>
              <description>CH1_ACT</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CH0_ACT</name>
              <description>CH0_ACT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASWRESET</name>
          <description>DMAC Software Reset
          oftware reset is used to reset the DMAC to stop all transfers and clears the port error status register. After the software reset is performed, all the channels are disabled and no new requests are performed by the channels. The DMAC waits for the existing (active) requests to finish and accordingly sets the DMASTAT.</description>
          <addressOffset>28</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SWRES</name>
              <description>SWRES</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACH1CTL</name>
          <description>Channel 1 Control
          his register is used for channel enabling and priority selection. When a channel is disabled, it becomes inactive only when all ongoing requests are finished.</description>
          <addressOffset>32</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRIO</name>
              <description>PRIO</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACH1EXTADDR</name>
          <description>Channel 1 External Address</description>
          <addressOffset>36</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ADDR</name>
              <description>ADDR</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACH1LEN</name>
          <description>Channel 1 DMA Length</description>
          <addressOffset>44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMALEN</name>
              <description>DMALEN</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMABUSCFG</name>
          <description>DMAC Master Run-time Parameters
          his register defines all the run-time parameters for the AHB master interface port. These parameters are required for the proper functioning of the EIP-101m AHB master adapter.</description>
          <addressOffset>120</addressOffset>
          <access>read-write</access>
          <resetValue>0x00002400</resetValue>
          <fields>
            <field>
              <name>AHB_MST1_BURST_SIZE</name>
              <description>AHB_MST1_BURST_SIZE</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>AHB_MST1_IDLE_EN</name>
              <description>AHB_MST1_IDLE_EN</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>AHB_MST1_INCR_EN</name>
              <description>AHB_MST1_INCR_EN</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>AHB_MST1_LOCK_EN</name>
              <description>AHB_MST1_LOCK_EN</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AHB_MST1_BIGEND</name>
              <description>AHB_MST1_BIGEND</description>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAPORTERR</name>
          <description>DMAC Port Error Raw Status
          his register provides the actual status of individual port errors. It also indicates which channel is serviced by an external AHB port (which is frozen by a port error). A port error aborts operations on all serviced channels (channel enable bit is forced to 0) and prevents further transfers via that port until the error is cleared by writing to the DMASWRESET register.</description>
          <addressOffset>124</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PORT1_AHB_ERROR</name>
              <description>PORT1_AHB_ERROR</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>PORT1_CHANNEL</name>
              <description>PORT1_CHANNEL</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAHWVER</name>
          <description>DMAC Version
          his register contains an indication (or signature) of the EIP type of this DMAC, as well as the hardware version/patch numbers.</description>
          <addressOffset>252</addressOffset>
          <access>read-only</access>
          <resetValue>0x01012ed1</resetValue>
          <fields>
            <field>
              <name>HW_MAJOR_VERSION</name>
              <description>HW_MAJOR_VERSION</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>HW_MINOR_VERSION</name>
              <description>HW_MINOR_VERSION</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>HW_PATCH_LEVEL</name>
              <description>HW_PATCH_LEVEL</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>EIP_NUMBER_COMPL</name>
              <description>EIP_NUMBER_COMPL</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>EIP_NUMBER</name>
              <description>EIP_NUMBER</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYWRITEAREA</name>
          <description>Key Store Write Area
          his register defines where the keys should be written in the key store RAM. After writing this register, the key store module is ready to receive the keys through a DMA operation. In case the key data transfer triggered an error in the key store, the error will be available in the interrupt status register after the DMA is finished. The key store write-error is asserted when the programmed/selected area is not completely written. This error is also asserted when the DMA operation writes to ram areas that are not selected.
          he key store RAM is divided into 8 areas of 128 bits.
          92-bit keys written in the key store RAM should start on boundaries of 256 bits. This means that writing a 192-bit key to the key store RAM must be done by writing 256 bits of data with the 64 most-significant bits set to 0. These bits are ignored by the AES engine.</description>
          <addressOffset>1024</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RAM_AREA7</name>
              <description>RAM_AREA7</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RAM_AREA6</name>
              <description>RAM_AREA6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RAM_AREA5</name>
              <description>RAM_AREA5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RAM_AREA4</name>
              <description>RAM_AREA4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RAM_AREA3</name>
              <description>RAM_AREA3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RAM_AREA2</name>
              <description>RAM_AREA2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RAM_AREA1</name>
              <description>RAM_AREA1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RAM_AREA0</name>
              <description>RAM_AREA0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYWRITTENAREA</name>
          <description>Key Store Written Area
          his register shows which areas of the key store RAM contain valid written keys.
          hen a new key needs to be written to the key store, on a location that is already occupied by a valid key, this key area must be cleared first. This can be done by writing this register before the new key is written to the key store memory.
          ttempting to write to a key area that already contains a valid key is not allowed and results in an error.</description>
          <addressOffset>1028</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RAM_AREA_WRITTEN7</name>
              <description>RAM_AREA_WRITTEN7</description>
              <bitRange>[7:7]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN6</name>
              <description>RAM_AREA_WRITTEN6</description>
              <bitRange>[6:6]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN5</name>
              <description>RAM_AREA_WRITTEN5</description>
              <bitRange>[5:5]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN4</name>
              <description>RAM_AREA_WRITTEN4</description>
              <bitRange>[4:4]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN3</name>
              <description>RAM_AREA_WRITTEN3</description>
              <bitRange>[3:3]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN2</name>
              <description>RAM_AREA_WRITTEN2</description>
              <bitRange>[2:2]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN1</name>
              <description>RAM_AREA_WRITTEN1</description>
              <bitRange>[1:1]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RAM_AREA_WRITTEN0</name>
              <description>RAM_AREA_WRITTEN0</description>
              <bitRange>[0:0]</bitRange>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYSIZE</name>
          <description>Key Store Size
          his register defines the size of the keys that are written with DMA. This register should be configured before writing to the KEY_STORE_WRITE_AREA register.</description>
          <addressOffset>1032</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>SIZE</name>
              <description>SIZE</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYREADAREA</name>
          <description>Key Store Read Area
          his register selects the key store RAM area from where the key needs to be read that will be used for an AES operation. The operation directly starts after writing this register. When the operation is finished, the status of the key store read operation is available in the interrupt status register. Key store read error is asserted when a RAM area is selected which does not contain valid written key.</description>
          <addressOffset>1036</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>BUSY</name>
              <description>BUSY</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>RAM_AREA</name>
              <description>RAM_AREA</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>AESKEY2%s</name>
          <description>AES_KEY2_0 / AES_GHASH_H_IN_0
          econd Key / GHASH Key (internal, but clearable)
          he following registers are not accessible through the host for reading and writing. They are used to store internally calculated key information and intermediate results. However, when the host performs a write to the any of the respective AES_KEY2_n or AES_KEY3_n addresses, respectively the whole 128-bit AES_KEY2_n or AES_KEY3_n register is cleared to 0s.
          he AES_GHASH_H_IN_n registers (required for GHASH, which is part of GCM) are mapped to the AES_KEY2_n registers. The (intermediate) authentication result for GCM and CCM is stored in the AES_KEY3_n register.</description>
          <addressOffset>1280</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AES_KEY2</name>
              <description>AES_KEY2</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>AESKEY3%s</name>
          <description>AES_KEY3_0 / AES_KEY2_4
          hird Key / Second Key (internal, but clearable)
          he following registers are not accessible through the host for reading and writing. They are used to store internally calculated key information and intermediate results. However, when the host performs a write to the any of the respective AES_KEY2_n or AES_KEY3_n addresses, respectively the whole 128-bit AES_KEY2_n or AES_KEY3_n register is cleared to 0s.
          he AES_GHASH_H_IN_n registers (required for GHASH, which is part of GCM) are mapped to the AES_KEY2_n registers. The (intermediate) authentication result for GCM and CCM is stored in the AES_KEY3_n register.</description>
          <addressOffset>1296</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AES_KEY3</name>
              <description>AES_KEY3</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>AESIV%s</name>
          <description>AES initialization vector registers
          hese registers are used to provide and read the IV from the AES engine.</description>
          <addressOffset>1344</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AES_IV</name>
              <description>AES_IV</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AESCTL</name>
          <description>AES Control

