tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          ES input/output buffer control and mode register
          his register specifies the AES mode of operation for the EIP-120t.
          lectronic codebook (ECB) mode is automatically selected if bits [28:5] of this register are all 0.</description>
          <addressOffset>1360</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <fields>
            <field>
              <name>CONTEXT_READY</name>
              <description>CONTEXT_READY</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>SAVED_CONTEXT_RDY</name>
              <description>SAVED_CONTEXT_RDY</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>SAVE_CONTEXT</name>
              <description>SAVE_CONTEXT</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CCM_M</name>
              <description>CCM_M</description>
              <bitRange>[24:22]</bitRange>
            </field>
            <field>
              <name>CCM_L</name>
              <description>CCM_L</description>
              <bitRange>[21:19]</bitRange>
            </field>
            <field>
              <name>CCM</name>
              <description>CCM</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>GCM</name>
              <description>GCM</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>CBC_MAC</name>
              <description>CBC_MAC</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CTR_WIDTH</name>
              <description>CTR_WIDTH</description>
              <bitRange>[8:7]</bitRange>
            </field>
            <field>
              <name>CTR</name>
              <description>CTR</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CBC</name>
              <description>CBC</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>KEY_SIZE</name>
              <description>KEY_SIZE</description>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>DIR</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>INPUT_READY</name>
              <description>INPUT_READY</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OUTPUT_READY</name>
              <description>OUTPUT_READY</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AESDATALEN0</name>
          <description>AES Crypto Length 0 (LSW)
          hese registers are used to write the Length values to the EIP-120t. While processing, the length values decrement to 0. If both lengths are 0, the data stream is finished and a new context is requested. For basic AES modes (ECB, CBC, and CTR), a crypto length of 0 can be written if multiple streams need to be processed with the same key. Writing 0 length results in continued data requests until a new context is written. For the other modes (CBC-MAC, GCM, and CCM) no (new) data requests are done if the length decrements to or equals 0.
          t is advised to write a new length per packet. If the length registers decrement to 0, no new data is processed until a new context or length value is written.
          hen writing a new mode without writing the length registers, the length register values from the previous context is reused.</description>
          <addressOffset>1364</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>C_LENGTH</name>
              <description>C_LENGTH</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AESDATALEN1</name>
          <description>AES Crypto Length 1 (MSW)
          hese registers are used to write the Length values to the EIP-120t. While processing, the length values decrement to 0. If both lengths are 0, the data stream is finished and a new context is requested. For basic AES modes (ECB, CBC, and CTR), a crypto length of 0 can be written if multiple streams need to be processed with the same key. Writing 0 length results in continued data requests until a new context is written. For the other modes (CBC-MAC, GCM and CCM) no (new) data requests are done if the length decrements to or equals 0.
          t is advised to write a new length per packet. If the length registers decrement to 0, no new data is processed until a new context or length value is written.
          hen writing a new mode without writing the length registers, the length register values from the previous context is reused.</description>
          <addressOffset>1368</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>C_LENGTH</name>
              <description>C_LENGTH</description>
              <bitRange>[28:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AESAUTHLEN</name>
          <description>AES Authentication Length</description>
          <addressOffset>1372</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AUTH_LENGTH</name>
              <description>AUTH_LENGTH</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AESDATAOUT0</name>
          <description>Data Input/Output</description>
          <addressOffset>1376</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>DATA</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AESDATAIN0</name>
          <description>AES Data Input_Output 0
          he data registers are typically accessed through the DMA and not with host writes and/or reads. However, for debugging purposes the data input/output registers can be accessed via host write and read operations. The registers are used to buffer the input/output data blocks to/from the EIP-120t.
          ote: The data input buffer (AES_DATA_IN_n) and data output buffer (AES_DATA_OUT_n) are mapped to the same address locations.
          rites (both DMA and host) to these addresses load the Input Buffer while reads pull from the Output Buffer. Therefore, for write access, the data input buffer is written; for read access, the data output buffer is read. The data input buffer must be written before starting an operation. The data output buffer contains valid data on completion of an operation. Therefore, any 128-bit data block can be split over multiple 32-bit word transfers; these can be mixed with other host transfers over the external interface.</description>
          <addressOffset>1376</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AES_DATA_IN_OUT</name>
              <description>AES_DATA_IN_OUT</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AESDATAOUT1</name>
          <description>Data Input/Output</description>
          <addressOffset>1380</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>DATA</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AESDATAIN1</name>
          <description>AES Data Input_Output 0
          he data registers are typically accessed through the DMA and not with host writes and/or reads. However, for debugging purposes the data input/output registers can be accessed via host write and read operations. The registers are used to buffer the input/output data blocks to/from the EIP-120t.
          ote: The data input buffer (AES_DATA_IN_n) and data output buffer (AES_DATA_OUT_n) are mapped to the same address locations.
          rites (both DMA and host) to these addresses load the Input Buffer while reads pull from the Output Buffer. Therefore, for write access, the data input buffer is written; for read access, the data output buffer is read. The data input buffer must be written before starting an operation. The data output buffer contains valid data on completion of an operation. Therefore, any 128-bit data block can be split over multiple 32-bit word transfers; these can be mixed with other host transfers over the external interface.</description>
          <addressOffset>1380</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AES_DATA_IN_OUT</name>
              <description>AES_DATA_IN_OUT</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AESDATAOUT2</name>
          <description>Data Input/Output</description>
          <addressOffset>1384</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>DATA</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AESDATAIN2</name>
          <description>AES Data Input_Output 2
          he data registers are typically accessed via DMA and not with host writes and/or reads. However, for debugging purposes the Data Input/Output Registers can be accessed via host write and read operations. The registers are used to buffer the input/output data blocks to/from the EIP-120t.
          ote: The data input buffer (AES_DATA_IN_n) and data output buffer (AES_DATA_OUT_n) are mapped to the same address locations.
          rites (both DMA and host) to these addresses load the Input Buffer while reads pull from the Output Buffer. Therefore, for write access, the data input buffer is written; for read access, the data output buffer is read. The data input buffer must be written before starting an operation. The data output buffer contains valid data on completion of an operation. Therefore, any 128-bit data block can be split over multiple 32-bit word transfers; these can be mixed with other host transfers over the external interface.</description>
          <addressOffset>1384</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AES_DATA_IN_OUT</name>
              <description>AES_DATA_IN_OUT</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AESDATAOUT3</name>
          <description>Data Input/Output</description>
          <addressOffset>1388</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>DATA</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AESDATAIN3</name>
          <description>AES Data Input_Output 3
          he data registers are typically accessed via DMA and not with host writes and/or reads. However, for debugging purposes the Data Input/Output Registers can be accessed via host write and read operations. The registers are used to buffer the input/output data blocks to/from the EIP-120t.
          ote: The data input buffer (AES_DATA_IN_n) and data output buffer (AES_DATA_OUT_n) are mapped to the same address locations.
          rites (both DMA and host) to these addresses load the Input Buffer while reads pull from the Output Buffer. Therefore, for write access, the data input buffer is written; for read access, the data output buffer is read. The data input buffer must be written before starting an operation. The data output buffer contains valid data on completion of an operation. Therefore, any 128-bit data block can be split over multiple 32-bit word transfers; these can be mixed with other host transfers over the external interface.</description>
          <addressOffset>1388</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AES_DATA_IN_OUT</name>
              <description>AES_DATA_IN_OUT</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>AESTAGOUT%s</name>
          <description>AES Tag Out 0
          he tag registers can be accessed via DMA or directly with host reads.
          hese registers buffer the TAG from the EIP-120t. The registers are shared with the intermediate authentication result registers, but cannot be read until the processing is finished. While processing, a read from these registers returns 0s. If an operation does not return a TAG, reading from these registers returns an IV. If an operation returns a TAG plus an IV and both need to be read by the host, the host must first read the TAG followed by the IV. Reading these in reverse order will return the IV twice.</description>
          <addressOffset>1392</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AES_TAG</name>
              <description>AES_TAG</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN1</name>
          <description>HASH Data Input 1
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1540</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN2</name>
          <description>HASH Data Input 2 
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1544</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN3</name>
          <description>HASH Data Input 3
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1548</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN4</name>
          <description>HASH Data Input 4
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1552</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN5</name>
          <description>HASH Data Input 5
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1556</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN6</name>
          <description>HASH Data Input 6
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1560</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN7</name>
          <description>HASH Data Input 7
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1564</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN8</name>
          <description>HASH Data Input 8 
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1568</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN9</name>
          <description>HASH Data Input 9
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1572</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN10</name>
          <description>HASH Data Input 10
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1576</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN11</name>
          <description>HASH Data Input 11
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1580</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN12</name>
          <description>HASH Data Input 12
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1584</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN13</name>
          <description>HASH Data Input 13
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1588</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN14</name>
          <description>HASH Data Input 14
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1592</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN15</name>
          <description>HASH Data Input 15
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1596</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
