tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>HASHDATAIN16</name>
          <description>HASH Data Input 16
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1600</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN17</name>
          <description>HASH Data Input 17
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1604</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN18</name>
          <description>HASH Data Input 18
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1608</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN19</name>
          <description>HASH Data Input 19
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1612</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN20</name>
          <description>HASH Data Input 20
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1616</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN21</name>
          <description>HASH Data Input 21
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1620</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN22</name>
          <description>HASH Data Input 22
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1624</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN23</name>
          <description>HASH Data Input 23
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1628</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN24</name>
          <description>HASH Data Input 24
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1632</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN25</name>
          <description>HASH Data Input 25
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1636</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN26</name>
          <description>HASH Data Input 26
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1640</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN27</name>
          <description>HASH Data Input 27
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1644</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN28</name>
          <description>HASH Data Input 28
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1648</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN29</name>
          <description>HASH Data Input 29
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1652</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN30</name>
          <description>HASH Data Input 30
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1656</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDATAIN31</name>
          <description>HASH Data Input 31
          he data input registers should be used to provide input data to the hash module through the slave interface.</description>
          <addressOffset>1660</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DATA_IN</name>
              <description>HASH_DATA_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHIOBUFCTRL</name>
          <description>HASH Input_Output Buffer Control
          his register pair shares a single address location and contains bits that control and monitor the data flow between the host and the hash engine.</description>
          <addressOffset>1664</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>PAD_DMA_MESSAGE</name>
              <description>PAD_DMA_MESSAGE</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>GET_DIGEST</name>
              <description>GET_DIGEST</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PAD_MESSAGE</name>
              <description>PAD_MESSAGE</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RFD_IN</name>
              <description>RFD_IN</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DATA_IN_AV</name>
              <description>DATA_IN_AV</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OUTPUT_FULL</name>
              <description>OUTPUT_FULL</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHMODE</name>
          <description>HASH Mode</description>
          <addressOffset>1668</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SHA384_MODE</name>
              <description>SHA384_MODE</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SHA512_MODE</name>
              <description>SHA512_MODE</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SHA224_MODE</name>
              <description>SHA224_MODE</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SHA256_MODE</name>
              <description>SHA256_MODE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NEW_HASH</name>
              <description>NEW_HASH</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHINLENL</name>
          <description>HASH Input Length LSB</description>
          <addressOffset>1672</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LENGTH_IN</name>
              <description>LENGTH_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHINLENH</name>
          <description>HASH Input Length MSB</description>
          <addressOffset>1676</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LENGTH_IN</name>
              <description>LENGTH_IN</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDIGESTA</name>
          <description>HASH Digest A
          he hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <addressOffset>1728</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>HASH_DIGEST</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDIGESTB</name>
          <description>HASH Digest B
          he hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <addressOffset>1732</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>HASH_DIGEST</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDIGESTC</name>
          <description>HASH Digest C
          he hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <addressOffset>1736</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>HASH_DIGEST</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDIGESTD</name>
          <description>HASH Digest D
          he hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <addressOffset>1740</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>HASH_DIGEST</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDIGESTE</name>
          <description>HASH Digest E
          he hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <addressOffset>1744</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>HASH_DIGEST</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDIGESTF</name>
          <description>HASH Digest F
          he hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <addressOffset>1748</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>HASH_DIGEST</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDIGESTG</name>
          <description>HASH Digest G
          he hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <addressOffset>1752</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>HASH_DIGEST</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDIGESTH</name>
          <description>HASH Digest H
          he hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <addressOffset>1756</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>HASH_DIGEST</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDIGESTI</name>
          <description>HASH Digest I
          he hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <addressOffset>1760</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>HASH_DIGEST</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDIGESTJ</name>
          <description>HASH Digest J
          he hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <addressOffset>1764</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>HASH_DIGEST</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDIGESTK</name>
          <description>HASH Digest K
          he hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <addressOffset>1768</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>HASH_DIGEST</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDIGESTL</name>
          <description>HASH Digest L
          he hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <addressOffset>1772</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>HASH_DIGEST</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDIGESTM</name>
          <description>HASH Digest M
          he hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <addressOffset>1776</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>HASH_DIGEST</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDIGESTN</name>
          <description>HASH Digest N
          he hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <addressOffset>1780</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>HASH_DIGEST</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
