tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>HASHDIGESTO</name>
          <description>HASH Digest 0
          he hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <addressOffset>1784</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>HASH_DIGEST</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHDIGESTP</name>
          <description>HASH Digest P
          he hash digest registers consist of eight 32-bit registers, named HASH_DIGEST_A to HASH_DIGEST_H. After processing a message, the output digest can be read from these registers. These registers can be written with an intermediate hash result for continued hash operations.</description>
          <addressOffset>1788</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HASH_DIGEST</name>
              <description>HASH_DIGEST</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALGSEL</name>
          <description>Algorithm Select
          his algorithm selection register configures the internal destination of the DMA controller.</description>
          <addressOffset>1792</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TAG</name>
              <description>TAG</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>HASH_SHA_512</name>
              <description>HASH_SHA_512</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HASH_SHA_256</name>
              <description>HASH_SHA_256</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>AES</name>
              <description>AES</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>KEY_STORE</name>
              <description>KEY_STORE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAPROTCTL</name>
          <description>DMA Protection Control

          aster PROT privileged access enable
          his register enables the second bit (bit [1]) of the AHB HPROT bus of the AHB master interface when a read action of key(s) is performed on the AHB master interface for writing keys into the store module.</description>
          <addressOffset>1796</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PROT_EN</name>
              <description>PROT_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SWRESET</name>
          <description>Software Reset</description>
          <addressOffset>1856</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SW_RESET</name>
              <description>SW_RESET</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQTYPE</name>
          <description>Control Interrupt Configuration</description>
          <addressOffset>1920</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LEVEL</name>
              <description>LEVEL</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQEN</name>
          <description>Control Interrupt Enable</description>
          <addressOffset>1924</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMA_IN_DONE</name>
              <description>DMA_IN_DONE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RESULT_AVAIL</name>
              <description>RESULT_AVAIL</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQCLR</name>
          <description>Control Interrupt Clear</description>
          <addressOffset>1928</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMA_BUS_ERR</name>
              <description>DMA_BUS_ERR</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>KEY_ST_WR_ERR</name>
              <description>KEY_ST_WR_ERR</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>KEY_ST_RD_ERR</name>
              <description>KEY_ST_RD_ERR</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>DMA_IN_DONE</name>
              <description>DMA_IN_DONE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RESULT_AVAIL</name>
              <description>RESULT_AVAIL</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQSET</name>
          <description>Control Interrupt Set</description>
          <addressOffset>1932</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMA_IN_DONE</name>
              <description>DMA_IN_DONE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RESULT_AVAIL</name>
              <description>RESULT_AVAIL</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQSTAT</name>
          <description>Control Interrupt Status</description>
          <addressOffset>1936</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMA_BUS_ERR</name>
              <description>DMA_BUS_ERR</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>KEY_ST_WR_ERR</name>
              <description>KEY_ST_WR_ERR</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>KEY_ST_RD_ERR</name>
              <description>KEY_ST_RD_ERR</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>DMA_IN_DONE</name>
              <description>DMA_IN_DONE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RESULT_AVAIL</name>
              <description>RESULT_AVAIL</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HWVER</name>
          <description>Hardware Version</description>
          <addressOffset>2044</addressOffset>
          <access>read-only</access>
          <resetValue>0x92008778</resetValue>
          <fields>
            <field>
              <name>HW_MAJOR_VER</name>
              <description>HW_MAJOR_VER</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>HW_MINOR_VER</name>
              <description>HW_MINOR_VER</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>HW_PATCH_LVL</name>
              <description>HW_PATCH_LVL</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>VER_NUM_COMPL</name>
              <description>VER_NUM_COMPL</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>VER_NUM</name>
              <description>VER_NUM</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
