tyropyro/CC1312tester/cc1312/cpu-mmap.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EVENT</name>
      <description>Event Fabric Component Definition</description>
      <baseAddress>0x40083000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>AON_GPIO_INT</name>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>I2C_INT</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>RFC_CPE_1</name>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>PKA_IRQ</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>AON_RTC_COMB</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>UART0_COMB</name>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>AUX_SWEV0</name>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>SSI0_COMB</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>SSI1_COMB</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>RFC_CPE_0</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>RFC_HW_COMB</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>RFC_CMD_ACK</name>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>I2S_IRQ</name>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>AUX_SWEV1</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>WDT_IRQ</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>GPT0A</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>GPT0B</name>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>GPT1A</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>GPT1B</name>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>GPT2A</name>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>GPT2B</name>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>GPT3A</name>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>GPT3B</name>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>CRYPTO_RESULT_AVAIL_IRQ</name>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>DMA_DONE_COMB</name>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>DMA_ERR</name>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>FLASH</name>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>SWEV0</name>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>AUX_COMB</name>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>AON_PROG0</name>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>PROG0</name>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>AUX_COMPA</name>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>AUX_ADC_IRQ</name>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>TRNG_IRQ</name>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>OSC_COMB</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>AUX_TIMER2_EV0</name>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>UART1_COMB</name>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>BATMON_COMB</name>
        <value>53</value>
      </interrupt>
      <registers>
        <register>
          <name>CPUIRQSEL0</name>
          <description>Output Selection for CPU Interrupt 0</description>
          <addressOffset>0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL1</name>
          <description>Output Selection for CPU Interrupt 1</description>
          <addressOffset>4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000009</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL2</name>
          <description>Output Selection for CPU Interrupt 2</description>
          <addressOffset>8</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001e</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL3</name>
          <description>Output Selection for CPU Interrupt 3</description>
          <addressOffset>12</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001f</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL4</name>
          <description>Output Selection for CPU Interrupt 4</description>
          <addressOffset>16</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL5</name>
          <description>Output Selection for CPU Interrupt 5</description>
          <addressOffset>20</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000024</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL6</name>
          <description>Output Selection for CPU Interrupt 6</description>
          <addressOffset>24</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001c</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL7</name>
          <description>Output Selection for CPU Interrupt 7</description>
          <addressOffset>28</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000022</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL8</name>
          <description>Output Selection for CPU Interrupt 8</description>
          <addressOffset>32</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000023</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL9</name>
          <description>Output Selection for CPU Interrupt 9</description>
          <addressOffset>36</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001b</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL10</name>
          <description>Output Selection for CPU Interrupt 10</description>
          <addressOffset>40</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001a</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL11</name>
          <description>Output Selection for CPU Interrupt 11</description>
          <addressOffset>44</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000019</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL12</name>
          <description>Output Selection for CPU Interrupt 12</description>
          <addressOffset>48</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL13</name>
          <description>Output Selection for CPU Interrupt 13</description>
          <addressOffset>52</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001d</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL14</name>
          <description>Output Selection for CPU Interrupt 14</description>
          <addressOffset>56</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000018</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL15</name>
          <description>Output Selection for CPU Interrupt 15</description>
          <addressOffset>60</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL16</name>
          <description>Output Selection for CPU Interrupt 16</description>
          <addressOffset>64</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000011</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL17</name>
          <description>Output Selection for CPU Interrupt 17</description>
          <addressOffset>68</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000012</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL18</name>
          <description>Output Selection for CPU Interrupt 18</description>
          <addressOffset>72</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000013</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL19</name>
          <description>Output Selection for CPU Interrupt 19</description>
          <addressOffset>76</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000000c</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL20</name>
          <description>Output Selection for CPU Interrupt 20</description>
          <addressOffset>80</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000000d</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL21</name>
          <description>Output Selection for CPU Interrupt 21</description>
          <addressOffset>84</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000000e</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL22</name>
          <description>Output Selection for CPU Interrupt 22</description>
          <addressOffset>88</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000000f</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL23</name>
          <description>Output Selection for CPU Interrupt 23</description>
          <addressOffset>92</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000005d</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL24</name>
          <description>Output Selection for CPU Interrupt 24</description>
          <addressOffset>96</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000027</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL25</name>
          <description>Output Selection for CPU Interrupt 25</description>
          <addressOffset>100</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000026</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL26</name>
          <description>Output Selection for CPU Interrupt 26</description>
          <addressOffset>104</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000015</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL27</name>
          <description>Output Selection for CPU Interrupt 27</description>
          <addressOffset>108</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000064</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL28</name>
          <description>Output Selection for CPU Interrupt 28</description>
          <addressOffset>112</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000000b</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL29</name>
          <description>Output Selection for CPU Interrupt 29</description>
          <addressOffset>116</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL30</name>
          <description>Output Selection for CPU Interrupt 30</description>
          <addressOffset>120</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL31</name>
          <description>Output Selection for CPU Interrupt 31</description>
          <addressOffset>124</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000006a</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL32</name>
          <description>Output Selection for CPU Interrupt 32</description>
          <addressOffset>128</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000073</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL33</name>
          <description>Output Selection for CPU Interrupt 33</description>
          <addressOffset>132</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000068</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL34</name>
          <description>Output Selection for CPU Interrupt 34</description>
          <addressOffset>136</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000006</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL35</name>
          <description>Output Selection for CPU Interrupt 35</description>
          <addressOffset>140</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000038</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL36</name>
          <description>Output Selection for CPU Interrupt 36</description>
          <addressOffset>144</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000025</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUIRQSEL37</name>
          <description>Output Selection for CPU Interrupt 37</description>
          <addressOffset>148</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RFCSEL0</name>
          <description>Output Selection for RFC Event 0</description>
          <addressOffset>256</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000003d</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RFCSEL1</name>
          <description>Output Selection for RFC Event 1</description>
          <addressOffset>260</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000003e</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RFCSEL2</name>
          <description>Output Selection for RFC Event 2</description>
          <addressOffset>264</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000003f</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RFCSEL3</name>
          <description>Output Selection for RFC Event 3</description>
          <addressOffset>268</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
