tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          MA_DONE for the corresponding DMA channel is available as interrupt on GPT0 as GPT0:RIS.DMABRIS</description>
          <addressOffset>1360</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000046</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH10BSEL</name>
          <description>Output Selection for DMA Channel 10 REQ

          MA_DONE for the corresponding DMA channel is available as interrupt on GPT0 as GPT0:RIS.DMABRIS</description>
          <addressOffset>1364</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000004e</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH11SSEL</name>
          <description>Output Selection for DMA Channel 11 SREQ

          MA_DONE for the corresponding DMA channel is available as interrupt on GPT1 as GPT1:RIS.DMAARIS</description>
          <addressOffset>1368</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000047</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH11BSEL</name>
          <description>Output Selection for DMA Channel 11 REQ

          MA_DONE for the corresponding DMA channel is available as interrupt on GPT1 as GPT1:RIS.DMAARIS</description>
          <addressOffset>1372</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000004f</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH12SSEL</name>
          <description>Output Selection for DMA Channel 12 SREQ

          MA_DONE for the corresponding DMA channel is available as interrupt on GPT1 as GPT1:RIS.DMABRIS</description>
          <addressOffset>1376</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000048</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH12BSEL</name>
          <description>Output Selection for DMA Channel 12 REQ

          MA_DONE for the corresponding DMA channel is available as interrupt on GPT1 as GPT1:RIS.DMABRIS</description>
          <addressOffset>1380</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000050</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH13BSEL</name>
          <description>Output Selection for DMA Channel 13 REQ</description>
          <addressOffset>1388</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH14BSEL</name>
          <description>Output Selection for DMA Channel 14 REQ</description>
          <addressOffset>1396</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH15BSEL</name>
          <description>Output Selection for DMA Channel 15 REQ</description>
          <addressOffset>1404</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000007</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH16SSEL</name>
          <description>Output Selection for DMA Channel 16 SREQ</description>
          <addressOffset>1408</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000002d</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH16BSEL</name>
          <description>Output Selection for DMA Channel 16 REQ</description>
          <addressOffset>1412</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000002c</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH17SSEL</name>
          <description>Output Selection for DMA Channel 17 SREQ</description>
          <addressOffset>1416</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000002f</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH17BSEL</name>
          <description>Output Selection for DMA Channel 17 REQ</description>
          <addressOffset>1420</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000002e</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH21SSEL</name>
          <description>Output Selection for DMA Channel 21 SREQ</description>
          <addressOffset>1448</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000064</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH21BSEL</name>
          <description>Output Selection for DMA Channel 21 REQ</description>
          <addressOffset>1452</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000064</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH22SSEL</name>
          <description>Output Selection for DMA Channel 22 SREQ</description>
          <addressOffset>1456</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000065</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH22BSEL</name>
          <description>Output Selection for DMA Channel 22 REQ</description>
          <addressOffset>1460</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000065</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH23SSEL</name>
          <description>Output Selection for DMA Channel 23 SREQ</description>
          <addressOffset>1464</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000066</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH23BSEL</name>
          <description>Output Selection for DMA Channel 23 REQ</description>
          <addressOffset>1468</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000066</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH24SSEL</name>
          <description>Output Selection for DMA Channel 24 SREQ</description>
          <addressOffset>1472</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000067</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UDMACH24BSEL</name>
          <description>Output Selection for DMA Channel 24 REQ</description>
          <addressOffset>1476</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000067</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPT3ACAPTSEL</name>
          <description>Output Selection for GPT3 0</description>
          <addressOffset>1536</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000005b</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPT3BCAPTSEL</name>
          <description>Output Selection for GPT3 1</description>
          <addressOffset>1540</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000005c</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXSEL0</name>
          <description>Output Selection for AUX Subscriber 0</description>
          <addressOffset>1792</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CM3NMISEL0</name>
          <description>Output Selection for NMI Subscriber 0</description>
          <addressOffset>2048</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000063</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2SSTMPSEL0</name>
          <description>Output Selection for I2S Subscriber 0</description>
          <addressOffset>2304</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000005f</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FRZSEL0</name>
          <description>Output Selection for FRZ Subscriber
          he halted debug signal is passed to peripherals such as the General Purpose Timer, Sensor Controller with Digital and Analog Peripherals (AUX), Radio, and RTC. When the system CPU halts, the connected peripherals that have freeze enabled also halt. The programmable output can be set to static values of 0 or 1, and can also be set to pass the halted signal.</description>
          <addressOffset>2560</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000078</resetValue>
          <fields>
            <field>
              <name>EV</name>
              <description>EV</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SWEV</name>
          <description>Set or Clear Software Events</description>
          <addressOffset>3840</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SWEV3</name>
              <description>SWEV3</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SWEV2</name>
              <description>SWEV2</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SWEV1</name>
              <description>SWEV1</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SWEV0</name>
              <description>SWEV0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
