tyropyro/CC1312tester/cc1312/cpu-mmap.svd
          his register accesses status bits when read and control bits when written. When read, the status register indicates the state of the I2C bus controller as stated in MSTAT. When written, the control register configures the I2C controller operation.

          o generate a single transmit cycle, the I2C Master Slave Address (MSA) register is written with the desired address, the MSA.RS bit is cleared, and this register is written with 
* ACK=X (0 or 1), 
* STOP=1, 
* START=1, 
* RUN=1 
          o perform the operation and stop. 
          hen the operation is completed (or aborted due an error), an interrupt becomes active and the data may be read from the MDR register.</description>
          <addressOffset>2052</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ACK</name>
              <description>ACK</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>STOP</name>
              <description>STOP</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>START</name>
              <description>START</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RUN</name>
              <description>RUN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MDR</name>
          <description>Master Data
          his register contains the data to be transmitted when in the Master Transmit state and the data received when in the Master Receive state.</description>
          <addressOffset>2056</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA</name>
              <description>DATA</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MTPR</name>
          <description>I2C Master Timer Period
          his register specifies the period of the SCL clock.</description>
          <addressOffset>2060</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>TPR_7</name>
              <description>TPR_7</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TPR</name>
              <description>TPR</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIMR</name>
          <description>Master Interrupt Mask
          his register controls whether a raw interrupt is promoted to a controller interrupt.</description>
          <addressOffset>2064</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IM</name>
              <description>IM</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MRIS</name>
          <description>Master Raw Interrupt Status
          his register show the unmasked interrupt status.</description>
          <addressOffset>2068</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RIS</name>
              <description>RIS</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MMIS</name>
          <description>Master Masked Interrupt Status
          his register show which interrupt is active (based on result from MRIS and MIMR).</description>
          <addressOffset>2072</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MIS</name>
              <description>MIS</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MICR</name>
          <description>Master Interrupt Clear
          his register clears the raw and masked interrupt.</description>
          <addressOffset>2076</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IC</name>
              <description>IC</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MCR</name>
          <description>Master Configuration
          his register configures the mode (Master or Slave) and sets the interface for test mode loopback.</description>
          <addressOffset>2080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SFE</name>
              <description>SFE</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>MFE</name>
              <description>MFE</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LPBK</name>
              <description>LPBK</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>I2S0</name>
      <description>I2S Audio DMA module supporting formats I2S, LJF, RJF and DSP</description>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>AIFWCLKSRC</name>
          <description>WCLK Source Selection</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WCLK_INV</name>
              <description>WCLK_INV</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>WCLK_SRC</name>
              <description>WCLK_SRC</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AIFDMACFG</name>
          <description>DMA Buffer Size Configuration</description>
          <addressOffset>4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>END_FRAME_IDX</name>
              <description>END_FRAME_IDX</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AIFDIRCFG</name>
          <description>Pin Direction</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AD1</name>
              <description>AD1</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>AD0</name>
              <description>AD0</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AIFFMTCFG</name>
          <description>Serial Interface Format Configuration</description>
          <addressOffset>12</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000170</resetValue>
          <fields>
            <field>
              <name>DATA_DELAY</name>
              <description>DATA_DELAY</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>MEM_LEN_24</name>
              <description>MEM_LEN_24</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SMPL_EDGE</name>
              <description>SMPL_EDGE</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DUAL_PHASE</name>
              <description>DUAL_PHASE</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>WORD_LEN</name>
              <description>WORD_LEN</description>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AIFWMASK0</name>
          <description>Word Selection Bit Mask for Pin 0</description>
          <addressOffset>16</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>MASK</name>
              <description>MASK</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AIFWMASK1</name>
          <description>Word Selection Bit Mask for Pin 1</description>
          <addressOffset>20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>MASK</name>
              <description>MASK</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AIFPWMVALUE</name>
          <description>Audio Interface PWM Debug Value</description>
          <addressOffset>28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PULSE_WIDTH</name>
              <description>PULSE_WIDTH</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AIFINPTRNEXT</name>
          <description>DMA Input Buffer Next Pointer</description>
          <addressOffset>32</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PTR</name>
              <description>PTR</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AIFINPTR</name>
          <description>DMA Input Buffer Current Pointer</description>
          <addressOffset>36</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PTR</name>
              <description>PTR</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AIFOUTPTRNEXT</name>
          <description>DMA Output Buffer Next Pointer</description>
          <addressOffset>40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PTR</name>
              <description>PTR</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AIFOUTPTR</name>
          <description>DMA Output Buffer Current Pointer</description>
          <addressOffset>44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PTR</name>
              <description>PTR</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STMPCTL</name>
          <description>Samplestamp Generator Control Register</description>
          <addressOffset>52</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OUT_RDY</name>
              <description>OUT_RDY</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>IN_RDY</name>
              <description>IN_RDY</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>STMP_EN</name>
              <description>STMP_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STMPXCNTCAPT0</name>
          <description>Captured XOSC Counter Value, Capture Channel 0</description>
          <addressOffset>56</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CAPT_VALUE</name>
              <description>CAPT_VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STMPXPER</name>
          <description>XOSC Period Value</description>
          <addressOffset>60</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STMPWCNTCAPT0</name>
          <description>Captured WCLK Counter Value, Capture Channel 0</description>
          <addressOffset>64</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CAPT_VALUE</name>
              <description>CAPT_VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STMPWPER</name>
          <description>WCLK Counter Period Value</description>
          <addressOffset>68</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STMPINTRIG</name>
          <description>WCLK Counter Trigger Value for Input Pins</description>
          <addressOffset>72</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IN_START_WCNT</name>
              <description>IN_START_WCNT</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STMPOUTTRIG</name>
          <description>WCLK Counter Trigger Value for Output Pins</description>
          <addressOffset>76</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OUT_START_WCNT</name>
              <description>OUT_START_WCNT</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STMPWSET</name>
          <description>WCLK Counter Set Operation</description>
          <addressOffset>80</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STMPWADD</name>
          <description>WCLK Counter Add Operation</description>
          <addressOffset>84</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE_INC</name>
              <description>VALUE_INC</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STMPXPERMIN</name>
          <description>XOSC Minimum Period Value
          inimum Value of STMPXPER</description>
          <addressOffset>88</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000ffff</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STMPWCNT</name>
          <description>Current Value of WCNT</description>
          <addressOffset>92</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CURR_VALUE</name>
              <description>CURR_VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STMPXCNT</name>
          <description>Current Value of XCNT</description>
          <addressOffset>96</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CURR_VALUE</name>
              <description>CURR_VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STMPXCNTCAPT1</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>100</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CAPT_VALUE</name>
              <description>CAPT_VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STMPWCNTCAPT1</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>104</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CAPT_VALUE</name>
              <description>CAPT_VALUE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQMASK</name>
          <description>Interrupt Mask Register

          elects mask states of the flags in IRQFLAGS that contribute to the I2S_IRQ event.</description>
          <addressOffset>112</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AIF_DMA_IN</name>
              <description>AIF_DMA_IN</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AIF_DMA_OUT</name>
              <description>AIF_DMA_OUT</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>WCLK_TIMEOUT</name>
              <description>WCLK_TIMEOUT</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BUS_ERR</name>
              <description>BUS_ERR</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>WCLK_ERR</name>
              <description>WCLK_ERR</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PTR_ERR</name>
              <description>PTR_ERR</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQFLAGS</name>
          <description>Raw Interrupt Status Register</description>
          <addressOffset>116</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AIF_DMA_IN</name>
              <description>AIF_DMA_IN</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AIF_DMA_OUT</name>
              <description>AIF_DMA_OUT</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>WCLK_TIMEOUT</name>
              <description>WCLK_TIMEOUT</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BUS_ERR</name>
              <description>BUS_ERR</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>WCLK_ERR</name>
              <description>WCLK_ERR</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PTR_ERR</name>
              <description>PTR_ERR</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQSET</name>
          <description>Interrupt Set Register</description>
          <addressOffset>120</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AIF_DMA_IN</name>
              <description>AIF_DMA_IN</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AIF_DMA_OUT</name>
              <description>AIF_DMA_OUT</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>WCLK_TIMEOUT</name>
              <description>WCLK_TIMEOUT</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BUS_ERR</name>
              <description>BUS_ERR</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>WCLK_ERR</name>
              <description>WCLK_ERR</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PTR_ERR</name>
              <description>PTR_ERR</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
