tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>IRQCLR</name>
          <description>Interrupt Clear Register</description>
          <addressOffset>124</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AIF_DMA_IN</name>
              <description>AIF_DMA_IN</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AIF_DMA_OUT</name>
              <description>AIF_DMA_OUT</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>WCLK_TIMEOUT</name>
              <description>WCLK_TIMEOUT</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BUS_ERR</name>
              <description>BUS_ERR</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>WCLK_ERR</name>
              <description>WCLK_ERR</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PTR_ERR</name>
              <description>PTR_ERR</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>IOC</name>
      <description>IO Controller (IOC) - configures all the DIOs and resides in the MCU domain.</description>
      <baseAddress>0x40081000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IOCFG0</name>
          <description>Configuration of DIO0</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00006000</resetValue>
          <fields>
            <field>
              <name>HYST_EN</name>
              <description>HYST_EN</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>WU_CFG</name>
              <description>WU_CFG</description>
              <bitRange>[28:27]</bitRange>
            </field>
            <field>
              <name>IOMODE</name>
              <description>IOMODE</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG2_EN</name>
              <description>IOEV_AON_PROG2_EN</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG1_EN</name>
              <description>IOEV_AON_PROG1_EN</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG0_EN</name>
              <description>IOEV_AON_PROG0_EN</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EDGE_IRQ_EN</name>
              <description>EDGE_IRQ_EN</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EDGE_DET</name>
              <description>EDGE_DET</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PULL_CTL</name>
              <description>PULL_CTL</description>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>SLEW_RED</name>
              <description>SLEW_RED</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IOCURR</name>
              <description>IOCURR</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IOSTR</name>
              <description>IOSTR</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IOEV_RTC_EN</name>
              <description>IOEV_RTC_EN</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IOEV_MCU_WU_EN</name>
              <description>IOEV_MCU_WU_EN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PORT_ID</name>
              <description>PORT_ID</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCFG1</name>
          <description>Configuration of DIO1</description>
          <addressOffset>4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00006000</resetValue>
          <fields>
            <field>
              <name>HYST_EN</name>
              <description>HYST_EN</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>WU_CFG</name>
              <description>WU_CFG</description>
              <bitRange>[28:27]</bitRange>
            </field>
            <field>
              <name>IOMODE</name>
              <description>IOMODE</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG2_EN</name>
              <description>IOEV_AON_PROG2_EN</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG1_EN</name>
              <description>IOEV_AON_PROG1_EN</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG0_EN</name>
              <description>IOEV_AON_PROG0_EN</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EDGE_IRQ_EN</name>
              <description>EDGE_IRQ_EN</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EDGE_DET</name>
              <description>EDGE_DET</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PULL_CTL</name>
              <description>PULL_CTL</description>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>SLEW_RED</name>
              <description>SLEW_RED</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IOCURR</name>
              <description>IOCURR</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IOSTR</name>
              <description>IOSTR</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IOEV_RTC_EN</name>
              <description>IOEV_RTC_EN</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IOEV_MCU_WU_EN</name>
              <description>IOEV_MCU_WU_EN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PORT_ID</name>
              <description>PORT_ID</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCFG2</name>
          <description>Configuration of DIO2</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00006000</resetValue>
          <fields>
            <field>
              <name>HYST_EN</name>
              <description>HYST_EN</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>WU_CFG</name>
              <description>WU_CFG</description>
              <bitRange>[28:27]</bitRange>
            </field>
            <field>
              <name>IOMODE</name>
              <description>IOMODE</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG2_EN</name>
              <description>IOEV_AON_PROG2_EN</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG1_EN</name>
              <description>IOEV_AON_PROG1_EN</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG0_EN</name>
              <description>IOEV_AON_PROG0_EN</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EDGE_IRQ_EN</name>
              <description>EDGE_IRQ_EN</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EDGE_DET</name>
              <description>EDGE_DET</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PULL_CTL</name>
              <description>PULL_CTL</description>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>SLEW_RED</name>
              <description>SLEW_RED</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IOCURR</name>
              <description>IOCURR</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IOSTR</name>
              <description>IOSTR</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IOEV_RTC_EN</name>
              <description>IOEV_RTC_EN</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IOEV_MCU_WU_EN</name>
              <description>IOEV_MCU_WU_EN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PORT_ID</name>
              <description>PORT_ID</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCFG3</name>
          <description>Configuration of DIO3</description>
          <addressOffset>12</addressOffset>
          <access>read-write</access>
          <resetValue>0x00006000</resetValue>
          <fields>
            <field>
              <name>HYST_EN</name>
              <description>HYST_EN</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>WU_CFG</name>
              <description>WU_CFG</description>
              <bitRange>[28:27]</bitRange>
            </field>
            <field>
              <name>IOMODE</name>
              <description>IOMODE</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG2_EN</name>
              <description>IOEV_AON_PROG2_EN</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG1_EN</name>
              <description>IOEV_AON_PROG1_EN</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG0_EN</name>
              <description>IOEV_AON_PROG0_EN</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EDGE_IRQ_EN</name>
              <description>EDGE_IRQ_EN</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EDGE_DET</name>
              <description>EDGE_DET</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PULL_CTL</name>
              <description>PULL_CTL</description>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>SLEW_RED</name>
              <description>SLEW_RED</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IOCURR</name>
              <description>IOCURR</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IOSTR</name>
              <description>IOSTR</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IOEV_RTC_EN</name>
              <description>IOEV_RTC_EN</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IOEV_MCU_WU_EN</name>
              <description>IOEV_MCU_WU_EN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PORT_ID</name>
              <description>PORT_ID</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCFG4</name>
          <description>Configuration of DIO4</description>
          <addressOffset>16</addressOffset>
          <access>read-write</access>
          <resetValue>0x00006000</resetValue>
          <fields>
            <field>
              <name>HYST_EN</name>
              <description>HYST_EN</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>WU_CFG</name>
              <description>WU_CFG</description>
              <bitRange>[28:27]</bitRange>
            </field>
            <field>
              <name>IOMODE</name>
              <description>IOMODE</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG2_EN</name>
              <description>IOEV_AON_PROG2_EN</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG1_EN</name>
              <description>IOEV_AON_PROG1_EN</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG0_EN</name>
              <description>IOEV_AON_PROG0_EN</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EDGE_IRQ_EN</name>
              <description>EDGE_IRQ_EN</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EDGE_DET</name>
              <description>EDGE_DET</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PULL_CTL</name>
              <description>PULL_CTL</description>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>SLEW_RED</name>
              <description>SLEW_RED</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IOCURR</name>
              <description>IOCURR</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IOSTR</name>
              <description>IOSTR</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IOEV_RTC_EN</name>
              <description>IOEV_RTC_EN</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IOEV_MCU_WU_EN</name>
              <description>IOEV_MCU_WU_EN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PORT_ID</name>
              <description>PORT_ID</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCFG5</name>
          <description>Configuration of DIO5</description>
          <addressOffset>20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00006000</resetValue>
          <fields>
            <field>
              <name>HYST_EN</name>
              <description>HYST_EN</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>WU_CFG</name>
              <description>WU_CFG</description>
              <bitRange>[28:27]</bitRange>
            </field>
            <field>
              <name>IOMODE</name>
              <description>IOMODE</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG2_EN</name>
              <description>IOEV_AON_PROG2_EN</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG1_EN</name>
              <description>IOEV_AON_PROG1_EN</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG0_EN</name>
              <description>IOEV_AON_PROG0_EN</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EDGE_IRQ_EN</name>
              <description>EDGE_IRQ_EN</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EDGE_DET</name>
              <description>EDGE_DET</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PULL_CTL</name>
              <description>PULL_CTL</description>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>SLEW_RED</name>
              <description>SLEW_RED</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IOCURR</name>
              <description>IOCURR</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IOSTR</name>
              <description>IOSTR</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IOEV_RTC_EN</name>
              <description>IOEV_RTC_EN</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IOEV_MCU_WU_EN</name>
              <description>IOEV_MCU_WU_EN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PORT_ID</name>
              <description>PORT_ID</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCFG6</name>
          <description>Configuration of DIO6</description>
          <addressOffset>24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00006000</resetValue>
          <fields>
            <field>
              <name>HYST_EN</name>
              <description>HYST_EN</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>WU_CFG</name>
              <description>WU_CFG</description>
              <bitRange>[28:27]</bitRange>
            </field>
            <field>
              <name>IOMODE</name>
              <description>IOMODE</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG2_EN</name>
              <description>IOEV_AON_PROG2_EN</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG1_EN</name>
              <description>IOEV_AON_PROG1_EN</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG0_EN</name>
              <description>IOEV_AON_PROG0_EN</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EDGE_IRQ_EN</name>
              <description>EDGE_IRQ_EN</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EDGE_DET</name>
              <description>EDGE_DET</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PULL_CTL</name>
              <description>PULL_CTL</description>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>SLEW_RED</name>
              <description>SLEW_RED</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IOCURR</name>
              <description>IOCURR</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IOSTR</name>
              <description>IOSTR</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IOEV_RTC_EN</name>
              <description>IOEV_RTC_EN</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IOEV_MCU_WU_EN</name>
              <description>IOEV_MCU_WU_EN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PORT_ID</name>
              <description>PORT_ID</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
