tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>IOCFG21</name>
          <description>Configuration of DIO21</description>
          <addressOffset>84</addressOffset>
          <access>read-write</access>
          <resetValue>0x00006000</resetValue>
          <fields>
            <field>
              <name>HYST_EN</name>
              <description>HYST_EN</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>WU_CFG</name>
              <description>WU_CFG</description>
              <bitRange>[28:27]</bitRange>
            </field>
            <field>
              <name>IOMODE</name>
              <description>IOMODE</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG2_EN</name>
              <description>IOEV_AON_PROG2_EN</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG1_EN</name>
              <description>IOEV_AON_PROG1_EN</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG0_EN</name>
              <description>IOEV_AON_PROG0_EN</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EDGE_IRQ_EN</name>
              <description>EDGE_IRQ_EN</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EDGE_DET</name>
              <description>EDGE_DET</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PULL_CTL</name>
              <description>PULL_CTL</description>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>SLEW_RED</name>
              <description>SLEW_RED</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IOCURR</name>
              <description>IOCURR</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IOSTR</name>
              <description>IOSTR</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IOEV_RTC_EN</name>
              <description>IOEV_RTC_EN</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IOEV_MCU_WU_EN</name>
              <description>IOEV_MCU_WU_EN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PORT_ID</name>
              <description>PORT_ID</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCFG22</name>
          <description>Configuration of DIO22</description>
          <addressOffset>88</addressOffset>
          <access>read-write</access>
          <resetValue>0x00006000</resetValue>
          <fields>
            <field>
              <name>HYST_EN</name>
              <description>HYST_EN</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>WU_CFG</name>
              <description>WU_CFG</description>
              <bitRange>[28:27]</bitRange>
            </field>
            <field>
              <name>IOMODE</name>
              <description>IOMODE</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG2_EN</name>
              <description>IOEV_AON_PROG2_EN</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG1_EN</name>
              <description>IOEV_AON_PROG1_EN</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG0_EN</name>
              <description>IOEV_AON_PROG0_EN</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EDGE_IRQ_EN</name>
              <description>EDGE_IRQ_EN</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EDGE_DET</name>
              <description>EDGE_DET</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PULL_CTL</name>
              <description>PULL_CTL</description>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>SLEW_RED</name>
              <description>SLEW_RED</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IOCURR</name>
              <description>IOCURR</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IOSTR</name>
              <description>IOSTR</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IOEV_RTC_EN</name>
              <description>IOEV_RTC_EN</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IOEV_MCU_WU_EN</name>
              <description>IOEV_MCU_WU_EN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PORT_ID</name>
              <description>PORT_ID</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCFG23</name>
          <description>Configuration of DIO23</description>
          <addressOffset>92</addressOffset>
          <access>read-write</access>
          <resetValue>0x00006000</resetValue>
          <fields>
            <field>
              <name>HYST_EN</name>
              <description>HYST_EN</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>WU_CFG</name>
              <description>WU_CFG</description>
              <bitRange>[28:27]</bitRange>
            </field>
            <field>
              <name>IOMODE</name>
              <description>IOMODE</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG2_EN</name>
              <description>IOEV_AON_PROG2_EN</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG1_EN</name>
              <description>IOEV_AON_PROG1_EN</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG0_EN</name>
              <description>IOEV_AON_PROG0_EN</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EDGE_IRQ_EN</name>
              <description>EDGE_IRQ_EN</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EDGE_DET</name>
              <description>EDGE_DET</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PULL_CTL</name>
              <description>PULL_CTL</description>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>SLEW_RED</name>
              <description>SLEW_RED</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IOCURR</name>
              <description>IOCURR</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IOSTR</name>
              <description>IOSTR</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IOEV_RTC_EN</name>
              <description>IOEV_RTC_EN</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IOEV_MCU_WU_EN</name>
              <description>IOEV_MCU_WU_EN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PORT_ID</name>
              <description>PORT_ID</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCFG24</name>
          <description>Configuration of DIO24</description>
          <addressOffset>96</addressOffset>
          <access>read-write</access>
          <resetValue>0x00006000</resetValue>
          <fields>
            <field>
              <name>HYST_EN</name>
              <description>HYST_EN</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>WU_CFG</name>
              <description>WU_CFG</description>
              <bitRange>[28:27]</bitRange>
            </field>
            <field>
              <name>IOMODE</name>
              <description>IOMODE</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG2_EN</name>
              <description>IOEV_AON_PROG2_EN</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG1_EN</name>
              <description>IOEV_AON_PROG1_EN</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG0_EN</name>
              <description>IOEV_AON_PROG0_EN</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EDGE_IRQ_EN</name>
              <description>EDGE_IRQ_EN</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EDGE_DET</name>
              <description>EDGE_DET</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PULL_CTL</name>
              <description>PULL_CTL</description>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>SLEW_RED</name>
              <description>SLEW_RED</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IOCURR</name>
              <description>IOCURR</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IOSTR</name>
              <description>IOSTR</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IOEV_RTC_EN</name>
              <description>IOEV_RTC_EN</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IOEV_MCU_WU_EN</name>
              <description>IOEV_MCU_WU_EN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PORT_ID</name>
              <description>PORT_ID</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCFG25</name>
          <description>Configuration of DIO25</description>
          <addressOffset>100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00006000</resetValue>
          <fields>
            <field>
              <name>HYST_EN</name>
              <description>HYST_EN</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>WU_CFG</name>
              <description>WU_CFG</description>
              <bitRange>[28:27]</bitRange>
            </field>
            <field>
              <name>IOMODE</name>
              <description>IOMODE</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG2_EN</name>
              <description>IOEV_AON_PROG2_EN</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG1_EN</name>
              <description>IOEV_AON_PROG1_EN</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG0_EN</name>
              <description>IOEV_AON_PROG0_EN</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EDGE_IRQ_EN</name>
              <description>EDGE_IRQ_EN</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EDGE_DET</name>
              <description>EDGE_DET</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PULL_CTL</name>
              <description>PULL_CTL</description>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>SLEW_RED</name>
              <description>SLEW_RED</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IOCURR</name>
              <description>IOCURR</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IOSTR</name>
              <description>IOSTR</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IOEV_RTC_EN</name>
              <description>IOEV_RTC_EN</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IOEV_MCU_WU_EN</name>
              <description>IOEV_MCU_WU_EN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PORT_ID</name>
              <description>PORT_ID</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCFG26</name>
          <description>Configuration of DIO26</description>
          <addressOffset>104</addressOffset>
          <access>read-write</access>
          <resetValue>0x00006000</resetValue>
          <fields>
            <field>
              <name>HYST_EN</name>
              <description>HYST_EN</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>WU_CFG</name>
              <description>WU_CFG</description>
              <bitRange>[28:27]</bitRange>
            </field>
            <field>
              <name>IOMODE</name>
              <description>IOMODE</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG2_EN</name>
              <description>IOEV_AON_PROG2_EN</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG1_EN</name>
              <description>IOEV_AON_PROG1_EN</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG0_EN</name>
              <description>IOEV_AON_PROG0_EN</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EDGE_IRQ_EN</name>
              <description>EDGE_IRQ_EN</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EDGE_DET</name>
              <description>EDGE_DET</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PULL_CTL</name>
              <description>PULL_CTL</description>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>SLEW_RED</name>
              <description>SLEW_RED</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IOCURR</name>
              <description>IOCURR</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IOSTR</name>
              <description>IOSTR</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IOEV_RTC_EN</name>
              <description>IOEV_RTC_EN</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IOEV_MCU_WU_EN</name>
              <description>IOEV_MCU_WU_EN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PORT_ID</name>
              <description>PORT_ID</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCFG27</name>
          <description>Configuration of DIO27</description>
          <addressOffset>108</addressOffset>
          <access>read-write</access>
          <resetValue>0x00006000</resetValue>
          <fields>
            <field>
              <name>HYST_EN</name>
              <description>HYST_EN</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>IE</name>
              <description>IE</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>WU_CFG</name>
              <description>WU_CFG</description>
              <bitRange>[28:27]</bitRange>
            </field>
            <field>
              <name>IOMODE</name>
              <description>IOMODE</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG2_EN</name>
              <description>IOEV_AON_PROG2_EN</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG1_EN</name>
              <description>IOEV_AON_PROG1_EN</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>IOEV_AON_PROG0_EN</name>
              <description>IOEV_AON_PROG0_EN</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EDGE_IRQ_EN</name>
              <description>EDGE_IRQ_EN</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EDGE_DET</name>
              <description>EDGE_DET</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PULL_CTL</name>
              <description>PULL_CTL</description>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>SLEW_RED</name>
              <description>SLEW_RED</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IOCURR</name>
              <description>IOCURR</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IOSTR</name>
              <description>IOSTR</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IOEV_RTC_EN</name>
              <description>IOEV_RTC_EN</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>IOEV_MCU_WU_EN</name>
              <description>IOEV_MCU_WU_EN</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PORT_ID</name>
              <description>PORT_ID</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
