tyropyro/CC1312tester/cc1312/cpu-mmap.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PRCM</name>
      <description>Power, Reset and Clock Management</description>
      <baseAddress>0x40082000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>INFRCLKDIVR</name>
          <description>Infrastructure Clock Division Factor For Run Mode</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RATIO</name>
              <description>RATIO</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INFRCLKDIVS</name>
          <description>Infrastructure Clock Division Factor For Sleep Mode</description>
          <addressOffset>4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RATIO</name>
              <description>RATIO</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INFRCLKDIVDS</name>
          <description>Infrastructure Clock Division Factor For DeepSleep Mode</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RATIO</name>
              <description>RATIO</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VDCTL</name>
          <description>MCU Voltage Domain Control</description>
          <addressOffset>12</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ULDO</name>
              <description>ULDO</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKLOADCTL</name>
          <description>Load PRCM Settings To CLKCTRL Power Domain</description>
          <addressOffset>40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>LOAD_DONE</name>
              <description>LOAD_DONE</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LOAD</name>
              <description>LOAD</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RFCCLKG</name>
          <description>RFC Clock Gate</description>
          <addressOffset>44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>CLK_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VIMSCLKG</name>
          <description>VIMS Clock Gate</description>
          <addressOffset>48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>CLK_EN</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SECDMACLKGR</name>
          <description>SEC (PKA And TRNG And CRYPTO) And UDMA Clock Gate For Run And All Modes</description>
          <addressOffset>60</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMA_AM_CLK_EN</name>
              <description>DMA_AM_CLK_EN</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>PKA_ZERIOZE_RESET_N</name>
              <description>PKA_ZERIOZE_RESET_N</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>PKA_AM_CLK_EN</name>
              <description>PKA_AM_CLK_EN</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>TRNG_AM_CLK_EN</name>
              <description>TRNG_AM_CLK_EN</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CRYPTO_AM_CLK_EN</name>
              <description>CRYPTO_AM_CLK_EN</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>DMA_CLK_EN</name>
              <description>DMA_CLK_EN</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PKA_CLK_EN</name>
              <description>PKA_CLK_EN</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRNG_CLK_EN</name>
              <description>TRNG_CLK_EN</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CRYPTO_CLK_EN</name>
              <description>CRYPTO_CLK_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SECDMACLKGS</name>
          <description>SEC (PKA And TRNG And CRYPTO) And UDMA Clock Gate For Sleep Mode</description>
          <addressOffset>64</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMA_CLK_EN</name>
              <description>DMA_CLK_EN</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PKA_CLK_EN</name>
              <description>PKA_CLK_EN</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRNG_CLK_EN</name>
              <description>TRNG_CLK_EN</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CRYPTO_CLK_EN</name>
              <description>CRYPTO_CLK_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SECDMACLKGDS</name>
          <description>SEC (PKA And TRNG and CRYPTO) And UDMA Clock Gate For Deep Sleep Mode</description>
          <addressOffset>68</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMA_CLK_EN</name>
              <description>DMA_CLK_EN</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PKA_CLK_EN</name>
              <description>PKA_CLK_EN</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRNG_CLK_EN</name>
              <description>TRNG_CLK_EN</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CRYPTO_CLK_EN</name>
              <description>CRYPTO_CLK_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOCLKGR</name>
          <description>GPIO Clock Gate For Run And All Modes</description>
          <addressOffset>72</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AM_CLK_EN</name>
              <description>AM_CLK_EN</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>CLK_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOCLKGS</name>
          <description>GPIO Clock Gate For Sleep Mode</description>
          <addressOffset>76</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>CLK_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIOCLKGDS</name>
          <description>GPIO Clock Gate For Deep Sleep Mode</description>
          <addressOffset>80</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>CLK_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPTCLKGR</name>
          <description>GPT Clock Gate For Run And All Modes</description>
          <addressOffset>84</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GPT3_AM_CLK_EN</name>
              <description>Enable clock for GPT3 in all modes</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>GPT2_AM_CLK_EN</name>
              <description>Enable clock for GPT2 in all modes</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>GPT1_AM_CLK_EN</name>
              <description>Enable clock for GPT1 in all modes</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>GPT0_AM_CLK_EN</name>
              <description>Enable clock for GPT0 in all modes</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>GPT3_CLK_EN</name>
              <description>Enable clock for GPT3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>GPT2_CLK_EN</name>
              <description>Enable clock for GPT2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GPT1_CLK_EN</name>
              <description>Enable clock for GPT1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GPT0_CLK_EN</name>
              <description>Enable clock for GPT0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPTCLKGS</name>
          <description>GPT Clock Gate For Sleep Mode</description>
          <addressOffset>88</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>CLK_EN</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPTCLKGDS</name>
          <description>GPT Clock Gate For Deep Sleep Mode</description>
          <addressOffset>92</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>CLK_EN</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2CCLKGR</name>
          <description>I2C Clock Gate For Run And All Modes</description>
          <addressOffset>96</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>I2C0_AM_CLK_EN</name>
              <description>Enable clock for I2C0 for all modes</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>I2C0_CLK_EN</name>
              <description>Enable clock for I2C0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2CCLKGS</name>
          <description>I2C Clock Gate For Sleep Mode</description>
          <addressOffset>100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>CLK_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2CCLKGDS</name>
          <description>I2C Clock Gate For Deep Sleep Mode</description>
          <addressOffset>104</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>CLK_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UARTCLKGR</name>
          <description>UART Clock Gate For Run And All Modes</description>
          <addressOffset>108</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UART1_AM_CLK_EN</name>
              <description>Enable clock for UART1 for all modes</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>UART0_AM_CLK_EN</name>
              <description>Enable clock for UART0 for all modes</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>UART1_CLK_EN</name>
              <description>Enable clock for UART1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UART0_CLK_EN</name>
              <description>Enable clock for UART0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UARTCLKGS</name>
          <description>UART Clock Gate For Sleep Mode</description>
          <addressOffset>112</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>CLK_EN</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UARTCLKGDS</name>
          <description>UART Clock Gate For Deep Sleep Mode</description>
          <addressOffset>116</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>CLK_EN</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSICLKGR</name>
          <description>SSI Clock Gate For Run And All Modes</description>
          <addressOffset>120</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SSI1_AM_CLK_EN</name>
              <description>Enable clock for SSI1 for all modes</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SSI0_AM_CLK_EN</name>
              <description>Enable clock for SSI0 for all modes</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SSI1_CLK_EN</name>
              <description>Enable clock for SSI1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SSI0_CLK_EN</name>
              <description>Enable clock for SSI0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSICLKGS</name>
          <description>SSI Clock Gate For Sleep Mode</description>
          <addressOffset>124</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>CLK_EN</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSICLKGDS</name>
          <description>SSI Clock Gate For Deep Sleep Mode</description>
          <addressOffset>128</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>CLK_EN</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2SCLKGR</name>
          <description>I2S Clock Gate For Run And All Modes</description>
          <addressOffset>132</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AM_CLK_EN</name>
              <description>AM_CLK_EN</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>CLK_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2SCLKGS</name>
          <description>I2S Clock Gate For Sleep Mode</description>
          <addressOffset>136</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>CLK_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2SCLKGDS</name>
          <description>I2S Clock Gate For Deep Sleep Mode</description>
          <addressOffset>140</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>CLK_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSBUSCLKDIV</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RATIO</name>
              <description>RATIO</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUCLKDIV</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>184</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RATIO</name>
              <description>RATIO</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PERBUSCPUCLKDIV</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>188</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RATIO</name>
              <description>RATIO</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PERDMACLKDIV</name>
          <description>Internal. Only to be used through TI provided API.</description>
          <addressOffset>196</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RATIO</name>
              <description>RATIO</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2SBCLKSEL</name>
          <description>I2S Clock Control</description>
          <addressOffset>200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SRC</name>
              <description>SRC</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GPTCLKDIV</name>
          <description>GPT Scalar</description>
          <addressOffset>204</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RATIO</name>
              <description>RATIO</description>
              <bitRange>[3:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2SCLKCTL</name>
          <description>I2S Clock Control</description>
          <addressOffset>208</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SMPL_ON_POSEDGE</name>
              <description>SMPL_ON_POSEDGE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>WCLK_PHASE</name>
              <description>WCLK_PHASE</description>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>EN</name>
              <description>EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2SMCLKDIV</name>
          <description>MCLK Division Ratio</description>
          <addressOffset>212</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MDIV</name>
              <description>MDIV</description>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
