tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>I2SBCLKDIV</name>
          <description>BCLK Division Ratio</description>
          <addressOffset>216</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BDIV</name>
              <description>BDIV</description>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>I2SWCLKDIV</name>
          <description>WCLK Division Ratio</description>
          <addressOffset>220</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WDIV</name>
              <description>WDIV</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RESETSECDMA</name>
          <description>RESET For SEC (PKA And TRNG And CRYPTO) And UDMA</description>
          <addressOffset>240</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DMA</name>
              <description>DMA</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PKA</name>
              <description>PKA</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRNG</name>
              <description>TRNG</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CRYPTO</name>
              <description>CRYPTO</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RESETGPIO</name>
          <description>RESET For GPIO IPs</description>
          <addressOffset>244</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GPIO</name>
              <description>GPIO</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RESETGPT</name>
          <description>RESET For GPT Ips</description>
          <addressOffset>248</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>GPT</name>
              <description>GPT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RESETI2C</name>
          <description>RESET For I2C IPs</description>
          <addressOffset>252</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>I2C</name>
              <description>I2C</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RESETUART</name>
          <description>RESET For UART IPs</description>
          <addressOffset>256</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UART1</name>
              <description>UART1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UART0</name>
              <description>UART0</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RESETSSI</name>
          <description>RESET For SSI IPs</description>
          <addressOffset>260</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SSI</name>
              <description>SSI</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RESETI2S</name>
          <description>RESET For I2S IP</description>
          <addressOffset>264</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>I2S</name>
              <description>I2S</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCTL0</name>
          <description>Power Domain Control</description>
          <addressOffset>300</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PERIPH_ON</name>
              <description>PERIPH_ON</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SERIAL_ON</name>
              <description>SERIAL_ON</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RFC_ON</name>
              <description>RFC_ON</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCTL0RFC</name>
          <description>RFC Power Domain Control</description>
          <addressOffset>304</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ON</name>
              <description>ON</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCTL0SERIAL</name>
          <description>SERIAL Power Domain Control</description>
          <addressOffset>308</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ON</name>
              <description>ON</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCTL0PERIPH</name>
          <description>PERIPH Power Domain Control</description>
          <addressOffset>312</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ON</name>
              <description>ON</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDSTAT0</name>
          <description>Power Domain Status</description>
          <addressOffset>320</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PERIPH_ON</name>
              <description>PERIPH_ON</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SERIAL_ON</name>
              <description>SERIAL_ON</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RFC_ON</name>
              <description>RFC_ON</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDSTAT0RFC</name>
          <description>RFC Power Domain Status</description>
          <addressOffset>324</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ON</name>
              <description>ON</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDSTAT0SERIAL</name>
          <description>SERIAL Power Domain Status</description>
          <addressOffset>328</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ON</name>
              <description>ON</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDSTAT0PERIPH</name>
          <description>PERIPH Power Domain Status</description>
          <addressOffset>332</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ON</name>
              <description>ON</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCTL1</name>
          <description>Power Domain Control</description>
          <addressOffset>380</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000a</resetValue>
          <fields>
            <field>
              <name>VIMS_MODE</name>
              <description>VIMS_MODE</description>
              <bitRange>[4:3]</bitRange>
              <enumeratedValues>
                <name>VIMS_MODE_ENUM</name>
                <enumeratedValue>
                  <name>CPU_DEP</name>
                  <description>VIMS power domain is only powered when CPU power domain is powered.</description>
                  <value>0b00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUS_DEP</name>
                  <description>VIMS power domain is powered whenever the BUS power domain is powered.</description>
                  <value>0b01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLOCKED</name>
                  <description>Block power up of VIMS power domain at next wake up. This mode only has effect when VIMS power domain is not powered. Used for Autonomous RF Core.</description>
                  <value>0b1x</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFC_ON</name>
              <description>RFC_ON</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CPU_ON</name>
              <description>CPU_ON</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCTL1CPU</name>
          <description>CPU Power Domain Direct Control</description>
          <addressOffset>388</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>ON</name>
              <description>ON</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCTL1RFC</name>
          <description>RFC Power Domain Direct Control</description>
          <addressOffset>392</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ON</name>
              <description>ON</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCTL1VIMS</name>
          <description>VIMS Mode Direct Control</description>
          <addressOffset>396</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues derivedFrom="PDCTL1.VIMS_MODE.VIMS_MODE_ENUM">
                <name>MODE_ENUM</name>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PDSTAT1</name>
          <description>Power Manager Status</description>
          <addressOffset>404</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000001a</resetValue>
          <fields>
            <field>
              <name>BUS_ON</name>
              <description>BUS_ON</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>VIMS_ON</name>
              <description>VIMS_ON</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RFC_ON</name>
              <description>RFC_ON</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CPU_ON</name>
              <description>CPU_ON</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDSTAT1BUS</name>
          <description>BUS Power Domain Direct Read Status</description>
          <addressOffset>408</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>ON</name>
              <description>ON</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDSTAT1RFC</name>
          <description>RFC Power Domain Direct Read Status</description>
          <addressOffset>412</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ON</name>
              <description>ON</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDSTAT1CPU</name>
          <description>CPU Power Domain Direct Read Status</description>
          <addressOffset>416</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>ON</name>
              <description>ON</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDSTAT1VIMS</name>
          <description>VIMS Mode Direct Read Status</description>
          <addressOffset>420</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>ON</name>
              <description>ON</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RFCBITS</name>
          <description>Control To RFC</description>
          <addressOffset>460</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>READ</name>
              <description>READ</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RFCMODESEL</name>
          <description>Selected RFC Mode</description>
          <addressOffset>464</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CURR</name>
              <description>CURR</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RFCMODEHWOPT</name>
          <description>Allowed RFC Modes</description>
          <addressOffset>468</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>AVAIL</name>
              <description>AVAIL</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRPROFSTAT</name>
          <description>Power Profiler Register</description>
          <addressOffset>480</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>VALUE</name>
              <description>VALUE</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MCUSRAMCFG</name>
          <description>MCU SRAM configuration</description>
          <addressOffset>540</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <fields>
            <field>
              <name>BM_OFF</name>
              <description>BM_OFF</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>PAGE</name>
              <description>PAGE</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>PGS</name>
              <description>PGS</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BM</name>
              <description>BM</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PCH_F</name>
              <description>PCH_F</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PCH_L</name>
              <description>PCH_L</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMRETEN</name>
          <description>Memory Retention Control</description>
          <addressOffset>548</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000b</resetValue>
          <fields>
            <field>
              <name>RFCULL</name>
              <description>RFCULL</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RFC</name>
              <description>RFC</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>VIMS</name>
              <description>VIMS</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCIMSC</name>
          <description>Oscillator Interrupt Mask</description>
          <addressOffset>656</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000036</resetValue>
          <fields>
            <field>
              <name>HFSRCPENDIM</name>
              <description>HFSRCPENDIM</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LFSRCDONEIM</name>
              <description>LFSRCDONEIM</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>XOSCDLFIM</name>
              <description>XOSCDLFIM</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>XOSCLFIM</name>
              <description>XOSCLFIM</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RCOSCDLFIM</name>
              <description>RCOSCDLFIM</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RCOSCLFIM</name>
              <description>RCOSCLFIM</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>XOSCHFIM</name>
              <description>XOSCHFIM</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RCOSCHFIM</name>
              <description>RCOSCHFIM</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCRIS</name>
          <description>Oscillator Raw Interrupt Status</description>
          <addressOffset>660</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HFSRCPENDRIS</name>
              <description>HFSRCPENDRIS</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LFSRCDONERIS</name>
              <description>LFSRCDONERIS</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>XOSCDLFRIS</name>
              <description>XOSCDLFRIS</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>XOSCLFRIS</name>
              <description>XOSCLFRIS</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RCOSCDLFRIS</name>
              <description>RCOSCDLFRIS</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RCOSCLFRIS</name>
              <description>RCOSCLFRIS</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>XOSCHFRIS</name>
              <description>XOSCHFRIS</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RCOSCHFRIS</name>
              <description>RCOSCHFRIS</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
