tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>OSCICR</name>
          <description>Oscillator Raw Interrupt Clear</description>
          <addressOffset>664</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>HFSRCPENDC</name>
              <description>HFSRCPENDC</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LFSRCDONEC</name>
              <description>LFSRCDONEC</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>XOSCDLFC</name>
              <description>XOSCDLFC</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>XOSCLFC</name>
              <description>XOSCLFC</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RCOSCDLFC</name>
              <description>RCOSCDLFC</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RCOSCLFC</name>
              <description>RCOSCLFC</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>XOSCHFC</name>
              <description>XOSCHFC</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RCOSCHFC</name>
              <description>RCOSCHFC</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SMPH</name>
      <description>MCU Semaphore Module

          his module provides 32 binary semaphores. The state of a binary semaphore is either taken or available. 

           semaphore does not implement any ownership attribute. Still, a semaphore can be used to handle mutual exclusion scenarios.</description>
      <baseAddress>0x40084000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SMPH0</name>
          <description>MCU SEMAPHORE 0</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH1</name>
          <description>MCU SEMAPHORE 1</description>
          <addressOffset>4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH2</name>
          <description>MCU SEMAPHORE 2</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH3</name>
          <description>MCU SEMAPHORE 3</description>
          <addressOffset>12</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH4</name>
          <description>MCU SEMAPHORE 4</description>
          <addressOffset>16</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH5</name>
          <description>MCU SEMAPHORE 5</description>
          <addressOffset>20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH6</name>
          <description>MCU SEMAPHORE 6</description>
          <addressOffset>24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH7</name>
          <description>MCU SEMAPHORE 7</description>
          <addressOffset>28</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH8</name>
          <description>MCU SEMAPHORE 8</description>
          <addressOffset>32</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH9</name>
          <description>MCU SEMAPHORE 9</description>
          <addressOffset>36</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH10</name>
          <description>MCU SEMAPHORE 10</description>
          <addressOffset>40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH11</name>
          <description>MCU SEMAPHORE 11</description>
          <addressOffset>44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH12</name>
          <description>MCU SEMAPHORE 12</description>
          <addressOffset>48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH13</name>
          <description>MCU SEMAPHORE 13</description>
          <addressOffset>52</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH14</name>
          <description>MCU SEMAPHORE 14</description>
          <addressOffset>56</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH15</name>
          <description>MCU SEMAPHORE 15</description>
          <addressOffset>60</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH16</name>
          <description>MCU SEMAPHORE 16</description>
          <addressOffset>64</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH17</name>
          <description>MCU SEMAPHORE 17</description>
          <addressOffset>68</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH18</name>
          <description>MCU SEMAPHORE 18</description>
          <addressOffset>72</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH19</name>
          <description>MCU SEMAPHORE 19</description>
          <addressOffset>76</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH20</name>
          <description>MCU SEMAPHORE 20</description>
          <addressOffset>80</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH21</name>
          <description>MCU SEMAPHORE 21</description>
          <addressOffset>84</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH22</name>
          <description>MCU SEMAPHORE 22</description>
          <addressOffset>88</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH23</name>
          <description>MCU SEMAPHORE 23</description>
          <addressOffset>92</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH24</name>
          <description>MCU SEMAPHORE 24</description>
          <addressOffset>96</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH25</name>
          <description>MCU SEMAPHORE 25</description>
          <addressOffset>100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH26</name>
          <description>MCU SEMAPHORE 26</description>
          <addressOffset>104</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH27</name>
          <description>MCU SEMAPHORE 27</description>
          <addressOffset>108</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH28</name>
          <description>MCU SEMAPHORE 28</description>
          <addressOffset>112</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH29</name>
          <description>MCU SEMAPHORE 29</description>
          <addressOffset>116</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH30</name>
          <description>MCU SEMAPHORE 30</description>
          <addressOffset>120</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPH31</name>
          <description>MCU SEMAPHORE 31</description>
          <addressOffset>124</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
              <readAction>clear</readAction>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK0</name>
          <description>MCU SEMAPHORE 0 ALIAS</description>
          <addressOffset>2048</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK1</name>
          <description>MCU SEMAPHORE 1 ALIAS</description>
          <addressOffset>2052</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK2</name>
          <description>MCU SEMAPHORE 2 ALIAS</description>
          <addressOffset>2056</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK3</name>
          <description>MCU SEMAPHORE 3 ALIAS</description>
          <addressOffset>2060</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK4</name>
          <description>MCU SEMAPHORE 4 ALIAS</description>
          <addressOffset>2064</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK5</name>
          <description>MCU SEMAPHORE 5 ALIAS</description>
          <addressOffset>2068</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK6</name>
          <description>MCU SEMAPHORE 6 ALIAS</description>
          <addressOffset>2072</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK7</name>
          <description>MCU SEMAPHORE 7 ALIAS</description>
          <addressOffset>2076</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK8</name>
          <description>MCU SEMAPHORE 8 ALIAS</description>
          <addressOffset>2080</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK9</name>
          <description>MCU SEMAPHORE 9 ALIAS</description>
          <addressOffset>2084</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK10</name>
          <description>MCU SEMAPHORE 10 ALIAS</description>
          <addressOffset>2088</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK11</name>
          <description>MCU SEMAPHORE 11 ALIAS</description>
          <addressOffset>2092</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK12</name>
          <description>MCU SEMAPHORE 12 ALIAS</description>
          <addressOffset>2096</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
