tyropyro/CC1312tester/cc1312/cpu-mmap.svd
        <register>
          <name>PEEK13</name>
          <description>MCU SEMAPHORE 13 ALIAS</description>
          <addressOffset>2100</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK14</name>
          <description>MCU SEMAPHORE 14 ALIAS</description>
          <addressOffset>2104</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK15</name>
          <description>MCU SEMAPHORE 15 ALIAS</description>
          <addressOffset>2108</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK16</name>
          <description>MCU SEMAPHORE 16 ALIAS</description>
          <addressOffset>2112</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK17</name>
          <description>MCU SEMAPHORE 17 ALIAS</description>
          <addressOffset>2116</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK18</name>
          <description>MCU SEMAPHORE 18 ALIAS</description>
          <addressOffset>2120</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK19</name>
          <description>MCU SEMAPHORE 19 ALIAS</description>
          <addressOffset>2124</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK20</name>
          <description>MCU SEMAPHORE 20 ALIAS</description>
          <addressOffset>2128</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK21</name>
          <description>MCU SEMAPHORE 21 ALIAS</description>
          <addressOffset>2132</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK22</name>
          <description>MCU SEMAPHORE 22 ALIAS</description>
          <addressOffset>2136</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK23</name>
          <description>MCU SEMAPHORE 23 ALIAS</description>
          <addressOffset>2140</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK24</name>
          <description>MCU SEMAPHORE 24 ALIAS</description>
          <addressOffset>2144</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK25</name>
          <description>MCU SEMAPHORE 25 ALIAS</description>
          <addressOffset>2148</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK26</name>
          <description>MCU SEMAPHORE 26 ALIAS</description>
          <addressOffset>2152</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK27</name>
          <description>MCU SEMAPHORE 27 ALIAS</description>
          <addressOffset>2156</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK28</name>
          <description>MCU SEMAPHORE 28 ALIAS</description>
          <addressOffset>2160</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK29</name>
          <description>MCU SEMAPHORE 29 ALIAS</description>
          <addressOffset>2164</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK30</name>
          <description>MCU SEMAPHORE 30 ALIAS</description>
          <addressOffset>2168</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PEEK31</name>
          <description>MCU SEMAPHORE 31 ALIAS</description>
          <addressOffset>2172</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
