tyropyro/CC1312tester/cc1312/cpu-mmap.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TRNG</name>
      <description>True Random Number Generator</description>
      <baseAddress>0x40028000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x2000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OUT0</name>
          <description>Random Number Lower Word Readout Value</description>
          <addressOffset>0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE_31_0</name>
              <description>VALUE_31_0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT1</name>
          <description>Random Number Upper Word Readout Value</description>
          <addressOffset>4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VALUE_63_32</name>
              <description>VALUE_63_32</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQFLAGSTAT</name>
          <description>Interrupt Status</description>
          <addressOffset>8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NEED_CLOCK</name>
              <description>NEED_CLOCK</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>SHUTDOWN_OVF</name>
              <description>SHUTDOWN_OVF</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RDY</name>
              <description>RDY</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQFLAGMASK</name>
          <description>Interrupt Mask</description>
          <addressOffset>12</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SHUTDOWN_OVF</name>
              <description>SHUTDOWN_OVF</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RDY</name>
              <description>RDY</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQFLAGCLR</name>
          <description>Interrupt Flag Clear</description>
          <addressOffset>16</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SHUTDOWN_OVF</name>
              <description>SHUTDOWN_OVF</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RDY</name>
              <description>RDY</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <description>Control</description>
          <addressOffset>20</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STARTUP_CYCLES</name>
              <description>STARTUP_CYCLES</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>TRNG_EN</name>
              <description>TRNG_EN</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>NO_LFSR_FB</name>
              <description>NO_LFSR_FB</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TEST_MODE</name>
              <description>TEST_MODE</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG0</name>
          <description>Configuration 0</description>
          <addressOffset>24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MAX_REFILL_CYCLES</name>
              <description>MAX_REFILL_CYCLES</description>
              <bitRange>[31:16]</bitRange>
            </field>
            <field>
              <name>SMPL_DIV</name>
              <description>SMPL_DIV</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>MIN_REFILL_CYCLES</name>
              <description>MIN_REFILL_CYCLES</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALARMCNT</name>
          <description>Alarm Control</description>
          <addressOffset>28</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000ff</resetValue>
          <fields>
            <field>
              <name>SHUTDOWN_CNT</name>
              <description>SHUTDOWN_CNT</description>
              <bitRange>[29:24]</bitRange>
            </field>
            <field>
              <name>SHUTDOWN_THR</name>
              <description>SHUTDOWN_THR</description>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>ALARM_THR</name>
              <description>ALARM_THR</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FROEN</name>
          <description>FRO Enable</description>
          <addressOffset>32</addressOffset>
          <access>read-write</access>
          <resetValue>0x00ffffff</resetValue>
          <fields>
            <field>
              <name>FRO_MASK</name>
              <description>FRO_MASK</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FRODETUNE</name>
          <description>FRO De-tune Bit</description>
          <addressOffset>36</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FRO_MASK</name>
              <description>FRO_MASK</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALARMMASK</name>
          <description>Alarm Event</description>
          <addressOffset>40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FRO_MASK</name>
              <description>FRO_MASK</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALARMSTOP</name>
          <description>Alarm Shutdown</description>
          <addressOffset>44</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FRO_FLAGS</name>
              <description>FRO_FLAGS</description>
              <bitRange>[23:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LFSR0</name>
          <description>LFSR Readout Value</description>
          <addressOffset>48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LFSR_31_0</name>
              <description>LFSR_31_0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LFSR1</name>
          <description>LFSR Readout Value</description>
          <addressOffset>52</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LFSR_63_32</name>
              <description>LFSR_63_32</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LFSR2</name>
          <description>LFSR Readout Value</description>
          <addressOffset>56</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LFSR_80_64</name>
              <description>LFSR_80_64</description>
              <bitRange>[16:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HWOPT</name>
          <description>TRNG Engine Options Information</description>
          <addressOffset>120</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000600</resetValue>
          <fields>
            <field>
              <name>NR_OF_FROS</name>
              <description>NR_OF_FROS</description>
              <bitRange>[11:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HWVER0</name>
          <description>HW Version 0
          IP Number And Core Revision</description>
          <addressOffset>124</addressOffset>
          <access>read-only</access>
          <resetValue>0x0200b44b</resetValue>
          <fields>
            <field>
              <name>HW_MAJOR_VER</name>
              <description>HW_MAJOR_VER</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>HW_MINOR_VER</name>
              <description>HW_MINOR_VER</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>HW_PATCH_LVL</name>
              <description>HW_PATCH_LVL</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>EIP_NUM_COMPL</name>
              <description>EIP_NUM_COMPL</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>EIP_NUM</name>
              <description>EIP_NUM</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQSTATMASK</name>
          <description>Interrupt Status After Masking</description>
          <addressOffset>8152</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SHUTDOWN_OVF</name>
              <description>SHUTDOWN_OVF</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RDY</name>
              <description>RDY</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HWVER1</name>
          <description>HW Version 1
          RNG Revision Number</description>
          <addressOffset>8160</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000020</resetValue>
          <fields>
            <field>
              <name>REV</name>
              <description>REV</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQSET</name>
          <description>Interrupt Set</description>
          <addressOffset>8172</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>SWRESET</name>
          <description>SW Reset Control</description>
          <addressOffset>8176</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RESET</name>
              <description>RESET</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQSTAT</name>
          <description>Interrupt Status</description>
          <addressOffset>8184</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STAT</name>
              <description>STAT</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
