tyropyro/CC1312tester/cc1312/cpu-mmap.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>UDMA0</name>
      <description>ARM Micro Direct Memory Access Controller</description>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0</addressOffset>
          <access>read-only</access>
          <resetValue>0x001f0000</resetValue>
          <fields>
            <field>
              <name>TEST</name>
              <description>TEST</description>
              <bitRange>[31:28]</bitRange>
            </field>
            <field>
              <name>TOTALCHANNELS</name>
              <description>TOTALCHANNELS</description>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>STATE</name>
              <description>STATE</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>MASTERENABLE</name>
              <description>MASTERENABLE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>Configuration</description>
          <addressOffset>4</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PRTOCTRL</name>
              <description>PRTOCTRL</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>MASTERENABLE</name>
              <description>MASTERENABLE</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>Channel Control Data Base Pointer</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BASEPTR</name>
              <description>BASEPTR</description>
              <bitRange>[31:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALTCTRL</name>
          <description>Channel Alternate Control Data Base Pointer</description>
          <addressOffset>12</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000200</resetValue>
          <fields>
            <field>
              <name>BASEPTR</name>
              <description>BASEPTR</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WAITONREQ</name>
          <description>Channel Wait On Request Status</description>
          <addressOffset>16</addressOffset>
          <access>read-only</access>
          <resetValue>0xffff1eff</resetValue>
          <fields>
            <field>
              <name>CHNLSTATUS</name>
              <description>CHNLSTATUS</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SOFTREQ</name>
          <description>Channel Software Request</description>
          <addressOffset>20</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>CHNLS</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SETBURST</name>
          <description>Channel Set UseBurst</description>
          <addressOffset>24</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>CHNLS</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLEARBURST</name>
          <description>Channel Clear UseBurst</description>
          <addressOffset>28</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>CHNLS</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SETREQMASK</name>
          <description>Channel Set Request Mask</description>
          <addressOffset>32</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>CHNLS</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLEARREQMASK</name>
          <description>Clear Channel Request Mask</description>
          <addressOffset>36</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>CHNLS</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SETCHANNELEN</name>
          <description>Set Channel Enable</description>
          <addressOffset>40</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>CHNLS</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLEARCHANNELEN</name>
          <description>Clear Channel Enable</description>
          <addressOffset>44</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>CHNLS</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SETCHNLPRIALT</name>
          <description>Channel Set Primary-Alternate</description>
          <addressOffset>48</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>CHNLS</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLEARCHNLPRIALT</name>
          <description>Channel Clear Primary-Alternate</description>
          <addressOffset>52</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>CHNLS</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SETCHNLPRIORITY</name>
          <description>Set Channel Priority</description>
          <addressOffset>56</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>CHNLS</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLEARCHNLPRIORITY</name>
          <description>Clear Channel Priority</description>
          <addressOffset>60</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>CHNLS</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ERROR</name>
          <description>Error Status and Clear</description>
          <addressOffset>76</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STATUS</name>
              <description>STATUS</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REQDONE</name>
          <description>Channel Request Done</description>
          <addressOffset>1284</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>CHNLS</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DONEMASK</name>
          <description>Channel Request Done Mask</description>
          <addressOffset>1312</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHNLS</name>
              <description>CHNLS</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
