tyropyro/CC1312tester/cc1312/cpu-mmap.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>VIMS</name>
      <description>Versatile Instruction Memory System
          ontrols memory access to the Flash and encapsulates the following instruction memories:
           Boot ROM
           Cache / GPRAM</description>
      <baseAddress>0x40034000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>STAT</name>
          <description>Status
          isplays current VIMS mode and line buffer status</description>
          <addressOffset>0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDCODE_LB_DIS</name>
              <description>IDCODE_LB_DIS</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSBUS_LB_DIS</name>
              <description>SYSBUS_LB_DIS</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MODE_CHANGING</name>
              <description>MODE_CHANGING</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>INV</name>
              <description>INV</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <description>Control
          onfigure VIMS mode and line buffer settings</description>
          <addressOffset>4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STATS_CLR</name>
              <description>STATS_CLR</description>
              <bitRange>[31:31]</bitRange>
            </field>
            <field>
              <name>STATS_EN</name>
              <description>STATS_EN</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>DYN_CG_EN</name>
              <description>DYN_CG_EN</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>IDCODE_LB_DIS</name>
              <description>IDCODE_LB_DIS</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SYSBUS_LB_DIS</name>
              <description>SYSBUS_LB_DIS</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ARB_CFG</name>
              <description>ARB_CFG</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PREF_EN</name>
              <description>PREF_EN</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitRange>[1:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT</name>
      <description>Watchdog Timer</description>
      <baseAddress>0x40080000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LOAD</name>
          <description>Configuration</description>
          <addressOffset>0</addressOffset>
          <access>read-write</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>WDTLOAD</name>
              <description>WDTLOAD</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VALUE</name>
          <description>Current Count Value</description>
          <addressOffset>4</addressOffset>
          <access>read-only</access>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>WDTVALUE</name>
              <description>WDTVALUE</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <description>Control</description>
          <addressOffset>8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTTYPE</name>
              <description>INTTYPE</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RESEN</name>
              <description>RESEN</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>INTEN</name>
              <description>INTEN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>Interrupt Clear</description>
          <addressOffset>12</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WDTICR</name>
              <description>WDTICR</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>Raw Interrupt Status</description>
          <addressOffset>16</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WDTRIS</name>
              <description>WDTRIS</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>Masked Interrupt Status</description>
          <addressOffset>20</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WDTMIS</name>
              <description>WDTMIS</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST</name>
          <description>Test Mode</description>
          <addressOffset>1048</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>STALL</name>
              <description>STALL</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TEST_EN</name>
              <description>TEST_EN</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CAUS</name>
          <description>Interrupt Cause Test Mode</description>
          <addressOffset>1052</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CAUSE_RESET</name>
              <description>CAUSE_RESET</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CAUSE_INTR</name>
              <description>CAUSE_INTR</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <description>Lock</description>
          <addressOffset>3072</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WDTLOCK</name>
              <description>WDTLOCK</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
